{
	"feed" :
	[
		{
			"story" :
			{
				"title" : "Majority of Consumers Research Products Online Before Purchase",
				"description" : "<p>According to a recent <a href=&quot;http://pewinternet.org/Reports/2010/Online-Product-Research.aspx&quot; target=&quot;_blank&quot;>study conducted by Pew Research Center</a>, 58% of all American adults now perform online research on the products and services they consider purchasing, representing an increase from 49% in 2004.&nbsp; Nearly half of those adults (and 24% of all Americans) have posted comments or reviews online about the products they buy.</p> <p>Just among internet users, 78% of Americans conduct product research online before purchasing, and 32% post product reviews or comments online about their purchases.</p>  <p>This coincides with the rise in popularity of social networks &ndash; nearly half (46%) of all Americans now use social networks, up from 5% in 2005. &nbsp;</p> <p>We all know that consumers rely on peer opinions to help drive purchase decisions &ndash; this is not a new phenomenon.&nbsp; However, with half of all Americans using social networks to share information with friends and colleagues, retailers have struggled to find a way to kindle brand conversations among consumers across these new media.</p> <p>The fusion of trends highlighted in the Pew study reinforces the mandate for retailers to make interactivity and sharing of product information and reviews as simple as possible.&nbsp; For example, retailers using <a href=&quot;/products/engage&quot;>Janrain Engage</a> can enable consumers to easily share product reviews with friends on social networks such as Facebook and Twitter.</p>  <p><img alt=%34Janrain Engage Social Sharing Retail Website%34 src=%34/sites/default/files/social-sharing-review-retail.JPG%34 style=%34width: 280px; height: 278px;%34 /><br />  &nbsp;</p>  <p>By leveraging <a href=&quot;/products/engage&quot;>Janrain Engage</a> for social sharing, retailers can translate user-generated product reviews from their corporate website into peer-to-peer interactions on social network feeds.&nbsp; This improves brand awareness, drives qualified referral traffic back to the corporate site, and informs future purchase decisions.</p> <p>Another interesting tidbit:&nbsp; The Pew study found no significant differences among age groups in the likelihood of posting online product reviews.&nbsp; This is further evidence that, no matter the age demographics of your company&rsquo;s target market, there is value in adding community features and enabling user-generated content through product reviews, ratings or comments.</p>",
				"plainText" : "According to a recent study conducted by Pew Research Center, 58% of all American adults now perform online research on the products and services they consider purchasing, representing an increase from 49% in 2004.  Nearly half of those adults (and 24% of all Americans) have posted comments or reviews online about the products they buy. Just among internet users, 78% of Americans conduct product research online before purchasing, and 32% post product reviews or comments online about their purchases.  This coincides with the rise in popularity of social networks - nearly half (46%) of all Americans now use social networks, up from 5% in 2005.   We all know that consumers rely on peer opinions to help drive purchase decisions - this is not a new phenomenon.  However, with half of all Americans using social networks to share information with friends and colleagues, retailers have struggled to find a way to kindle brand conversations among consumers across these new media. The fusion of trends highlighted in the Pew study reinforces the mandate for retailers to make interactivity and sharing of product information and reviews as simple as possible.  For example, retailers using Janrain Engage can enable consumers to easily share product reviews with friends on social networks such as Facebook and Twitter.       By leveraging Janrain Engage for social sharing, retailers can translate user-generated product reviews from their corporate website into peer-to-peer interactions on social network feeds.  This improves brand awareness, drives qualified referral traffic back to the corporate site, and informs future purchase decisions. Another interesting tidbit:  The Pew study found no significant differences among age groups in the likelihood of posting online product reviews.  This is further evidence that, no matter the age demographics of your company's target market, there is value in adding community features and enabling user-generated content through product reviews, ratings or comments.",
				"link" : "http://www.janrain.comblogs/majority-consumers-research-products-online-purchase",
				"creator" : "Michael Olson",
				"date" : "Nov 11, 2010 6:41 PM",
				"images" :
				[
					"/sites/default/files/social-sharing-review-retail.JPG"
				]
			}
		},
		{
			"story" :
			{
				"title" : "Janrain Engage Makes it Easy for iPhone Users to Share to Social Networks",
				"description" : "<p>In a recent <a href=&quot;http://www.appcelerator.com/mobile-developer-report-September-2010/&quot; target=&quot;_blank&quot;>survey</a> of over 1900 smart phone developers published by <a href=&quot;http://www.appcelerator.com/&quot; target=&quot;_blank&quot;>Appcelerator</a> and <a href=&quot;http://www.idc.com/&quot; target=&quot;_blank&quot;>IDC</a>, 65% of those surveyed cited the need for social networking APIs on mobile platforms. <a href=&quot;http://www.janrain.com&quot;>Janrain</a>, the user management platform for the social web, is happy to extend its support for the iPhone platform to meet this need and offer a native iPhone SDK for sharing content and activity on your apps to Facebook, Twitter, LinkedIn, Yahoo!, MySpace and other social networks.</p>  <p> In April, we launched <a href=&quot;/blogs/janrain-rpx-iphone&quot;>native iPhone support for social login</a> and today, <a href=&quot;http://techcrunch.com/2010/10/07/janrain-engage-offers-social-publishing-for-the-iphone/&quot; target=&quot;_blank&quot;>TechCrunch reported</a> that we have extended <a href=&quot;/products/engage/mobile&quot;>Janrain Engage for iPhone</a> to enable a user to share directly from an iPhone app to multiple social networks simultaneously. Imagine you&rsquo;ve just hit your highest score on your favorite iPhone game. Now with an easy click you can share your good news with friends on Facebook, Twitter, and other online communities.</p>  <p> To see how an application can take advantage of the SDK, download our demo app, <a href=&quot;http://itunes.apple.com/us/app/quick-publish/id389229631?mt=8&quot;>Janrain Quick Publish</a>, from Apple&rsquo;s App Store.</p> <p> With this release, Janrain extends all capabilities available in the web-based version of <a href=&quot;/products/engage&quot;>Janrain Engage</a> to the iPhone platform. Core benefits of Janrain Engage for iPhone include:</p>  <ul> <li><strong>Simplicity</strong>: The iPhone SDK comes with a pre-built native UI kit that developers can customize via the Janrain Engage Application dashboard. A quick start guide walks developers through the process of implementing the library.</li> <li><strong>Security</strong>: Janrain&#39;s native SDK for mobile utilizes robust and secure APIs that are simple, effective and remove the need to create complicated security systems to mask API keys on mobile devices.</li>  <li><strong>Elegance</strong>: iPhone app users enjoy a native iPhone experience when signing-up or sharing with their social networks. Similar to the web-based version, the mobile version remembers the user&#39;s preferred provider on return visits, to help ensure a positive and intuitive return user experience.</li> </ul> <p><a href=&quot;/products/engage/mobile&quot;>Janrain Engage for iPhone</a> offers solutions for both pure-play iPhone app developers and websites with a mobile app presence. Developers can choose between a lightweight client-side implementation or a server-side integration that enables additional features such as access to a user&rsquo;s friends and contacts, and mapping of multiple social network identities to a single user. Other standard features of Janrain Engage such as URL shortening, analytics and tracking of referral clicks are also available to iPhone Apps. &nbsp;</p>  <p> Screenshots below show the end user experience optimized for the iPhone screen:</p> <p><img alt=%34social sharing with Janrain Engage for iPhone%34 src=%34/sites/default/files/iphone-social-share.JPG%34 style=%34width: 280px; height: 185px;%34 /><br />   The same Appcelerator and IDC survey noted that 4 out of 5 app developers preferred mobile apps over the mobile web, despite coming from a web development background. It is no surprise that the preference reflects the market need. Smartphone consumers prefer a native mobile experience as evidenced by <a href=&quot;http://www.apple.com/pr/library/2010/01/05appstore.html&quot;>over 3 billion app downloads</a> from the App Store by iPhone&reg; alone. Janrain has lowered the barrier to implementing social logins and sharing for your iPhone Apps.</p> <p> To download and use the SDK in your iPhone App, please visit your <a href=&quot;http://www.rpxnow.com&quot;>Janrain Engage product dashboard</a> and click &ldquo;Sign up now&quot; next to the iPhone badge. You will be guided through the download and implementation process. We hope you will enjoy implementing our SDK and welcome all feedback.</p>",
				"plainText" : "In a recent survey of over 1900 smart phone developers published by Appcelerator and IDC, 65% of those surveyed cited the need for social networking APIs on mobile platforms. Janrain, the user management platform for the social web, is happy to extend its support for the iPhone platform to meet this need and offer a native iPhone SDK for sharing content and activity on your apps to Facebook, Twitter, LinkedIn, Yahoo!, MySpace and other social networks.   In April, we launched native iPhone support for social login and today, TechCrunch reported that we have extended Janrain Engage for iPhone to enable a user to share directly from an iPhone app to multiple social networks simultaneously. Imagine you've just hit your highest score on your favorite iPhone game. Now with an easy click you can share your good news with friends on Facebook, Twitter, and other online communities.   To see how an application can take advantage of the SDK, download our demo app, Janrain Quick Publish, from Apple's App Store.  With this release, Janrain extends all capabilities available in the web-based version of Janrain Engage to the iPhone platform. Core benefits of Janrain Engage for iPhone include:   Simplicity: The iPhone SDK comes with a pre-built native UI kit that developers can customize via the Janrain Engage Application dashboard. A quick start guide walks developers through the process of implementing the library. Security: Janrain's native SDK for mobile utilizes robust and secure APIs that are simple, effective and remove the need to create complicated security systems to mask API keys on mobile devices.  Elegance: iPhone app users enjoy a native iPhone experience when signing-up or sharing with their social networks. Similar to the web-based version, the mobile version remembers the user's preferred provider on return visits, to help ensure a positive and intuitive return user experience.  Janrain Engage for iPhone offers solutions for both pure-play iPhone app developers and websites with a mobile app presence. Developers can choose between a lightweight client-side implementation or a server-side integration that enables additional features such as access to a user's friends and contacts, and mapping of multiple social network identities to a single user. Other standard features of Janrain Engage such as URL shortening, analytics and tracking of referral clicks are also available to iPhone Apps.     Screenshots below show the end user experience optimized for the iPhone screen:    The same Appcelerator and IDC survey noted that 4 out of 5 app developers preferred mobile apps over the mobile web, despite coming from a web development background. It is no surprise that the preference reflects the market need. Smartphone consumers prefer a native mobile experience as evidenced by over 3 billion app downloads from the App Store by iPhone&reg; alone. Janrain has lowered the barrier to implementing social logins and sharing for your iPhone Apps.  To download and use the SDK in your iPhone App, please visit your Janrain Engage product dashboard and click %34Sign up now%34 next to the iPhone badge. You will be guided through the download and implementation process. We hope you will enjoy implementing our SDK and welcome all feedback.",
				"link" : "http://www.janrain.comblogs/janrain-engage-makes-it-easy-iphone-users-share-social-networks",
				"creator" : "Vidya Shivkumar",
				"date" : "Nov 7, 2010 4:30 PM",
				"images" :
				[
					"/sites/default/files/iphone-social-share.JPG"
				]
			}
		},
		{
			"story" :
			{
				"title" : "Janrain Integrates with Leading Commenting Platforms: Disqus, Echo and Pluck",
				"description" : "<p><img alt=%34comment bubble%34 src=%34/../../sites/default/files/demikl_d_rounded_speech_bubble_clip_art_31739.jpg%34 style=%34padding: 0pt 0pt 20px 20px; width: 180px; height: 187px; float: right;%34 />Many of us recall the famous New Yorker cartoon from the 1990s that read &ldquo;<a href=&quot;http://en.wikipedia.org/wiki/On_the_Internet,_nobody_knows_you&#39;re_a_dog&quot; target=&quot;_blank&quot;>On the Internet, Nobody Knows You&#39;re a Dog</a>.&rdquo; Fast-forward a decade and a half. Social media has given rise to new and different <a href=&quot;http://www.briansolis.com/2010/03/behaviorgraphics-humanize-the-social-web/&quot; target=&quot;_blank&quot;>online behaviors</a>. More consumers are creating, curating and critiquing online content than ever before, and now, penning their comments under a real identity.</p>  <p> Eager to take advantage of this behavior and the <a href=&quot;/blogs/news-sites-moving-away-anonymous-online-comments&quot;>diminishing need for online anonymity</a>, websites ranging from online guides to news media and entertainment sites to retail websites are enabling their readers to build social communities around content and discussions.</p> <p> Today, Janrain is happy to announce deep technical integrations with the three leading commenting platforms: <a href=&quot;http://www.disqus.com&quot; target=&quot;_blank&quot;>Disqus</a>, <a href=&quot;http://www.aboutecho.com&quot; target=&quot;_blank&quot;>Echo</a> and <a href=&quot;http://www.pluck.com&quot; target=&quot;_blank&quot;>Pluck</a>, to make it easy to link a user&rsquo;s existing online identity on your website with his or her commenting persona.</p>  <ul> <li><strong>DISQUS </strong>builds and connects communities via a large and rapidly growing network that spans over 200 million users each month, and provides publishers with advanced commenter interface and moderation tools. <p>  <em>&ldquo;DISQUS is proud to work with another industry leader, Janrain, in making social connectivity a more comprehensive and integrated experience for publishers everywhere&rdquo; stated Ro Gupta, vice president of business development for DISQUS.</em></p></li> </ul>  <ul> <li><strong>Echo </strong>allows publishers to turn their static sites into real-time news platforms with Real-time Comments, Real-time Recent Comments and Real-time News Rivers. <p>  <em>&quot;At Echo, our focus is partnering with the leading web properties in the world to bring state of the art real-time social features to their audience. Our goal is to be an invisible toolset that empowers publishers to innovate by integrating seamlessly with their identity and registration systems. Our partnership with Janrain is just another way we ensure that Echo is supportive of our publisher&#39;s business goals and existing technologies&rdquo; stated Chris Saad, vice president of product strategy &amp; community for Echo.</em></p></li>  </ul> <ul> <li><strong>Pluck Comments </strong>is an element of the larger Pluck Social Application Server, a platform that drives community for publishers like USA Today and brands like the NFL. Pluck Comments is designed for sites that generate very large volumes of comments, at very high transaction rates, and is supported by versatile discovery features. <p>  <em>&ldquo;We are happy to partner with Janrain to provide our customers with a more complete solution for bridging their own online communities with popular destinations like Facebook and Twitter,&rdquo; said Jason Jaynes, vice president of products and marketing for Demand Media. &ldquo;Janrain Engage simplifies the process by which visitors register for community membership, by making it easy for them to use their Facebook credentials or some other non-anonymous identity. Our customers benefit from the social bridging that Janrain facilitates with more site traffic, greater visitor engagement, and higher value conversations on their sites.&rdquo;</em></p></li>  </ul> <p>Janrain&rsquo;s integration enables a website to easily register users with their identities on social networks such as Facebook, Twitter, or Google, then use this identity in online conversations, including automatically sharing their comments with their social networks.</p> <p> The benefits to websites of implementing commenting platforms and integrating online identities to commenting systems are simple and obvious:</p> <ul> <li>Quick and easy registration for users</li>  <li>Crowdsourcing of content</li> <li>Building a thriving community around subject matter experts</li> <li>Identifying and rewarding active contributors</li> <li>Popularizing content beyond the confines of your website</li> </ul>  <p>As Social Media guru, <a href=&quot;http://www.briansolis.com/&quot; target=&quot;_blank&quot;>Brian Solis</a>, points out in his book <a href=&quot;http://www.briansolis.com/2010/01/engage/&quot; target=&quot;_blank&quot;>Engage</a>, &ldquo;Social networks and platforms have expanded the roles of customers and peers from consumer to authorities, ambassadors and critics.&rdquo;&nbsp; Janrain Engage enables websites to turn your casual visitors into brand ambassadors by making it easy to build integrated and cohesive online experiences with leading commenting platforms.</p>  <p> If you are already using or considering using one of the above commenting platforms and would like to learn more about integrating a user&rsquo;s identity on social networks with your website, please <a href=&quot;/learn-more?product=Engage%20Pro&quot;>contact us</a>. Packaged integrations with each of the commenting solutions are available at the Janrain Engage Pro subscription level.</p>",
				"plainText" : "Many of us recall the famous New Yorker cartoon from the 1990s that read 'On the Internet, Nobody Knows You're a Dog.' Fast-forward a decade and a half. Social media has given rise to new and different online behaviors. More consumers are creating, curating and critiquing online content than ever before, and now, penning their comments under a real identity.   Eager to take advantage of this behavior and the diminishing need for online anonymity, websites ranging from online guides to news media and entertainment sites to retail websites are enabling their readers to build social communities around content and discussions.  Today, Janrain is happy to announce deep technical integrations with the three leading commenting platforms: Disqus, Echo and Pluck, to make it easy to link a user's existing online identity on your website with his or her commenting persona.   DISQUS builds and connects communities via a large and rapidly growing network that spans over 200 million users each month, and provides publishers with advanced commenter interface and moderation tools.   %34DISQUS is proud to work with another industry leader, Janrain, in making social connectivity a more comprehensive and integrated experience for publishers everywhere%34 stated Ro Gupta, vice president of business development for DISQUS.    Echo allows publishers to turn their static sites into real-time news platforms with Real-time Comments, Real-time Recent Comments and Real-time News Rivers.   %34At Echo, our focus is partnering with the leading web properties in the world to bring state of the art real-time social features to their audience. Our goal is to be an invisible toolset that empowers publishers to innovate by integrating seamlessly with their identity and registration systems. Our partnership with Janrain is just another way we ensure that Echo is supportive of our publisher's business goals and existing technologies%34 stated Chris Saad, vice president of product strategy &amp; community for Echo.    Pluck Comments is an element of the larger Pluck Social Application Server, a platform that drives community for publishers like USA Today and brands like the NFL. Pluck Comments is designed for sites that generate very large volumes of comments, at very high transaction rates, and is supported by versatile discovery features.   %34We are happy to partner with Janrain to provide our customers with a more complete solution for bridging their own online communities with popular destinations like Facebook and Twitter,%34 said Jason Jaynes, vice president of products and marketing for Demand Media. %34Janrain Engage simplifies the process by which visitors register for community membership, by making it easy for them to use their Facebook credentials or some other non-anonymous identity. Our customers benefit from the social bridging that Janrain facilitates with more site traffic, greater visitor engagement, and higher value conversations on their sites.%34   Janrain's integration enables a website to easily register users with their identities on social networks such as Facebook, Twitter, or Google, then use this identity in online conversations, including automatically sharing their comments with their social networks.  The benefits to websites of implementing commenting platforms and integrating online identities to commenting systems are simple and obvious:  Quick and easy registration for users  Crowdsourcing of content Building a thriving community around subject matter experts Identifying and rewarding active contributors Popularizing content beyond the confines of your website   As Social Media guru, Brian Solis, points out in his book Engage, %34Social networks and platforms have expanded the roles of customers and peers from consumer to authorities, ambassadors and critics.%34  Janrain Engage enables websites to turn your casual visitors into brand ambassadors by making it easy to build integrated and cohesive online experiences with leading commenting platforms.   If you are already using or considering using one of the above commenting platforms and would like to learn more about integrating a user's identity on social networks with your website, please contact us. Packaged integrations with each of the commenting solutions are available at the Janrain Engage Pro subscription level.",
				"link" : "http://www.janrain.comblogs/janrain-integrates-leading-commenting-platforms-disqus-echo-and-pluck",
				"creator" : "Vidya Shivkumar",
				"date" : "Nov 5, 2010 3:00 PM",
				"images" :
				[
					"/../../sites/default/files/demikl_d_rounded_speech_bubble_clip_art_31739.jpg"
				]
			}
		},
		{
			"story" :
			{
				"title" : "Enabling Janrain Engage in Rails with Devise - Video",
				"description" : "<p><a href=&quot;http://railscasts.com/&quot; target=&quot;_blank&quot;>Railscasts</a> recently posted a <a href=&quot;http://railscasts.com/episodes/233-engage-with-devise&quot; target=&quot;_blank&quot;>video tutorial demonstrating how to configure Janrain Engage in Rails with Devise</a>.&nbsp; The video provides step-by-step instructions to get up and running with Janrain Engage for social login on a Rails application in minutes.&nbsp; Take a look at the video and feel free to share your thoughts in the comments section below.</p>  <p><object height=&quot;385&quot; width=&quot;480&quot;><param name=&quot;movie&quot; value=&quot;http://www.youtube.com/v/ejsH707S7aM?fs=1&amp;hl=en_US&quot; /><param name=&quot;allowFullScreen&quot; value=&quot;true&quot; /><param name=&quot;allowscriptaccess&quot; value=&quot;always&quot; /><embed allowfullscreen=&quot;true&quot; allowscriptaccess=&quot;always&quot; height=&quot;385&quot; src=&quot;http://www.youtube.com/v/ejsH707S7aM?fs=1&amp;hl=en_US&quot; type=&quot;application/x-shockwave-flash&quot; width=&quot;480&quot;></embed></object></p><p>   Railscasts produces weekly video episodes featuring tips and tricks for developers working with Ruby on Rails.&nbsp; Special thanks to Ryan Bates at Railscasts for creating the demonstration.</p>",
				"plainText" : "Railscasts recently posted a video tutorial demonstrating how to configure Janrain Engage in Rails with Devise.  The video provides step-by-step instructions to get up and running with Janrain Engage for social login on a Rails application in minutes.  Take a look at the video and feel free to share your thoughts in the comments section below.     Railscasts produces weekly video episodes featuring tips and tricks for developers working with Ruby on Rails.  Special thanks to Ryan Bates at Railscasts for creating the demonstration.",
				"link" : "http://www.janrain.comblogs/enabling-janrain-engage-rails-devise-video",
				"creator" : "Michael Olson",
				"date" : "Oct 30, 2010 8:16 AM"			}
		},
		{
			"story" :
			{
				"title" : "Social Commerce and the PayPal Innovate 2010 Conference",
				"description" : "<p>Janrain will be participating in the upcoming <a href=&quot;https://www.paypal-xinnovate.com/&quot; target=&quot;_blank&quot;>PayPal X Developer Conference</a> on October 26-27 in Moscone Center, San Francisco. It looks like an action packed couple of days with a great line-up of speakers, including Tim O&#39;Reilly (CEO, <a href=&quot;http://www.oreilly.com&quot; target=&quot;_blank&quot;>O&#39;Reilly Media</a>), Marc Andreessen (co-founder, <a href=&quot;http://www.ning.com&quot; target=&quot;_blank&quot;>Ning</a>), Kara Swisher (Executive Editor, <a href=&quot;http://www.wsj.com&quot; target=&quot;_blank&quot;>Wall Street Journal</a>), John Donahoe (CEO, <a href=&quot;http://www.ebay.com&quot; target=&quot;_blank&quot;>eBay</a>), and Scott Thompson (President, <a href=&quot;http://www.paypal.com&quot; target=&quot;_blank&quot;>PayPal</a>).&nbsp; Key topics being discussed include Web Checkout; Financial Institutions and Business Payments; Mobile, Television, and Device Payments; Innovations in Payments and Beyond. &nbsp;</p>  <p> In 2010 we&#39;ve seen increasing adoption of <a href=&quot;/products/engage&quot;>social registration and login</a>, or what Jeremiah Owyang of Altimeter Group calls &quot;<a href=&quot;http://www.web-strategist.com/blog/2010/09/27/research-note-integrating-social-networks-with-your-corporate-website-with-social-sign-on/&quot; target=&quot;_blank&quot;>Social Sign On</a>,&quot; in the retail sector.&nbsp; Companies including <a href=&quot;http://www.sears.com&quot; target=&quot;_blank&quot;>Sears</a>, <a href=&quot;http://www.kmart.com&quot; target=&quot;_blank&quot;>Kmart</a>, <a href=&quot;http://www.kodak.com&quot; target=&quot;_blank&quot;>Kodak</a>, <a href=&quot;http://www.diesel.com&quot; target=&quot;_blank&quot;>Diesel</a>, <a href=&quot;http://www.levis.com&quot; target=&quot;_blank&quot;>Levis</a>, <a href=&quot;http://www.savings.com&quot; target=&quot;_blank&quot;>Savings.com</a>, <a href=&quot;http://www.redplum.com&quot; target=&quot;_blank&quot;>Red Plum</a>, <a href=&quot;http://www.hp.com&quot; target=&quot;_blank&quot;>HP</a>, <a href=&quot;http://www.fandango.com&quot; target=&quot;_blank&quot;>Fandango</a> and others are allowing customers to register with existing accounts at Google, Yahoo, AOL, Facebook, Twitter, LinkedIn, Microsoft, MySpace, and others to facilitate login, build richer customer profiles, and encourage customer social publishing to drive referral traffic to their websites. &nbsp;</p>  <p> To help move the market forward, the <a href=&quot;http://www.openid.net&quot;>OpenID Foundation</a> and <a href=&quot;http://openidentityexchange.org/&quot; target=&quot;_blank&quot;>Open Identity Exchange</a>, two non-profit governance organizations, are working to promote open standard technologies to improve consumer online experiences across the web. Both of these organizations are supported by PayPal and its eCommerce Developer Community.</p>  <p> At Innovate 2010 service providers, foundation members, and retailers will have an opportunity to discuss identity, payments, and social networking trends in online retail applications.&nbsp; Representatives from Janrain and PayPal will be available to discuss the newly formed OpenID Foundation Retail Advisory Committee (RAC).&nbsp; Learn more about the <a href=&quot;http://www.slideshare.net/bkkissel/openid-foundation-retail-advisory-committee-overview-5193852&quot; target=&quot;_blank&quot;>Retail Advisory Committee</a> in the SlideShare presentation below and the <a href=&quot;http://wiki.openid.net/OpenID-Retail-Advisory-Committee&quot; target=&quot;_blank&quot;>OpenID Foundation Wiki</a>.</p>  <div id=&quot;__ss_5193852&quot; style=&quot;width: 425px;&quot;><strong style=&quot;margin: 12px 0pt 4px; display: block;&quot;><a href=&quot;http://www.slideshare.net/bkkissel/openid-foundation-retail-advisory-committee-overview-5193852&quot; title=&quot;OpenID Foundation Retail Advisory Committee Overview&quot;>OpenID Foundation Retail Advisory Committee Overview</a></strong> <object height=&quot;355&quot; id=&quot;__sse5193852&quot; width=&quot;425&quot;><param name=&quot;movie&quot; value=&quot;http://static.slidesharecdn.com/swf/ssplayer2.swf?doc=openidfoundationretailadvisorycommitteeoverview-100913174702-phpapp02&amp;stripped_title=openid-foundation-retail-advisory-committee-overview-5193852&amp;userName=bkkissel&quot; /><param name=&quot;allowFullScreen&quot; value=&quot;true&quot; /><param name=&quot;allowScriptAccess&quot; value=&quot;always&quot; /><embed allowfullscreen=&quot;true&quot; allowscriptaccess=&quot;always&quot; height=&quot;355&quot; name=&quot;__sse5193852&quot; src=&quot;http://static.slidesharecdn.com/swf/ssplayer2.swf?doc=openidfoundationretailadvisorycommitteeoverview-100913174702-phpapp02&amp;stripped_title=openid-foundation-retail-advisory-committee-overview-5193852&amp;userName=bkkissel&quot; type=&quot;application/x-shockwave-flash&quot; width=&quot;425&quot;></embed></object></div>  <p>  Innovate 2010 is a great opportunity discuss how the Identity and Payments developer ecosystems can define the next generation Identity Trust framework to power commerce platforms. We hope you&#39;ll plan on attending this event and sharing your thoughts. &nbsp;</p> <p> As a special promotion for friends of Janrain, PayPal is offering a $100 discount to attend Innovate 2010.&nbsp; Just enter the promotion code &quot;<strong>LETSINNOVATE</strong>&rdquo; when you register. &nbsp;<br />   Additionally, Janrain, PayPal and members of the OpenID Foundation are planning a Retail Advisory Summit to be held in Silicon Valley in Q1 2011. We&rsquo;ll be planning this event during the <a href=&quot;http://www.internetidentityworkshop.com/iiwxi-11-in-mountain-view/&quot; target=&quot;_blank&quot;>Internet Identity Workshop XI</a> from November 2-4 in Mountain View, California. Drop us a line if you would like to participate or we can connect at one of these upcoming conferences.</p>",
				"plainText" : "Janrain will be participating in the upcoming PayPal X Developer Conference on October 26-27 in Moscone Center, San Francisco. It looks like an action packed couple of days with a great line-up of speakers, including Tim O'Reilly (CEO, O'Reilly Media), Marc Andreessen (co-founder, Ning), Kara Swisher (Executive Editor, Wall Street Journal), John Donahoe (CEO, eBay), and Scott Thompson (President, PayPal).  Key topics being discussed include Web Checkout; Financial Institutions and Business Payments; Mobile, Television, and Device Payments; Innovations in Payments and Beyond.     In 2010 we've seen increasing adoption of social registration and login, or what Jeremiah Owyang of Altimeter Group calls %34Social Sign On,%34 in the retail sector.  Companies including Sears, Kmart, Kodak, Diesel, Levis, Savings.com, Red Plum, HP, Fandango and others are allowing customers to register with existing accounts at Google, Yahoo, AOL, Facebook, Twitter, LinkedIn, Microsoft, MySpace, and others to facilitate login, build richer customer profiles, and encourage customer social publishing to drive referral traffic to their websites.     To help move the market forward, the OpenID Foundation and Open Identity Exchange, two non-profit governance organizations, are working to promote open standard technologies to improve consumer online experiences across the web. Both of these organizations are supported by PayPal and its eCommerce Developer Community.   At Innovate 2010 service providers, foundation members, and retailers will have an opportunity to discuss identity, payments, and social networking trends in online retail applications.  Representatives from Janrain and PayPal will be available to discuss the newly formed OpenID Foundation Retail Advisory Committee (RAC).  Learn more about the Retail Advisory Committee in the SlideShare presentation below and the OpenID Foundation Wiki.  OpenID Foundation Retail Advisory Committee Overview     Innovate 2010 is a great opportunity discuss how the Identity and Payments developer ecosystems can define the next generation Identity Trust framework to power commerce platforms. We hope you'll plan on attending this event and sharing your thoughts.    As a special promotion for friends of Janrain, PayPal is offering a $100 discount to attend Innovate 2010.  Just enter the promotion code %34LETSINNOVATE%34 when you register.     Additionally, Janrain, PayPal and members of the OpenID Foundation are planning a Retail Advisory Summit to be held in Silicon Valley in Q1 2011. We'll be planning this event during the Internet Identity Workshop XI from November 2-4 in Mountain View, California. Drop us a line if you would like to participate or we can connect at one of these upcoming conferences.",
				"link" : "http://www.janrain.comblogs/social-commerce-and-paypal-innovate-2010-conference",
				"creator" : "Brian Kissel",
				"date" : "Oct 29, 2010 9:26 AM"			}
		},
		{
			"story" :
			{
				"title" : "Janrain';s Upcoming Fall Event Schedule",
				"description" : "<p><img alt=%34Janrain Upcoming Event Calendar%34 src=%34/sites/default/files/calendar_icon.gif%34 style=%34padding-top: 0px; padding-right: 0px; padding-bottom: 20px; padding-left: 20px; float: right; width: 200px; height: 188px; %34 />Over the last year, Janrain has attended <a href=&quot;http://www.facebook.com/pages/Janrain/135174526496719?v=app_2344061033&amp;vm=all&quot; target=&quot;_blank&quot;>a number of great conferences</a> and have met some very knowledgable folks. We&#39;re exicited to continue along the event curcuit this fall. Here are several events that we will be attending and/or presenting at. Drop us a line if you will be at one of these events, we&#39;d love to talk!</p>  <ul> <li><a href=&quot;http://www.riseofsocialcommerce.com/&quot; target=&quot;_blank&quot;><strong>Altimeter&#39;s Rise of Social Commerce</strong></a>&nbsp;<br />   October 6-7, 2010, <em>Palo Alto, CA</em><br />    Hashtag: <a href=&quot;http://twitter.com/#search?q=%23RSC10&quot; target=&quot;_blank&quot;>#RSC10</a><br />   &nbsp;</li> <li><a href=&quot;http://www.demogala.com/&quot;><strong>DEMOgala Technology Conference</strong></a><br />    October 7, 2010,<em> Denver, CO</em><br />   &quot;Technologies to Increase Online Engagement&quot; presented by Brian Kissel, Janrain CEO<br />   Hashtag: <a href=&quot;http://twitter.com/#!/search/%23DEMOgala%20&quot; target=&quot;_blank&quot;>#DEMOgala </a><br />    &nbsp;</li> <li><a href=&quot;http://www.internetidentityworkshop.com/iiwxi-11-in-mountain-view/&quot; target=&quot;_blank&quot;><strong>Internet Identity Workshop</strong></a><br />   November, 2-4, 2010,&nbsp;<em>Mountain View, CA</em><br />    Hashtag: <a href=&quot;http://twitter.com/#search/%23iiw&quot; target=&quot;_blank&quot;>#IIW</a><br />   &nbsp;</li> <li><strong>Stanford Alumni Event</strong><br />    November, 2-4, 2010, <em>Portland, OR</em><br />   &quot;Online Privacy Panel,&quot; Brian Kissel, Janrain CEO will be participating in this panel<br />   &nbsp;</li> <li><strong><a href=&quot;http://womma.org/summit/&quot; target=&quot;_blank&quot;>WOMMA Summit</a></strong><br />    November 17-19, 2010, <em>Las Vegas, NL</em><br />   &quot;Acquiring Customers and Increasing Engagement through Social Media,&quot; Tore Steen, Janrain VP, Marketing and Business Development will be presenting with our long time customer Lee Hammond, Director of New Media at <a href=&quot;http://www.interscope.com/&quot; target=&quot;_blank&quot;>Interscope Geffen A&amp;M Records (IGA)</a><br />    Hashtag:<a href=&quot;http://twitter.com/#search/%23WOMMA&quot; target=&quot;_blank&quot;> #WOMMA</a></li> </ul>",
				"plainText" : "Over the last year, Janrain has attended a number of great conferences and have met some very knowledgable folks. We're exicited to continue along the event curcuit this fall. Here are several events that we will be attending and/or presenting at. Drop us a line if you will be at one of these events, we'd love to talk!   Altimeter's Rise of Social Commerce    October 6-7, 2010, Palo Alto, CA    Hashtag: #RSC10     DEMOgala Technology Conference    October 7, 2010, Denver, CO   %34Technologies to Increase Online Engagement%34 presented by Brian Kissel, Janrain CEO   Hashtag: #DEMOgala       Internet Identity Workshop   November, 2-4, 2010, Mountain View, CA    Hashtag: #IIW     Stanford Alumni Event    November, 2-4, 2010, Portland, OR   %34Online Privacy Panel,%34 Brian Kissel, Janrain CEO will be participating in this panel     WOMMA Summit    November 17-19, 2010, Las Vegas, NL   %34Acquiring Customers and Increasing Engagement through Social Media,%34 Tore Steen, Janrain VP, Marketing and Business Development will be presenting with our long time customer Lee Hammond, Director of New Media at Interscope Geffen A&amp;M Records (IGA)    Hashtag: #WOMMA ",
				"link" : "http://www.janrain.comblogs/janrains-upcoming-fall-event-schedule",
				"creator" : "Katie Keenan",
				"date" : "Oct 24, 2010 4:40 PM",
				"images" :
				[
					"/sites/default/files/calendar_icon.gif"
				]
			}
		},
		{
			"story" :
			{
				"title" : "Citysearch Increases Referral Traffic from Facebook with Janrain Engage",
				"description" : "<p><a href=&quot;http://www.citysearch.com&quot; target=&quot;_blank&quot;>Citysearch</a> was an early adopter of Facebook Connect in late 2008. Recognizing that its members actively contributed ratings and reviews on the site, Citysearch sought to facilitate word-of-mouth marketing and promote sharing of user-generated content on Facebook.</p>  <p>We just published a <a href=&quot;/sites/default/files/Success-Story_CitySearch.pdf&quot; onclick=&quot;gaTrack(this, &#39;/downloads/Success-Story_CitySearch&#39;);&quot;>success story highlighting the benefits Citysearch has experienced since choosing Janrain Engage</a> to manage its social connection to Facebook.&nbsp; These include:</p> <ul>  <li><strong>12% of user-generated content</strong> from Citysearch is shared with friends on Facebook</li> <li>Content shared to Facebook is viewed by an <strong>average of 40 people and generates 28 clicks back to Citysearch.</strong></li> </ul>  <p>Here is a short video that demonstrates how Citysearch is using Janrain Engage:</p> <p><object height=&quot;385&quot; width=&quot;640&quot;><param name=&quot;movie&quot; value=&quot;http://www.youtube.com/v/VBbmR_mBDsQ?fs=1&amp;hl=en_US&quot; /><param name=&quot;allowFullScreen&quot; value=&quot;true&quot; /><param name=&quot;allowscriptaccess&quot; value=&quot;always&quot; /><embed allowfullscreen=&quot;true&quot; allowscriptaccess=&quot;always&quot; height=&quot;385&quot; src=&quot;http://www.youtube.com/v/VBbmR_mBDsQ?fs=1&amp;hl=en_US&quot; type=&quot;application/x-shockwave-flash&quot; width=&quot;640&quot;></embed></object></p>  <p>Citysearch is similar to a number of additional Janrain customers that initially integrated directly with Facebook to increase online registration rates and drive qualified referral traffic to their site.&nbsp; After recognizing the challenge of allocating internal resources to maintain the Facebook implementation and the <a href=&quot;/blogs/measuring-popularity-social-media-platforms-across-web&quot;>benefits to supporting multiple social networks and identity providers</a>, these organizations migrated to <a href=&quot;/products/engage&quot;>Janrain Engage</a>.&nbsp; As a hosted solution, <a href=&quot;/products/engage&quot;>Janrain Engage</a> handles all of the &ldquo;plumbing&rdquo; changes from Facebook and other identity providers on behalf of customers like Citysearch, enabling them to focus on their core competency.</p>  <p>By leveraging <a href=&quot;/products/engage&quot;>Janrain Engage</a> to connect its site to a social network like Facebook, Citysearch has exposed its content to a new audience and increased site membership.</p>",
				"plainText" : "Citysearch was an early adopter of Facebook Connect in late 2008. Recognizing that its members actively contributed ratings and reviews on the site, Citysearch sought to facilitate word-of-mouth marketing and promote sharing of user-generated content on Facebook.  We just published a success story highlighting the benefits Citysearch has experienced since choosing Janrain Engage to manage its social connection to Facebook.  These include:   12% of user-generated content from Citysearch is shared with friends on Facebook Content shared to Facebook is viewed by an average of 40 people and generates 28 clicks back to Citysearch.   Here is a short video that demonstrates how Citysearch is using Janrain Engage:   Citysearch is similar to a number of additional Janrain customers that initially integrated directly with Facebook to increase online registration rates and drive qualified referral traffic to their site.  After recognizing the challenge of allocating internal resources to maintain the Facebook implementation and the benefits to supporting multiple social networks and identity providers, these organizations migrated to Janrain Engage.  As a hosted solution, Janrain Engage handles all of the %34plumbing%34 changes from Facebook and other identity providers on behalf of customers like Citysearch, enabling them to focus on their core competency.  By leveraging Janrain Engage to connect its site to a social network like Facebook, Citysearch has exposed its content to a new audience and increased site membership.",
				"link" : "http://www.janrain.comblogs/citysearch-increases-referral-traffic-facebook-janrain-engage",
				"creator" : "Michael Olson",
				"date" : "Oct 23, 2010 11:27 AM"			}
		},
		{
			"story" :
			{
				"title" : "Janrain Webinar Follow-up - Revenue is the Key Driver Behind Offering Registration",
				"description" : "<p>Last Thursday during Janrain&rsquo;s&nbsp; webinar, &ldquo;<a href=&quot;/blogs/janrain-best-practices-webinar-improving-online-registration-drive-revenue&quot;>Improving Online Registration to Drive Revenue</a>,&rdquo; we shared several key best practices with organizations seeking to optimize their online registration process and provide compelling incentives to facilitate member acquisition.&nbsp; Questions were posed to the audience of nearly 100 attendees throughout the session, and we would like to share the results.</p>  <p>85% of attendees polled currently have a user registration process in place today.&nbsp; With the advent of the social web, most marketers recognize the value in knowing more about their online audience and understand that this is often the first step to success online.</p> <p><img alt=%34Does your website have a user registration process%34 src=%34/sites/default/files/does-your-website-have-a-user-registration-process-in-place.JPG%34 style=%34width: 280px; height: 160px;%34 /></p>  <p> 38% of those polled currently offer registration and login through Facebook, Twitter, Google, or other networks, compared to 62% that require users to create a site-specific username and password.</p> <p><img alt=%34Do you offer login through Facebook, Twitter, Google or other social networks%34 src=%34/sites/default/files/do-you-offer-login-through-social-networks.JPG%34 style=%34width: 280px; height: 156px;%34 /></p>  <p> Sites that do not enable users to login with their existing social network or email accounts miss an opportunity to grow their audience, and many <a href=&quot;/customers&quot;>Janrain customers</a> experience a <a href=&quot;/customers/success-stories&quot;>10-50% increase in registrations</a> after enabling users to login with an existing social network account via <a href=&quot;/products/engage&quot;>Janrain Engage</a>.</p>  <p>We also asked attendees to cite the most compelling reasons for users to register on their site.&nbsp; Not surprisingly, increased revenue is the key driver behind offering registration &ndash; 76% of those polled tie online revenue to registered users.&nbsp; Depending on the type of site, revenue opportunities could involve targeted advertisements to users based on their demographic information or product recommendations based on past purchasing behavior.</p> <p><img alt=%34most important reasons for users to register%34 src=%34/sites/default/files/most-important-reasons-for-users-to-register.JPG%34 style=%34width: 280px; height: 163px;%34 /></p>  <p> 68% of respondents also value community building as a key driver behind offering user registration.&nbsp; The most successful communities on the web thrive due to user-generated content, and whether your site offers discussion forums, reviews or knowledge exchange, membership is the catalyst behind community development.</p> <p>Fostering engagement is an overarching goal for most online businesses and influences other metrics such as revenue and community building.&nbsp; That said, 53% of those polled highlighted the opportunity to better engage with members as a key incentive for offering membership.</p> <p>All in all, having a streamlined online registration process can provide enormous value to your website. Once you know more about your users, you can offer them a more engaging experience and in turn increase loyalty, brand awareness and most importantly, your online ROI. If you did not have a chance to attend our webinar, stay tuned as we plan to offer more webinars in the future.</p>",
				"plainText" : "Last Thursday during Janrain's  webinar, 'Improving Online Registration to Drive Revenue,' we shared several key best practices with organizations seeking to optimize their online registration process and provide compelling incentives to facilitate member acquisition.  Questions were posed to the audience of nearly 100 attendees throughout the session, and we would like to share the results.  85% of attendees polled currently have a user registration process in place today.  With the advent of the social web, most marketers recognize the value in knowing more about their online audience and understand that this is often the first step to success online.    38% of those polled currently offer registration and login through Facebook, Twitter, Google, or other networks, compared to 62% that require users to create a site-specific username and password.    Sites that do not enable users to login with their existing social network or email accounts miss an opportunity to grow their audience, and many Janrain customers experience a 10-50% increase in registrations after enabling users to login with an existing social network account via Janrain Engage.  We also asked attendees to cite the most compelling reasons for users to register on their site.  Not surprisingly, increased revenue is the key driver behind offering registration - 76% of those polled tie online revenue to registered users.  Depending on the type of site, revenue opportunities could involve targeted advertisements to users based on their demographic information or product recommendations based on past purchasing behavior.    68% of respondents also value community building as a key driver behind offering user registration.  The most successful communities on the web thrive due to user-generated content, and whether your site offers discussion forums, reviews or knowledge exchange, membership is the catalyst behind community development. Fostering engagement is an overarching goal for most online businesses and influences other metrics such as revenue and community building.  That said, 53% of those polled highlighted the opportunity to better engage with members as a key incentive for offering membership. All in all, having a streamlined online registration process can provide enormous value to your website. Once you know more about your users, you can offer them a more engaging experience and in turn increase loyalty, brand awareness and most importantly, your online ROI. If you did not have a chance to attend our webinar, stay tuned as we plan to offer more webinars in the future.",
				"link" : "http://www.janrain.comblogs/janrain-webinar-follow-revenue-key-driver-behind-offering-registration",
				"creator" : "Michael Olson",
				"date" : "Oct 20, 2010 7:51 AM",
				"images" :
				[
					"/sites/default/files/does-your-website-have-a-user-registration-process-in-place.JPG",
					"/sites/default/files/do-you-offer-login-through-social-networks.JPG",
					"/sites/default/files/most-important-reasons-for-users-to-register.JPG"
				]
			}
		},
		{
			"story" :
			{
				"title" : "Do You Have a Member Acquisition Strategy For Your Website?",
				"description" : "<p><a href=&quot;/creating-effective-online-member-acquisition-strategy&quot;><img alt=%34Janrain Marketing Brief Creating an Effective Online Member Acquisition Strategy%34 src=%34/sites/default/files/Member-Acquisition-Strategy-thumbnail.JPG%34 style=%34padding: 0pt 0pt 20px 20px; width: 140px; height: 181px; float: right;border:0;%34 /></a>We just published the third in our series of Janrain Marketing Briefs on the topic of <a href=&quot;/creating-effective-online-member-acquisition-strategy&quot;>creating an effective online member acquisition strategy</a>. Key metrics for marketers have shifted with the emergence of the social web. Quality of site traffic now takes precedence over quantity, interactions on your site are far more important than just time on site, and actively sharing content from your site leads to more effective word of mouth marketing than passive page views.</p>  <p>The critical foundation underlying these new success metrics is knowledge of your users. This marketing brief outlines some easy steps you can take to accelerate both the registration process for your site and effective ways to encourage visitors to become engaged members on your site. Topics discussed include:</p> <ul> <li>The &ldquo;give to get&rdquo; paradigm of providing incentives for visitors to register</li> <li>Member acquisition strategies &ndash; benefits to offer your members</li>  <li>Expanding your membership through word-of-mouth marketing</li> <li>Optimizing the registration process</li> <li>Offering registration with an existing social network or email identity</li> </ul> <p>We invite you to download <a href=&quot;/creating-effective-online-member-acquisition-strategy&quot;>Creating an Effective Online Member Acquisition Strategy</a>, the new Janrain Marketing Brief, and share your feedback.</p>",
				"plainText" : "We just published the third in our series of Janrain Marketing Briefs on the topic of creating an effective online member acquisition strategy. Key metrics for marketers have shifted with the emergence of the social web. Quality of site traffic now takes precedence over quantity, interactions on your site are far more important than just time on site, and actively sharing content from your site leads to more effective word of mouth marketing than passive page views.  The critical foundation underlying these new success metrics is knowledge of your users. This marketing brief outlines some easy steps you can take to accelerate both the registration process for your site and effective ways to encourage visitors to become engaged members on your site. Topics discussed include:  The %34give to get%34 paradigm of providing incentives for visitors to register Member acquisition strategies - benefits to offer your members  Expanding your membership through word-of-mouth marketing Optimizing the registration process Offering registration with an existing social network or email identity  We invite you to download Creating an Effective Online Member Acquisition Strategy, the new Janrain Marketing Brief, and share your feedback.",
				"link" : "http://www.janrain.comblogs/do-you-have-member-acquisition-strategy-your-website",
				"creator" : "Michael Olson",
				"date" : "Oct 16, 2010 10:28 AM",
				"images" :
				[
					"/sites/default/files/Member-Acquisition-Strategy-thumbnail.JPG"
				]
			}
		},
		{
			"story" :
			{
				"title" : "New Janrain Engage WordPress Plugin for WordPress 3.0 or Higher",
				"description" : "<p><a href=&quot;http://wordpress.org/extend/plugins/rpx/&quot; target=&quot;_blank&quot;><img alt=%34Janrain Engage WordPress Plugin%34 src=%34/sites/default/files/wp-lg.gif%34 style=%34border:0; padding-top: 0px; padding-right: 0px; padding-bottom: 20px; padding-left: 20px; float: right; width: 230px; %34 /></a>For those of you using <a href=&quot;http://wordpress.org/&quot; target=&quot;_blank&quot;>WordPress</a>,&nbsp;a popular content management system for websites, you&rsquo;ll be happy to hear that we&rsquo;ve released a new version of the&nbsp;<a href=&quot;http://wordpress.org/extend/plugins/rpx/&quot; target=&quot;_blank&quot;>Janrain Engage Wordpress Plugin</a>. We built this plugin from the ground up with the user experience in mind. Features included in this plugin:</p>  <h3><strong>Registration &amp; Login via a Preferred Social Network or Email Provider</strong></h3> <p>Give your visitors the option to sign-in to your site with their existing credentials from a social network or email provider such as Facebook, Google, Twitter, Yahoo!, LinkedIn, Windows Live, MySpace, AOL and others (<a href=&quot;/solutions/supported-networks&quot;>16 Supported Networks</a>).</p> <h3><strong>Optional Displays</strong></h3>  <ul> <li>Janrain Engage block on the standard WordPress registration and login screen</li> <li>Janrain Engage block next to login prompt for comments</li> <li>Janrain Engage block&nbsp;displayed anywhere within your specified widget area</li> </ul>  <h3><strong>Collects Email Addresses</strong></h3> <p>Prompts users to enter an email address if the provider used for login does not pass a verified email address (WordPress Requirement).</p> <h3><strong>Legacy Account Mapping</strong></h3> <p>If your user has an existing account with your site, Janrain Engage will map profile data received at login with the existing account (via verified email only).</p>  <h3><strong>Social Sharing</strong></h3> <p>A customizable widget to share articles to multiple social networks simultaneously. Users can select up to four social communities such as Facebook, Twitter, LinkedIn and Yahoo for publishing. On average, each postis will generate nine referral clicks back to your site for each post.</p> <p><strong>To see this plugin in action, <a href=&quot;http://plugins.janrain.com/wordpress/&quot; target=&quot;_blank&quot;>click here</a>.</strong></p>  <p>We are very excited to announce this new <a href=&quot;http://wordpress.org/extend/plugins/rpx/&quot; target=&quot;_blank&quot;>Janrain Engage Wordpress Plugin</a> and will continue to rollout new features and functionality in the coming months. We&rsquo;d love to hear your feedback so we can continue to improve upon our product.</p>",
				"plainText" : "For those of you using WordPress, a popular content management system for websites, you'll be happy to hear that we've released a new version of the Janrain Engage Wordpress Plugin. We built this plugin from the ground up with the user experience in mind. Features included in this plugin:  Registration & Login via a Preferred Social Network or Email Provider Give your visitors the option to sign-in to your site with their existing credentials from a social network or email provider such as Facebook, Google, Twitter, Yahoo!, LinkedIn, Windows Live, MySpace, AOL and others (16 Supported Networks). Optional Displays   Janrain Engage block on the standard WordPress registration and login screen Janrain Engage block next to login prompt for comments Janrain Engage block displayed anywhere within your specified widget area   Collects Email Addresses Prompts users to enter an email address if the provider used for login does not pass a verified email address (WordPress Requirement). Legacy Account Mapping If your user has an existing account with your site, Janrain Engage will map profile data received at login with the existing account (via verified email only).  Social Sharing A customizable widget to share articles to multiple social networks simultaneously. Users can select up to four social communities such as Facebook, Twitter, LinkedIn and Yahoo for publishing. On average, each postis will generate nine referral clicks back to your site for each post. To see this plugin in action, click here.  We are very excited to announce this new Janrain Engage Wordpress Plugin and will continue to rollout new features and functionality in the coming months. We'd love to hear your feedback so we can continue to improve upon our product.",
				"link" : "http://www.janrain.comblogs/new-janrain-engage-wordpress-plugin-wordpress-30-or-higher",
				"creator" : "Katie Keenan",
				"date" : "Oct 14, 2010 9:47 AM",
				"images" :
				[
					"/sites/default/files/wp-lg.gif"
				]
			}
		},
		{
			"story" :
			{
				"title" : "Janrain Best Practices Webinar - Improving Online Registration to Drive Revenue",
				"description" : "<p><img alt=%34Janrain Webinar%34 src=%34/sites/default/files/webinar-icon.jpg%34 style=%34padding: 0pt 0pt 20px 20px; width: 180px; height: 246px; float: right;%34 /></p> <p>Many online businesses struggle to convert anonymous visitors to a registered user, fully leverage rich user profile information, and create monetization and engagement opportunities. In a fiercely competitive marketplace, it has become critical to optimize your online presence and provide reasons for people to sign-up and spend more time on your site. Fortunately, there are simple ways to grow your online audience and drive ROI.</p>  <p>On <strong>Thursday, September 16th </strong>at <strong>9:00am PDT</strong>, we will be hosting a 45 minute <a href=&quot;https://janrain.webex.com/janrain/onstage/g.php?t=a&amp;d=665616186&quot; rel=&quot;nofollow&quot; target=&quot;_blank&quot;>webinar</a> to provide tips and best practices on how to:</p>  <ul> <li>Boost engagement and monetize users through content personalization</li> <li>Provide compelling incentives to turn more anonymous visitors into active members on your site</li> <li>Collect rich user profile data without sacrificing conversion rates</li> <li>Leverage the social networks on your site to facilitate member acquisition</li>  </ul> <p>All are welcome to attend. <a href=&quot;https://janrain.webex.com/janrain/onstage/g.php?t=a&amp;d=665616186&quot; rel=&quot;nofollow&quot; target=&quot;_blank&quot;>Click here to register for the webinar</a>.</p>",
				"plainText" : "Many online businesses struggle to convert anonymous visitors to a registered user, fully leverage rich user profile information, and create monetization and engagement opportunities. In a fiercely competitive marketplace, it has become critical to optimize your online presence and provide reasons for people to sign-up and spend more time on your site. Fortunately, there are simple ways to grow your online audience and drive ROI.  On Thursday, September 16th at 9:00am PDT, we will be hosting a 45 minute webinar to provide tips and best practices on how to:   Boost engagement and monetize users through content personalization Provide compelling incentives to turn more anonymous visitors into active members on your site Collect rich user profile data without sacrificing conversion rates Leverage the social networks on your site to facilitate member acquisition   All are welcome to attend. Click here to register for the webinar.",
				"link" : "http://www.janrain.comblogs/janrain-best-practices-webinar-improving-online-registration-drive-revenue",
				"creator" : "Michael Olson",
				"date" : "Oct 9, 2010 9:19 AM",
				"images" :
				[
					"/sites/default/files/webinar-icon.jpg"
				]
			}
		},
		{
			"story" :
			{
				"title" : "Janrain Participates in Hood to Coast Relay",
				"description" : "<p>How many Janraineers (and friends of Janrain employees) does it take to run 197 miles from Mt. Hood west to the Oregon coast?&nbsp; Fueled by gatorade and plenty of Advil, 12 runners, 2 drivers and 2 vans from Team Janrain participated in the annual <a href=&quot;http://www.hoodtocoast.com/&quot; target=&quot;_blank&quot;>Hood to Coast relay</a> last weekend, finishing 270th out of the more than 900 teams that entered.&nbsp;</p> <p>Now in its 29th year, Hood to Coast pits 12,000 runners against the diverse Oregon terrain, heat, fatigue and sleep deprivation that goes with a nearly 200-mile relay race spread over 2 days.&nbsp; It is billed as one of the largest relay races in the world.</p>  <p>We had a great time and hope to be back next year.&nbsp; Enjoy the pictures below:</p> <p><img alt=%34janrain hood to coast start%34 src=%34/sites/default/files/hood-to-coast-start-on-rock.JPG%34 style=%34width: 280px; height: 157px;%34 /></p>  <p><span style=&quot;font-size: 8px;&quot;><span style=&quot;font-size: 9px;&quot;>Half of the Janrain team prior to the start of the relay near Timberline Lodge on the slopes of Mt. Hood.</span></span></p> <p><img alt=%34Hood to Coast start Mt Hood%34 src=%34/sites/default/files/hood-to-coast-start.JPG%34 style=%34width: 280px; height: 210px;%34 /></p>  <p><span style=&quot;font-size: 8px;&quot;><span style=&quot;font-size: 9px;&quot;>Runners congregate at the start of the relay on Mt. Hood.</span></span></p> <p><img alt=%34janrain running hood to coast%34 src=%34/sites/default/files/hood-to-coast-grant.jpg%34 style=%34width: 280px; height: 210px;%34 /></p>  <p><span style=&quot;font-size: 8px;&quot;><span style=&quot;font-size: 9px;&quot;>Running in Oregon&#39;s Coast Range about 25 miles from the ocean.</span></span></p> <p><img alt=%34janrain hood to coast exchange point%34 src=%34/sites/default/files/hood-to-coast-exchange.JPG%34 style=%34width: 280px; height: 157px;%34 /></p>  <p><span style=&quot;font-size: 8px;&quot;><span style=&quot;font-size: 9px;&quot;>Waiting at an exchange point for the next leg of the relay.</span></span></p>",
				"plainText" : "How many Janraineers (and friends of Janrain employees) does it take to run 197 miles from Mt. Hood west to the Oregon coast?  Fueled by gatorade and plenty of Advil, 12 runners, 2 drivers and 2 vans from Team Janrain participated in the annual Hood to Coast relay last weekend, finishing 270th out of the more than 900 teams that entered.  Now in its 29th year, Hood to Coast pits 12,000 runners against the diverse Oregon terrain, heat, fatigue and sleep deprivation that goes with a nearly 200-mile relay race spread over 2 days.  It is billed as one of the largest relay races in the world.  We had a great time and hope to be back next year.  Enjoy the pictures below:   Half of the Janrain team prior to the start of the relay near Timberline Lodge on the slopes of Mt. Hood.   Runners congregate at the start of the relay on Mt. Hood.   Running in Oregon's Coast Range about 25 miles from the ocean.   Waiting at an exchange point for the next leg of the relay.",
				"link" : "http://www.janrain.comblogs/janrain-participates-hood-coast-relay",
				"creator" : "Michael Olson",
				"date" : "Oct 2, 2010 4:21 PM",
				"images" :
				[
					"/sites/default/files/hood-to-coast-start-on-rock.JPG",
					"/sites/default/files/hood-to-coast-start.JPG",
					"/sites/default/files/hood-to-coast-grant.jpg",
					"/sites/default/files/hood-to-coast-exchange.JPG"
				]
			}
		},
		{
			"story" :
			{
				"title" : "Janrain Founder and CTO Larry Drebes on This Week in Startups",
				"description" : "<p>Janrain Founder and CTO Larry Drebes had a chance to stop by and talk with Jason Calacanis yesterday on <a href=&quot;http://thisweekin.com/thisweekin-startups/&quot; target=&quot;_blank&quot;><em>This Week in Startups</em></a>.&nbsp; Calacanis and Drebes spoke about Janrain&#39;s history, solutions, and Drebes&#39; previous startup experience in the Bay Area, including his sale of <em>Rocketmail </em>to Yahoo! in the late 1990s.</p>  <p>Calacanis has founded many companies including <i>Silicon Alley Reporter</i> and <i><a href=&quot;http://www.mahalo.com/weblogs-inc&quot; target=&quot;_blank&quot; title=&quot;Weblogs, Inc. &quot;> Weblogs, Inc</a></i>. He is the founder and CEO of <a href=&quot;http://www.mahalo.com/&quot; target=&quot;_blank&quot;>Mahalo.com</a> (which uses <a href=&quot;/../../products/engage&quot;>Janrain Engage</a>) and host of <em>This Week in Startups</em>.</p>  <p>You can watch the interview below.&nbsp; Drebes&#39; interview portion begins at the 17:03 mark:</p> <p><object height=&quot;385&quot; width=&quot;640&quot;><param name=&quot;movie&quot; value=&quot;http://www.youtube.com/v/k2UxyMHc3vM?fs=1&amp;start=1024&amp;hl=en_US&quot; /><param name=&quot;allowFullScreen&quot; value=&quot;true&quot; /><param name=&quot;allowscriptaccess&quot; value=&quot;always&quot; /><embed allowfullscreen=&quot;true&quot; allowscriptaccess=&quot;always&quot; height=&quot;385&quot; src=&quot;http://www.youtube.com/v/k2UxyMHc3vM?fs=1&amp;start=1024&amp;hl=en_US&quot; type=&quot;application/x-shockwave-flash&quot; width=&quot;640&quot;></embed></object></p>",
				"plainText" : "Janrain Founder and CTO Larry Drebes had a chance to stop by and talk with Jason Calacanis yesterday on This Week in Startups.  Calacanis and Drebes spoke about Janrain's history, solutions, and Drebes' previous startup experience in the Bay Area, including his sale of Rocketmail to Yahoo! in the late 1990s.  Calacanis has founded many companies including Silicon Alley Reporter and  Weblogs, Inc. He is the founder and CEO of Mahalo.com (which uses Janrain Engage) and host of This Week in Startups.  You can watch the interview below.  Drebes' interview portion begins at the 17:03 mark: ",
				"link" : "http://www.janrain.comblogs/janrain-founder-cto-larry-drebes-week-startups",
				"creator" : "Michael Olson",
				"date" : "Oct 2, 2010 1:40 PM"			}
		},
		{
			"story" :
			{
				"title" : "Use Janrain Engage to connect your website to the 75 million professionals active on LinkedIn",
				"description" : "<p><img alt=%34LinkedIn%34 src=%34/sites/default/files/partner-linkedin.png%34 style=%34padding-top: 0px; padding-right: 0px; padding-bottom: 20px; padding-left: 20px; float: right; width: 150px; height: 51px; %34 />Did you know a new member joins <a href=&quot;http://www.linkedin.com&quot; target=&quot;_blank&quot;>LinkedIn</a> approximately every second? That is a lot of professionals with LinkedIn profiles who could use them to login to your website. In February, we made it easy for websites to offer <a href=&quot;/blogs/linkedin-added-rpx&quot;>sign-ups using LinkedIn accounts</a> and in May, we added the ability to <a href=&quot;/blogs/linkedin-social-publishing-now-available-janrain-rpx&quot;>share user activity</a> on a site with their connections on LinkedIn. Today, we are excited to announce several feature enhancements to <a href=&quot;/products/engage&quot;>Janrain Engage&rsquo;s</a> LinkedIn support.</p>  <p>When a user posts from your website back to their LinkedIn professional network, Janrain now passes richer content: an image thumbnail, the user&rsquo;s title, the URL from your site and a description.</p> <p>We have also enabled greater access to a user&#39;s LinkedIn profile data and connections which allows you to get to know your audience better and then present content that is more relevant to the individual user. To see the full list of profile data available when a user logins with LinkedIn, please see our <a href=&quot;/providerguide&quot;>Provider Guide</a>.</p> <p>With a user base of over 75 million professionals, the LinkedIn platform offers professional oriented websites an instant audience to increase reach and build readership.</p>  <p>A great example is the online media division of <a href=&quot;http://www.bizjournals.com/&quot; target=&quot;_blank&quot;>The Business Journals</a>, a division of American City Business Journals. Since deploying <a href=&quot;/products/engage&quot;>Janrain Engage</a> in June, the nation&rsquo;s largest publisher of metropolitan business journals has seen a <strong>12% increase in site registrations across 40 online properties</strong>. Over 25% of the logins via Janrain Engage utilize LinkedIn. This not only speaks to the login preference of business users but also reflects their trust in the LinkedIn brand.</p>  <p><img alt=%34%34 src=%34/sites/default/files/bizjournals.gif%34 style=%34width: 280px; height: 158px; %34 /></p> <p><a href=&quot;/&quot; style=&quot;color: rgb(0, 157, 220); text-decoration: underline; &quot;>Janrain Engage</a>&nbsp;customers can easily enable sign ups and social publishing for LinkedIn by visiting their product dashboard.</p>",
				"plainText" : "Did you know a new member joins LinkedIn approximately every second? That is a lot of professionals with LinkedIn profiles who could use them to login to your website. In February, we made it easy for websites to offer sign-ups using LinkedIn accounts and in May, we added the ability to share user activity on a site with their connections on LinkedIn. Today, we are excited to announce several feature enhancements to Janrain Engage's LinkedIn support.  When a user posts from your website back to their LinkedIn professional network, Janrain now passes richer content: an image thumbnail, the user's title, the URL from your site and a description. We have also enabled greater access to a user's LinkedIn profile data and connections which allows you to get to know your audience better and then present content that is more relevant to the individual user. To see the full list of profile data available when a user logins with LinkedIn, please see our Provider Guide. With a user base of over 75 million professionals, the LinkedIn platform offers professional oriented websites an instant audience to increase reach and build readership.  A great example is the online media division of The Business Journals, a division of American City Business Journals. Since deploying Janrain Engage in June, the nation's largest publisher of metropolitan business journals has seen a 12% increase in site registrations across 40 online properties. Over 25% of the logins via Janrain Engage utilize LinkedIn. This not only speaks to the login preference of business users but also reflects their trust in the LinkedIn brand.   Janrain Engage customers can easily enable sign ups and social publishing for LinkedIn by visiting their product dashboard.",
				"link" : "http://www.janrain.comblogs/use-janrain-engage-connect-your-website-75-million-professionals-active-linkedin",
				"creator" : "Katie Keenan",
				"date" : "Sep 25, 2010 9:50 AM",
				"images" :
				[
					"/sites/default/files/partner-linkedin.png",
					"/sites/default/files/bizjournals.gif"
				]
			}
		},
		{
			"story" : 
			{
				"title" : "Examining Trust in Social Media",
				"link" : "http://www.janrain.com/blogs/examining-trust-social-media",
				"creator" : "Michael Olson",
				"description" : "<p><a href=%34http://www.scottmonty.com%34 target=%34_blank%34>Scott Monty</a>, who heads up social media efforts at <a href=%34http://www.ford.com%34 target=%34_blank%34>Ford Motor Company</a>, recently wrote a great <a href=%34http://www.scottmonty.com/2010/08/who-do-you-trust.html%34 target=%34_blank%34>blog post about trust in social media</a>.&nbsp; Monty cites data published by <a href=%34http://www.emarketer.com/Article.aspx?R=1007863%34 target=%34_blank%34>eMarketer</a> displaying the most trusted sources of information for people who use social media.</p> <p>It comes as little surprise that the three most trusted sources of information are all peer-generated, and two of the three most popular channels are driven by friends in social network feeds. <strong>64% of people trust posts by friends in their Facebook news feed</strong>, and <strong>55% trust tweets from friends in their Twitter stream</strong>.&nbsp; This underscores the benefit of <a href=%34/products/engage%34>Janrain Engage</a> social publishing, and many of our customers are experiencing an average of <strong>9 new visitors to their site</strong> each time a user publishes a post to their social network.<br /> &nbsp;</p> <p><img alt=%34sources of information users trust on social media%34 src=%34/../../sites/default/files/eMarketer%20-%20Trust%20in%20Social%20Media.gif%34 style=%34width: 280px; height: 328px;%34 /></p> <p> We&rsquo;re all aware that social media has flipped the paradigm for marketers.&nbsp; Whereas brands used to have direct control over their message in traditional marketing (advertising, direct, email), social media has democratized communication and dissemination of information.&nbsp; Essentially, the battleground for marketers is shifting from <em>owned</em> and <em>paid media</em> to <em>earned media</em>.&nbsp; The result is that consumers, whose opinions are expressed through blogs, microblogging sites (such as Twitter) and social networks (like Facebook ), now command great influence over how a brand is perceived by other consumers.</p> <p>Brands seeking to tap into this trend can leverage peer-to-peer word of mouth marketing from their website. The social publishing features of <a href=%34/products/engage%34>Janrain Engage</a> enable a company&rsquo;s consumers to share activities such as comments, purchases and reviews directly with friends in a channel where trust is greater &ndash; the social network stream.</p> <p><img alt=%34janrain engage social publishing%34 src=%34/../../sites/default/files/Social-Publishing-Demo-scaled.jpg%34 style=%34width: 280px; height: 172px;%34 /><br /> &nbsp;<br /> Because social network news feeds function as a recommendation engine, this strategy results in an influx of highly qualified referral traffic from the social networks, helping brands break through communication barriers to reach new audiences.</p> <p>For those interested in reading more about this trend, <a href=%34http://www.edelman.com/trust/2010/%34 target=%34_blank%34>Edelman&rsquo;s annual trust barometer</a> also maps the power shift in the trust continuum between corporations and individuals.</p>",
				"plainText" :"Scott Monty, who heads up social media efforts at Ford Motor Company, recently wrote a great blog post about trust in social media.Monty cites data published by eMarketer displaying the most trusted sources of information for people who use social media. It comes as little surprise that the three most trusted sources of information are all peer-generated, and two of the three most popular channels are driven by friends in social network feeds. 64% of people trust posts by friends in their Facebook news feed, and 55% trust tweets from friends in their Twitter stream.This underscores the benefit of Janrain Engage social publishing, and many of our customers are experiencing an average of 9 new visitors to their site each time a user publishes a post to their social network. We're all aware that social media has flipped the paradigm for marketers.Whereas brands used to have direct control over their message in traditional marketing (advertising, direct, email), social media has democratized communication and dissemination of information.Essentially, the battleground for marketers is shifting from owned and paid media to earned media.The result is that consumers, whose opinions are expressed through blogs, microblogging sites (such as Twitter) and social networks (like Facebook ), now command great influence over how a brand is perceived by other consumers. Brands seeking to tap into this trend can leverage peer-to-peer word of mouth marketing from their website. The social publishing features of Janrain Engage enable a company&rsquo;s consumers to share activities such as comments, purchases and reviews directly with friends in a channel where trust is greater &ndash; the social network stream. Because social network news feeds function as a recommendation engine, this strategy results in an influx of highly qualified referral traffic from the social networks, helping brands break through communication barriers to reach new audiences. For those interested in reading more about this trend, Edelman&rsquo;s annual trust barometer also maps the power shift in the trust continuum between corporations and individuals.",
				"date" : "Aug 17, 2010 11:07 AM",
				"images" : 
				[
					"/../../sites/default/files/eMarketer%20-%20Trust%20in%20Social%20Media.gif",
					"/../../sites/default/files/Social-Publishing-Demo-scaled.jpg"
				]
			}
		},
		{
			"story" : 
			{
				"title" : "Measuring the Popularity of Social Media Platforms Across the Web",
				"link" : "http://www.janrain.com/blogs/measuring-popularity-social-media-platforms-across-web",
				"creator" : "Michael Olson",
				"description" : "<p>In <a href=%34/../../blogs/data-industry-trends-social-media-platforms%34 target=%34_blank%34>January</a> and <a href=%34/../../blogs/data-reveals-trends-among-social-media-platforms%34 target=%34_blank%34>April</a> of this year, we shared data on which social network or email identities people use to sign-in to websites and their preferred social networks for sharing their online activities. Today, <a href=%34http://mashable.com/2010/08/16/facebook-login-sharing-data/%34 target=%34_blank%34>Mashable published an update of our data</a>.</p> <p>Publications such as <a href=%34http://mashable.com/2010/04/21/facebook-open-graph/%34 target=%34_blank%34>Mashable</a>, <a href=%34http://techcrunch.com/2010/02/09/if-google-wave-is-the-future-google-buzz-is-the-present/%34 target=%34_blank%34>TechCrunch</a> or <a href=%34http://www.readwriteweb.com/archives/twitter_announces_anywhere_publishers_platform.php%34 target=%34_blank%34>ReadWriteWeb</a> frequently report on new services and features launched by major social networks and web portals like Facebook, Twitter, Google and Yahoo!. In an increasingly competitive landscape, these providers of online identity are furiously working to differentiate their offerings to reach a larger audience and build sustained loyalty among existing users.&nbsp; For marketers, digital strategists and developers managing websites for their online businesses, this has two major implications:</p> <ul> <li>It has become critical to understand the tools offered by these networks and how they can be leveraged to benefit your website and improve your online ROI. Implementing these tools on your corporate website can give your organization a huge competitive advantage.</li> <li>Because the networks are differentiating their features (and the plumbing and APIs for these features) so rapidly, it has become increasingly challenging to incorporate these tools into your website on your own. Hosted solutions that aggregate features from each network in a write to one, add support for many model can connect your site to the social networks quickly, saving you time and money while freeing you from ongoing maintenance and optimization.</li> </ul> <p>What follows here is an updated look at the most popular networks for sign-in and sharing based on the <strong>more than 250,000 websites worldwide using <a href=%34/products/engage%34>Janrain Engage</a></strong>. This report also looks at vertical markets such as News Media, Magazine Publishers, and Music Sites, as well as geographic preferences in Europe.<br /> &nbsp;<br /> <img alt=%34social media sign-in preferences%34 src=%34/sites/default/files/sign-in-preferences-janrain-customers-scaled.jpg%34 style=%34width: 280px; height: 203px;%34 /><br /> Overall relative popularity of each network has held steady during the past quarter. Google remains the most preferred network with nearly 40% share. Facebook continues to be a popular option, and Yahoo!&rsquo;s share has grown slightly since April, with 14% preferring a Yahoo! account to sign-in. While Twitter&rsquo;s popularity in the social web ecosystem continues to rise, it still remains the 4th most popular network for sign-in across our customers&rsquo; websites.<br /> &nbsp;<br /> The story is different with media companies. On news media sites, Yahoo! is the leading choice for sign-in with 34% share. As a content-focused network, Yahoo! users proactively seek out news and timely content across the web, making it no surprise that the network performs well in this industry segment. Facebook and Google also maintain strong presences on news media sites.</p> <p><img alt=%34news media sign-in preferences%34 src=%34/sites/default/files/sign-in-preferences-news-media-scaled.jpg%34 style=%34width: 280px; height: 149px;%34 /></p> <p> For magazine publishers, Facebook comprises 57% share of all logins. Many magazine publishers focus on lifestyle and interests, a natural pairing with Facebook users who like to share their interests with friends.</p> <p><img alt=%34magazine publishers sign-in preferences%34 src=%34/sites/default/files/sign-in-preferences-magazine-publishers-scaled.jpg%34 style=%34width: 280px; height: 156px;%34 /><br /> &nbsp;<br /> On music sites (including the official communities of leading artists), Facebook and Twitter lead the pack by a considerable margin. Given that people tend to interact with these types of sites to learn about and share events, concert dates, new albums and other, it is no surprise that Facebook and Twitter have a strong lead over other networks in this vertical.<br /> &nbsp;<br /> <img alt=%34music sites sign-in preferences%34 src=%34/sites/default/files/sign-in-preferences-music-sites-scaled.jpg%34 style=%34width: 280px; height: 183px;%34 /><br /> &nbsp;</p> <p>On retail websites, Facebook is again the leading choice for sign-in and has grown in popularity with a 5% increase from last quarter. A sizable percentage (44% combined) also prefer to login via Yahoo! and Google.<br /> &nbsp;<br /> <img alt=%34retail sign-in preferences%34 src=%34/sites/default/files/sign-in-preferences-retail-scaled.jpg%34 style=%34width: 280px; height: 147px;%34 /><br /> &nbsp;<br /> A look across Europe shows that Facebook is the most popular network for sign-in, followed by Google and Twitter.&nbsp; Windows Live is nearly twice as popular as a sign-in provider in Europe than in the U.S. It is important to note that regional social networks like <a href=%34http://www.hyves.nl%34 target=%34_blank%34>Hyves</a> perform very well in parts of Europe, particularly in the Netherlands.&nbsp; On certain Dutch websites, for example, Hyves is the chosen social network for sign-in by as many as 60% of web users. This sample includes media, music entertainment, online guides, social communities and technology sites in ten countries across Europe.</p> <p><img alt=%34europe sign-in preferences%34 src=%34/sites/default/files/sign-in-preferences-europe-scaled.jpg%34 style=%34width: 280px; height: 141px;%34 /></p> <p>&nbsp;<br /> The networks people prefer to sign-in to a website is only part of the equation. With the advent of social networks as a hub for content and activity sharing, companies are leveraging the sharing tools of Janrain Engage to enable their users to publish site activities (such as comments, purchases and reviews) to their friends on multiple social networks. On average, <strong>Janrain customers are realizing 9 qualified new visitors to their site from each post or social activity from a user on that site</strong>. This is word-of-mouth marketing in action, and results in a larger audience, increased page views, increased time on site and deeper engagement with your users.<br /> &nbsp;<br /> The breakdown of how consumers share their online activities through Janrain Engage social publishing:</p> <p><img alt=%34social publishing sharing preferences%34 src=%34/sites/default/files/preferred-social-networks-for-sharing-scaled.jpg%34 style=%34width: 280px; height: 157px;%34 /></p> <p> While Facebook is the most popular network for social sharing (53%), Twitter, Yahoo! and MySpace on aggregate are valued as highly (52%) by people for online activity syndication.&nbsp; It is important to note that Janrain Engage supports publishing of user activities to multiple social networks simultaneously. As an example, certain users may choose to share a purchase, article comment or product review with friends across four social networks at once.<br /> &nbsp;<br /> The landscape of the social web is competitive, and social networks and web portals are aggressively competing to be the trusted hub for a consumer&#39;s online identity. Because of this, uniform preference among web users is hard to find. In our conversations with organizations using Janrain Engage, we&rsquo;ve found that they reach more customers and generate more revenue from their online efforts by casting a wide net across the social networks and identity providers.<br /> &nbsp;<br /> We will continue to publish data on social media platform preferences on a quarterly basis, and spotlight key new verticals.</p> <p>&nbsp;<br /> <strong>Historical Reports:</strong><br /> &nbsp;<br /> <a href=%34/blogs/data-reveals-trends-among-social-media-platforms%34>Data Reveals Trends Among Social Media Platforms</a> &ndash; April 2010<br /> <a href=%34/blogs/data-industry-trends-social-media-platforms%34>Data on Industry Trends in Social Media Platforms</a>&nbsp; - January 2010</p> <p> &nbsp;</p>",
				"plainText" :"In January and April of this year, we shared data on which social network or email identities people use to sign-in to websites and their preferred social networks for sharing their online activities. Today, Mashable published an update of our data. Publications such as Mashable, TechCrunch or ReadWriteWeb frequently report on new services and features launched by major social networks and web portals like Facebook, Twitter, Google and Yahoo!. In an increasingly competitive landscape, these providers of online identity are furiously working to differentiate their offerings to reach a larger audience and build sustained loyalty among existing users.For marketers, digital strategists and developers managing websites for their online businesses, this has two major implications: It has become critical to understand the tools offered by these networks and how they can be leveraged to benefit your website and improve your online ROI. Implementing these tools on your corporate website can give your organization a huge competitive advantage. Because the networks are differentiating their features (and the plumbing and APIs for these features) so rapidly, it has become increasingly challenging to incorporate these tools into your website on your own. Hosted solutions that aggregate features from each network in a write to one, add support for many model can connect your site to the social networks quickly, saving you time and money while freeing you from ongoing maintenance and optimization. What follows here is an updated look at the most popular networks for sign-in and sharing based on the more than 250,000 websites worldwide using Janrain Engage. This report also looks at vertical markets such as News Media, Magazine Publishers, and Music Sites, as well as geographic preferences in Europe. Overall relative popularity of each network has held steady during the past quarter. Google remains the most preferred network with nearly 40% share. Facebook continues to be a popular option, and Yahoo!&rsquo;s share has grown slightly since April, with 14% preferring a Yahoo! account to sign-in. While Twitter&rsquo;s popularity in the social web ecosystem continues to rise, it still remains the 4th most popular network for sign-in across our customers&rsquo; websites. The story is different with media companies. On news media sites, Yahoo! is the leading choice for sign-in with 34% share. As a content-focused network, Yahoo! users proactively seek out news and timely content across the web, making it no surprise that the network performs well in this industry segment. Facebook and Google also maintain strong presences on news media sites. For magazine publishers, Facebook comprises 57% share of all logins. Many magazine publishers focus on lifestyle and interests, a natural pairing with Facebook users who like to share their interests with friends. On music sites (including the official communities of leading artists), Facebook and Twitter lead the pack by a considerable margin. Given that people tend to interact with these types of sites to learn about and share events, concert dates, new albums and other, it is no surprise that Facebook and Twitter have a strong lead over other networks in this vertical. On retail websites, Facebook is again the leading choice for sign-in and has grown in popularity with a 5% increase from last quarter. A sizable percentage (44% combined) also prefer to login via Yahoo! and Google. A look across Europe shows that Facebook is the most popular network for sign-in, followed by Google and Twitter.Windows Live is nearly twice as popular as a sign-in provider in Europe than in the U.S. It is important to note that regional social networks like Hyves perform very well in parts of Europe, particularly in the Netherlands.On certain Dutch websites, for example, Hyves is the chosen social network for sign-in by as many as 60% of web users. This sample includes media, music entertainment, online guides, social communities and technology sites in ten countries across Europe. The networks people prefer to sign-in to a website is only part of the equation. With the advent of social networks as a hub for content and activity sharing, companies are leveraging the sharing tools of Janrain Engage to enable their users to publish site activities (such as comments, purchases and reviews) to their friends on multiple social networks. On average, Janrain customers are realizing 9 qualified new visitors to their site from each post or social activity from a user on that site. This is word-of-mouth marketing in action, and results in a larger audience, increased page views, increased time on site and deeper engagement with your users. The breakdown of how consumers share their online activities through Janrain Engage social publishing: While Facebook is the most popular network for social sharing (53%), Twitter, Yahoo! and MySpace on aggregate are valued as highly (52%) by people for online activity syndication.It is important to note that Janrain Engage supports publishing of user activities to multiple social networks simultaneously. As an example, certain users may choose to share a purchase, article comment or product review with friends across four social networks at once. The landscape of the social web is competitive, and social networks and web portals are aggressively competing to be the trusted hub for a consumer's online identity. Because of this, uniform preference among web users is hard to find. In our conversations with organizations using Janrain Engage, we&rsquo;ve found that they reach more customers and generate more revenue from their online efforts by casting a wide net across the social networks and identity providers. We will continue to publish data on social media platform preferences on a quarterly basis, and spotlight key new verticals. Historical Reports: Data Reveals Trends Among Social Media Platforms &ndash; April 2010 Data on Industry Trends in Social Media Platforms - January 2010",
				"date" : "Aug 16, 2010 11:59 AM",
				"images" : 
				[
					"/sites/default/files/sign-in-preferences-janrain-customers-scaled.jpg",
					"/sites/default/files/sign-in-preferences-news-media-scaled.jpg",
					"/sites/default/files/sign-in-preferences-magazine-publishers-scaled.jpg",
					"/sites/default/files/sign-in-preferences-music-sites-scaled.jpg",
					"/sites/default/files/sign-in-preferences-retail-scaled.jpg",
					"/sites/default/files/sign-in-preferences-europe-scaled.jpg",
					"/sites/default/files/preferred-social-networks-for-sharing-scaled.jpg"
				]
			}
		},
		{
			"story" : 
			{
				"title" : "Janrain Launches New Online Profile Management Solution, Janrain Capture",
				"link" : "http://www.janrain.com/blogs/janrain-launches-new-online-profile-management-solution-janrain-capture",
				"creator" : "Michael Olson",
				"description" : "<p><img alt=%34janrain capture%34 src=%34/sites/default/files/capture_0.png%34 style=%34padding: 0px 0px 20px 20px; float: right; width: 133px; height: 114px;%34 /></p> <p>During the past decade, organizations have evolved their online presence from static brochureware into dynamic web destinations that provide personalized and rich experiences for users. To fuel these experiences, online businesses must have a robust repository to store user profile data, preferences and behaviors.</p> <p>With the advent of social networks and solutions like <a href=%34/products/engage%34 target=%34_blank%34>Janrain Engage</a>, which enable organizations to collect rich demographic and social graph information on their audience, company databases often have not been optimized to fully leverage and encapsulate this information.</p> <p>That&rsquo;s where Janrain can help. Yesterday, we <a href=%34/press-releases/janrain-launches-new-user-management-solution-online-businesses%34>announced the release of Janrain Capture</a>, a cloud-based solution that enables online businesses to store user profile data and make it actionable. Companies such as <a href=%34http://channel.nationalgeographic.com%34 target=%34_blank%34>National Geographic Channel</a>, Kodak and <a href=%34http://www.yellowpages.ca%34 target=%34_blank%34>YellowPages.ca</a> are using Janrain Capture to <a href=%34http://emediavitals.com/blog/1005/janrain-launches-service-capture-users-social-data%34 target=%34_blank%34>build enriching online experiences for their members</a>.</p> <p><a href=%34http://channel.nationalgeographic.com%34 target=%34_blank%34>National Geographic Channel</a> selected <a href=%34/products/capture%34>Janrain Capture</a> to provide a single, flexible hosted user profile system and distribute user profile info to the National Geographic&rsquo;s <a href=%34http://www.pluck.com%34 target=%34_blank%34>Pluck social community platform</a> and email system. National Geographic Channel is also using <a href=%34/products/engage%34>Janrain Engage</a> to enable its users to sign in with an existing account on Facebook, Twitter, Google or other networks.</p> <p><img alt=%34national geographic channel%34 src=%34/sites/default/files/natgeochannel-engage-capture.JPG%34 style=%34width: 280px; height: 193px;%34 /></p> <p><a href=%34http://www.yellowpages.ca%34 target=%34_blank%34>YellowPages.ca</a>&trade; chose <a href=%34/products/capture%34>Janrain Capture</a> to add user registration and a profile system in the cloud. Janrain Capture hosts the registration screens and the profile pages, and handles the email verification process. YellowPages.ca also uses <a href=%34/products/engage%34>Janrain Engage</a> and <a href=%34/products/federate%34>Janrain Federate</a> to offer login via Facebook and federated single sign on across partner sites.</p> <p><img alt=%34yellowpages%34 src=%34/sites/default/files/yellowpages-capture.JPG%34 style=%34width: 280px; height: 211px;%34 /></p> <p><strong>Key Features of <a href=%34/products/capture%34>Janrain Capture</a> include:</strong></p> <ul> <li>Customizable profile database</li> <li>Branded registration helper screens for data capture</li> <li>Connectors to 3rd party systems such as Commenting, CMS, Ratings &amp; Reviews, or Analytics</li> <li>Public profile pages for end users</li> <li>End user self-service administrative screens</li> <li>Safeguards and access controls for user profile data</li> <li>Data import tool for importing existing user databases</li> <li>Software as a service deployment</li> </ul> <p><a href=%34/products/engage%34>Janrain Engage</a>, <a href=%34/products/federate%34>Janrain Federate</a> and <a href=%34/products/capture%34>Janrain Capture</a> can be used separately or together in the Janrain User Management platform to help companies manage all aspects of user engagement.</p>",
				"plainText" :"During the past decade, organizations have evolved their online presence from static brochureware into dynamic web destinations that provide personalized and rich experiences for users. To fuel these experiences, online businesses must have a robust repository to store user profile data, preferences and behaviors. With the advent of social networks and solutions like Janrain Engage, which enable organizations to collect rich demographic and social graph information on their audience, company databases often have not been optimized to fully leverage and encapsulate this information. That's where Janrain can help. Yesterday, we announced the release of Janrain Capture, a cloud-based solution that enables online businesses to store user profile data and make it actionable. Companies such as National Geographic Channel, Kodak and YellowPages.ca are using Janrain Capture to build enriching online experiences for their members. National Geographic Channel selected Janrain Capture to provide a single, flexible hosted user profile system and distribute user profile info to the National Geographic's Pluck social community platform and email system. National Geographic Channel is also using Janrain Engage to enable its users to sign in with an existing account on Facebook, Twitter, Google or other networks. YellowPages.ca &trade; chose Janrain Capture to add user registration and a profile system in the cloud. Janrain Capture hosts the registration screens and the profile pages, and handles the email verification process. YellowPages.ca also uses Janrain Engage and Janrain Federate to offer login via Facebook and federated single sign on across partner sites. Key Features of Janrain Capture include: Customizable profile database Branded registration helper screens for data capture Connectors to 3rd party systems such as Commenting, CMS, Ratings &amp; Reviews, or Analytics Public profile pages for end users End user self-service administrative screens Safeguards and access controls for user profile data Data import tool for importing existing user databases Software as a service deployment Janrain Engage, Janrain Federate and Janrain Capture can be used separately or together in the Janrain User Management platform to help companies manage all aspects of user engagement.",
				"date" : "Aug 11, 2010 8:40 AM",
				"images" : 
				[
					"/sites/default/files/capture_0.png",
					"/sites/default/files/natgeochannel-engage-capture.JPG",
					"/sites/default/files/yellowpages-capture.JPG"
				]
			}
		},
		{
			"story" : 
			{
				"title" : "Tal.ki sees a 40% increase in website logins with Janrain Engage",
				"link" : "http://www.janrain.com/blogs/talki-sees-40-increase-login-janrain-engage",
				"creator" : "Vincent Lauria",
				"description" : "<p><img alt=%34Tal.ki uses Janrain Engage%34 src=%34/sites/default/files/partner-talki.png%34 style=%34padding-top: 0px; padding-right: 0px; padding-bottom: 20px; padding-left: 20px; float: right; width: 150px; height: 87px; %34 /></p> <p><em>Our partner, Vincent Lauria of Tal.ki, contributed this post for today:</em></p> <p> We&#39;ve been running on the <a href=%34/janrain-products-overview%34>Janrain platform</a> for over half a year now. We use <a href=%34/products/engage%34>Janrain Engage</a> to allow for third-party logins, such as Facebook, Twitter, Google, etc. When we first built our product, <a href=%34http://tal.ki/%34 target=%34_blank%34>Tal.ki Embeddable Forums</a>, we made the&nbsp;conscious&nbsp;decision to not build our own user login system, we wanted to go the third-party route, this had two advantages:</p> <ol> <li>Less development time to get to market</li> <li>A seamless experience for forums embedded across thousands of sites, no need to signup and create a new profile each time, just hop in and join the conversation.</li> </ol> <p>At first, we directly integrated with the third-party providers and provided support for Facebook, Google, and Twitter. But <strong>we quickly learned that managing these providers required ongoing work to follow their ever-changing APIs</strong> (I&#39;m looking at you Facebook). For a startup, that was taking significant resources. A colleague had mentioned <a href=%34http://www.janrain.com%34>Janrain</a>. I was familiar with the company from their very early work &amp; contributions in the OpenID space. After reading up on their documentation, we really liked the idea of supporting only *one* API and letting Janrain handle the rest, from evolving APIs to adding new <a href=%34/solutions/supported-networks%34>providers</a>. The decision was clear for us and we made the switch rapidly.</p> <p>We quickly became impressed with the <a href=%34/products/janrain-engage/features%34>features Janrain had to offer</a>, like login analytics, and a dashboard to select and edit login network preferences. The ability to track daily logins has proved useful. It allows us to know where to focus our attention for pushing updates to a person&#39;s activity stream. And because we support Single Sign-On (SSO), we can also track the logins of third-party companies we partner with and see how their daily activity is improving. Some of our partners include <a href=%34http://www.weebly.com/%34 target=%34_blank%34>Weebly</a>, <a href=%34http://www.bligoo.com/%34 target=%34_blank%34>Bligoo</a>, and <a href=%34http://www.yola.com/%34 target=%34_blank%34>Yola</a>.</p> <p>We&#39;re now supporting more logins than we had ever planned, and that is important, for instance, when the Facebook privacy issue hit the mainstream news, we saw Facebook logins drop, and a handful of other logins picked up, that we wouldn&#39;t have previously supported.</p> <p style=%34text-align: center; %34><img alt=%34%34 src=%34/sites/default/files/soccer.jpg%34 style=%34width: 280px; height: 167px; %34 /></p> <p>We have a second product line that doesn&#39;t have support for third-party logins, comparing the two services, I&#39;ve noticed a few interesting things:</p> <ul> <li>More visitors signing in. When we switched to third-party logins with Janrain, <strong>we saw the number of visitors who login increase by over 40%</strong>!</li> <li><strong>Less time with our support team</strong>. Previously, we had over 30 people/day with login issues that needed to head to a support site. Now with Janrain, <strong>we have not had one support issue due to login</strong>, issues like forgotten passwords, incorrect emails, expired or conflicting cookies are ting of the past.</li> </ul> <p>We&#39;re continuing to integrate more of the Janrain product line into our services, and in the past few months, I&#39;ve had a number of colleagues tell me they&#39;re doing the same.</p>",
				"plainText" :"Our partner, Vincent Lauria of Tal.ki, contributed this post for today: We've been running on the Janrain platform for over half a year now. We use Janrain Engage to allow for third-party logins, such as Facebook, Twitter, Google, etc. When we first built our product, Tal.ki Embeddable Forums, we made the conscious decision to not build our own user login system, we wanted to go the third-party route, this had two advantages: Less development time to get to market A seamless experience for forums embedded across thousands of sites, no need to signup and create a new profile each time, just hop in and join the conversation. At first, we directly integrated with the third-party providers and provided support for Facebook, Google, and Twitter. But we quickly learned that managing these providers required ongoing work to follow their ever-changing APIs (I'm looking at you Facebook). For a startup, that was taking significant resources. A colleague had mentioned Janrain. I was familiar with the company from their very early work & contributions in the OpenID space. After reading up on their documentation, we really liked the idea of supporting only *one* API and letting Janrain handle the rest, from evolving APIs to adding new providers. The decision was clear for us and we made the switch rapidly. We quickly became impressed with the features Janrain had to offer, like login analytics, and a dashboard to select and edit login network preferences. The ability to track daily logins has proved useful. It allows us to know where to focus our attention for pushing updates to a person's activity stream. And because we support Single Sign-On (SSO), we can also track the logins of third-party companies we partner with and see how their daily activity is improving. Some of our partners include Weebly, Bligoo, and Yola. We're now supporting more logins than we had ever planned, and that is important, for instance, when the Facebook privacy issue hit the mainstream news, we saw Facebook logins drop, and a handful of other logins picked up, that we wouldn't have previously supported. We have a second product line that doesn't have support for third-party logins, comparing the two services, I've noticed a few interesting things: More visitors signing in. When we switched to third-party logins with Janrain, we saw the number of visitors who login increase by over 40% ! Less time with our support team. Previously, we had over 30 people/day with login issues that needed to head to a support site. Now with Janrain, we have not had one support issue due to login, issues like forgotten passwords, incorrect emails, expired or conflicting cookies are ting of the past. We're continuing to integrate more of the Janrain product line into our services, and in the past few months, I've had a number of colleagues tell me they're doing the same.",
				"date" : "Aug 6, 2010 8:40 AM",
				"images" : 
				[
					"/sites/default/files/partner-talki.png",
					"/sites/default/files/soccer.jpg"
				]
			}
		},
		{
			"story" : 
			{
				"title" : "Janrain to Speak at eTail East on August 11",
				"link" : "http://www.janrain.com/blogs/janrain-speaking-etail-east-august-11",
				"creator" : "Lisa Hannah",
				"description" : "<p><img alt=%34%34 src=%34/sites/default/files/10359_005_logo.jpg%34 style=%34padding-top: 0px; padding-right: 0px; padding-bottom: 20px; padding-left: 20px; float: right; width: 155px; height: 55px; %34 />Next week <a href=%34http://www.janrain.com%34>Janrain</a> will be speaking at <a href=%34http://www.wbresearch.com/etailusaeast/home.aspx%34 target=%34_blank%34>eTail East</a> in Baltimore, MD, one of the largest annual internet retail conferences.</p> <p>Janrain CEO, Brian Kissel, will be on a panel on Wednesday, August 11 on the important topic of &ldquo;<strong>Re-designing Your Website to Increase Conversion Rates &amp; Better Engage Customers.</strong>&quot; Bill Aicher, Director of Web and Marketing of <a href=%34http://Musicnotes.com%34 target=%34_blank%34>Musicnotes.com</a> and Josh Himwich, Director of eCommerce Solutions of <a href=%34http://Diapers.com%34 target=%34_blank%34>Diapers.com</a> will join Kissel in this discussion about identifying your strategic goals when redesigning your website and also how to engage your users throughout the purchasing process.</p> <p>We are looking forward to contributing to the discussions, seeing some of our retail customers, and meeting new people. Key conference themes include social media and engagement, the evolution of SEO and creating a relevant, personalized experience.</p> <p>If you plan on attending, <a href=%34/contact-us%34>please let us know</a> &ndash; we&rsquo;d love to connect in person.</p>",
				"plainText" :"Next week Janrain will be speaking at eTail East in Baltimore, MD, one of the largest annual internet retail conferences. Janrain CEO, Brian Kissel, will be on a panel on Wednesday, August 11 on the important topic of %34Re-designing Your Website to Increase Conversion Rates & Better Engage Customers.%34 Bill Aicher, Director of Web and Marketing of Musicnotes.com and Josh Himwich, Director of eCommerce Solutions of Diapers.com will join Kissel in this discussion about identifying your strategic goals when redesigning your website and also how to engage your users throughout the purchasing process. We are looking forward to contributing to the discussions, seeing some of our retail customers, and meeting new people. Key conference themes include social media and engagement, the evolution of SEO and creating a relevant, personalized experience. If you plan on attending, please let us know &ndash; we&rsquo;d love to connect in person.",
				"date" : "Aug 5, 2010 11:38 AM",
				"images" : 
				[
					"/sites/default/files/10359_005_logo.jpg"
				]
			}
		},
		{
			"story" : 
			{
				"title" : "Janrain Helps Radio Stations Take Advantage of Social Media",
				"link" : "http://www.janrain.com/blogs/janrain-helps-radio-stations-take-advantage-social-media",
				"creator" : "Lisa Hannah",
				"description" : "<p>Last week we announced a new relationship with <a href=%34http://www.tritondigitalmedia.com%34 target=%34_blank%34>Triton Media Group</a>, the leading supplier of digital products and services to the media industry. Its <a href=%34http://www.tritondigitalmedia.com%34 target=%34_blank%34>Triton Digital</a> division supports more than 6,000 radio station affiliations with applications and content.</p> <p>Noted media researcher and strategist, <a href=%34http://www.markramseymedia.com/%34 target=%34_blank%34>Mark Ramsey</a>, has interviewed execs at both companies to discuss more about how radio stations are using, or need to be using social media to remain competitive.</p> <p>According to Mark, &ldquo;With social media being an increasingly important and central component of every consumer&#39;s online experience, it&#39;s critical for broadcasters to meet consumers where they live, nurture relationships based on who these individuals actually are, and dive into a conversation where consumers - not billboards and TV spots - become their brand ambassadors. Janrain makes that goal achievable.&rdquo;</p> <p>The <a href=%34http://www.markramseymedia.com/2010/08/tritons-mike-agovino-on-radios-social-media-future/%34 target=%34_blank%34>first video interview is with Mike Agovino, COO of Triton Media</a>, and the <a href=%34http://www.markramseymedia.com/2010/08/the-power-of-social-media-finally-comes-to-radio/%34 target=%34_blank%34>second is with Brian Kissel, CEO of Janrain</a>. Both go into detail about how radio can take advantage of their listeners&rsquo; affiliations on different social networks to build more engaging relationships, uncover new revenue streams and connect media sites to the social web.</p> <p><object height=%34270%34 width=%34480%34><param name=%34allowfullscreen%34 value=%34true%34 /><param name=%34allowscriptaccess%34 value=%34always%34 /><param name=%34movie%34 value=%34http://vimeo.com/moogaloop.swf?clip_id=13806473&amp;server=vimeo.com&amp;show_title=1&amp;show_byline=1&amp;show_portrait=0&amp;color=00adef&amp;fullscreen=1&amp;autoplay=0&amp;loop=0%34 /><embed allowfullscreen=%34true%34 allowscriptaccess=%34always%34 height=%34270%34 src=%34http://vimeo.com/moogaloop.swf?clip_id=13806473&amp;server=vimeo.com&amp;show_title=1&amp;show_byline=1&amp;show_portrait=0&amp;color=00adef&amp;fullscreen=1&amp;autoplay=0&amp;loop=0%34 type=%34application/x-shockwave-flash%34 width=%34480%34></embed></object></p> <p><object height=%34270%34 width=%34480%34><param name=%34allowfullscreen%34 value=%34true%34 /><param name=%34allowscriptaccess%34 value=%34always%34 /><param name=%34movie%34 value=%34http://vimeo.com/moogaloop.swf?clip_id=13852757&amp;server=vimeo.com&amp;show_title=1&amp;show_byline=1&amp;show_portrait=0&amp;color=00adef&amp;fullscreen=1&amp;autoplay=0&amp;loop=0%34 /><embed allowfullscreen=%34true%34 allowscriptaccess=%34always%34 height=%34270%34 src=%34http://vimeo.com/moogaloop.swf?clip_id=13852757&amp;server=vimeo.com&amp;show_title=1&amp;show_byline=1&amp;show_portrait=0&amp;color=00adef&amp;fullscreen=1&amp;autoplay=0&amp;loop=0%34 type=%34application/x-shockwave-flash%34 width=%34480%34></embed></object></p>",
				"plainText" :"Last week we announced a new relationship with Triton Media Group, the leading supplier of digital products and services to the media industry. Its Triton Digital division supports more than 6,000 radio station affiliations with applications and content. Noted media researcher and strategist, Mark Ramsey, has interviewed execs at both companies to discuss more about how radio stations are using, or need to be using social media to remain competitive. According to Mark, %34With social media being an increasingly important and central component of every consumer's online experience, it's critical for broadcasters to meet consumers where they live, nurture relationships based on who these individuals actually are, and dive into a conversation where consumers - not billboards and TV spots - become their brand ambassadors. Janrain makes that goal achievable.%34 The first video interview is with Mike Agovino, COO of Triton Media, and the second is with Brian Kissel, CEO of Janrain. Both go into detail about how radio can take advantage of their listeners&rsquo; affiliations on different social networks to build more engaging relationships, uncover new revenue streams and connect media sites to the social web.",
				"date" : "Aug 4, 2010 9:02 AM"
			}
		},
		{
			"story" : 
			{
				"title" : "Triton Digital Media Ramps up Social Media Presence with Janrain Engage",
				"link" : "http://www.janrain.com/blogs/triton-digital-media-ramps-social-media-presence",
				"creator" : "Michael Olson",
				"description" : "<p><img alt=%34triton digital media%34 src=%34/../../sites/default/files/triton-digital.JPG%34 style=%34padding: 0pt 0pt 20px 20px; width: 180px; height: 78px; float: right;%34 /></p> <p>Today, it was announced that <a href=%34http://www.prweb.com/releases/2010/07/prweb4316704.htm%34 target=%34_blank%34>Triton Digital Media plans to integrate Janrain Engage</a> authentication and social publishing functionality into its Loyalty Program, enabling <a href=%34http://www.allaccess.com/net-news/archive/story/78640/triton-digital-ramps-up-social-media-presence-with%34 target=%34_blank%34>Triton Digital&#39;s radio affiliates to connect their website to the social web</a> by making it easy for visitors to sign up with an existing social network identity and share their site activities with friends on multiple social networks.</p> <p>One of the challenges for marketers, content managers and digital strategists at radio companies today is how to monetize their content and drive additional revenue streams that augment sales of radio advertising spots. <a href=%34http://www.tritondigitalmedia.com%34 target=%34_blank%34>Triton Digital Media</a>&#39;s platform helps radio companies foster engagement and optimize their corporate web presence, and its Loyalty Program includes a CMS, ad serving and e-commerce to help radio stations drive a larger percentage of revenues from their online presence. Triton Digital currently supports more than 6,000 radio station affiliates across the U.S.</p> <p> A few months ago, Jim Kerr, VP Stategy at Triton Digital Media, touched upon the digital revolution that is starting to occur in the radio industry:</p> <p><embed allowfullscreen=%34true%34 allowscriptaccess=%34always%34 height=%34300%34 src=%34http://blip.tv/play/ulOBsL5sAg%34 type=%34application/x-shockwave-flash%34 width=%34480%34></embed></p> <p> At the 5:30 mark in the discussion, the interviewer notes an example of a radio company&#39;s use of Facebook ads to promote its Facebook page. In the example, the metric for success was based on the number of impressions and new visitors that the Facebook ad campaign generated on Facebook. By not also pointing listeners to the radio station&#39;s corporate site, where personalized content and targeted ads can be served, a revenue opportunity was missed.</p> <p> Kerr points out that radio stations have historically lacked tools to continue conversations from the social networks and engage listeners on their own site - where they control the playing field, originate content and serve ads. <a href=%34http://tritondigitalmedia.com/interactive/%34 target=%34_blank%34>Triton&#39;s solutions</a> address this challenge by making it easy for radio stations to create and publish engaging content on their corporate site. <a href=%34/products/engage%34>Janrain Engage</a> enables increased registration rates and user interactions on that site to be shared virally on the social networks, thus creating a steady stream of qualified referral traffic back to the radio affiliate site.</p> <p> <a href=%34http://www.markramseymedia.com%34 target=%34_blank%34>The interviewer</a> closes the conversation with Kerr by noting a mantra in comedy that &quot;a joke only works if you commit to it.&quot; The same applies when it comes to social media&nbsp; Radio stations can gain a competitive advantage by incorporating social media tools that extend the conversation beyond a Facebook or Twitter page and drive engagement back on their own website. Triton Digital Media&#39;s solutions, enhanced with Janrain Engage, make this possible.</p>",
				"plainText" :"Today, it was announced that Triton Digital Media plans to integrate Janrain Engage authentication and social publishing functionality into its Loyalty Program, enabling Triton Digital's radio affiliates to connect their website to the social web by making it easy for visitors to sign up with an existing social network identity and share their site activities with friends on multiple social networks. One of the challenges for marketers, content managers and digital strategists at radio companies today is how to monetize their content and drive additional revenue streams that augment sales of radio advertising spots. Triton Digital Media 's platform helps radio companies foster engagement and optimize their corporate web presence, and its Loyalty Program includes a CMS, ad serving and e-commerce to help radio stations drive a larger percentage of revenues from their online presence. Triton Digital currently supports more than 6,000 radio station affiliates across the U.S. A few months ago, Jim Kerr, VP Stategy at Triton Digital Media, touched upon the digital revolution that is starting to occur in the radio industry: At the 5:30 mark in the discussion, the interviewer notes an example of a radio company's use of Facebook ads to promote its Facebook page. In the example, the metric for success was based on the number of impressions and new visitors that the Facebook ad campaign generated on Facebook. By not also pointing listeners to the radio station's corporate site, where personalized content and targeted ads can be served, a revenue opportunity was missed. Kerr points out that radio stations have historically lacked tools to continue conversations from the social networks and engage listeners on their own site - where they control the playing field, originate content and serve ads. Triton's solutions address this challenge by making it easy for radio stations to create and publish engaging content on their corporate site. Janrain Engage enables increased registration rates and user interactions on that site to be shared virally on the social networks, thus creating a steady stream of qualified referral traffic back to the radio affiliate site. The interviewer closes the conversation with Kerr by noting a mantra in comedy that &quot;a joke only works if you commit to it.&quot; The same applies when it comes to social mediaRadio stations can gain a competitive advantage by incorporating social media tools that extend the conversation beyond a Facebook or Twitter page and drive engagement back on their own website. Triton Digital Media's solutions, enhanced with Janrain Engage, make this possible.",
				"date" : "Jul 30, 2010 1:27 AM",
				"images" : 
				[
					"/../../sites/default/files/triton-digital.JPG"
				]
			}
		},
		{
			"story" : 
			{
				"title" : "The 8 Success Criteria for Facebook Page Marketing from Altimeter Group",
				"link" : "http://www.janrain.com/blogs/8-success-criteria-facebook-page-marketing-altimeter-group",
				"creator" : "Lisa Hannah",
				"description" : "<p><img alt=%34%34 src=%34/sites/default/files/altimeter.gif%34 style=%34padding-top: 0px; padding-right: 0px; padding-bottom: 20px; padding-left: 20px; float: right; width: 180px; height: 233px; %34 />Today the <a href=%34http://www.altimetergroup.com/%34 target=%34_blank%34>Altimeter Group</a> published a new report: <strong><em><a href=%34http://www.web-strategist.com/blog/2010/07/27/altimeter-report-the-8-success-criteria-for-facebook-page-marketing/%34 target=%34_blank%34>The 8 Success Criteria for Facebook Page Marketing</a></em></strong>. Drawing on input from 34 vendors (including <a href=%34http://www.janrain.com%34>Janrain</a>), agencies and experts, Altimeter defines the golden rules for getting the most out of your Facebook marketing efforts and tests the maturity level of 30 top brands across this criteria.</p> <p>Citing real world examples from the likes of Pampers, Target, Sears and Macys, Altimeter does a nice job of packaging up best practices in this area. The bottom line is that most companies still have a ways to go to fully tap into the marketing engine inside Facebook.</p> <p>Considering that 68% of consumers with a Facebook account say a positive referral from a Facebook friend would make them more likely to buy from or visit a retailer, this is clearly something all marketers need to figure out quickly.</p> <p>On the bright side, it isn&rsquo;t rocket science, and the report includes practical tips and pointers that are relevant to any organization, regardless of size or industry.</p> <p>A final recommendation is to:</p> <p><strong><em>Connect the Facebook experience with existing efforts, like your corporate website.<br /> </em></strong><em>Customers want to connect to their friends on Facebook and beyond. As you become advanced, you must integrate Facebook features into your corporate website providing opportunities for instant engagement and word of mouth. However, don&rsquo;t foolishly send away your hard-earned traffic to Facebook without a strategy. Instead aggregate Facebook discussions right on your corporate website.</em></p> <p><a href=%34/products/engage%34>Janrain Engage</a> does just that and more &ndash; <a href=%34/products/engage%34>learn more here</a>.</p> <p>Check out the Altimeter Slideshare presentation here:</p> <div id=%34__ss_4850455%34 style=%34width:477px%34><strong style=%34display:block;margin:12px 0 4px%34><a href=%34http://www.slideshare.net/jeremiah_owyang/the-8-success-criteria-for-facebook-page-marketing%34 title=%34The 8 Success Criteria For Facebook Page Marketing %34>The 8 Success Criteria For Facebook Page Marketing </a></strong> <object height=%34510%34 id=%34__sse4850455%34 width=%34477%34><param name=%34movie%34 value=%34http://static.slidesharecdn.com/swf/doc_player.swf?doc=facebookreportfinal-100727110656-phpapp02&amp;stripped_title=the-8-success-criteria-for-facebook-page-marketing%34 /><param name=%34allowFullScreen%34 value=%34true%34 /><param name=%34allowScriptAccess%34 value=%34always%34 /><embed allowfullscreen=%34true%34 allowscriptaccess=%34always%34 flashvars=%34gig_lt=1280258515269&amp;gig_pt=1280258518699&amp;gig_g=2%34 height=%34510%34 name=%34__sse4850455%34 src=%34http://static.slidesharecdn.com/swf/doc_player.swf?doc=facebookreportfinal-100727110656-phpapp02&amp;stripped_title=the-8-success-criteria-for-facebook-page-marketing%34 type=%34application/x-shockwave-flash%34 width=%34477%34></embed> <param name=%34FlashVars%34 value=%34gig_lt=1280258515269&amp;gig_pt=1280258518699&amp;gig_g=2%34 /></object></div>",
				"plainText" :"Today the Altimeter Group published a new report: The 8 Success Criteria for Facebook Page Marketing. Drawing on input from 34 vendors (including Janrain ), agencies and experts, Altimeter defines the golden rules for getting the most out of your Facebook marketing efforts and tests the maturity level of 30 top brands across this criteria. Citing real world examples from the likes of Pampers, Target, Sears and Macys, Altimeter does a nice job of packaging up best practices in this area. The bottom line is that most companies still have a ways to go to fully tap into the marketing engine inside Facebook. Considering that 68% of consumers with a Facebook account say a positive referral from a Facebook friend would make them more likely to buy from or visit a retailer, this is clearly something all marketers need to figure out quickly. On the bright side, it isn't rocket science, and the report includes practical tips and pointers that are relevant to any organization, regardless of size or industry. A final recommendation is to: Connect the Facebook experience with existing efforts, like your corporate website. Customers want to connect to their friends on Facebook and beyond. As you become advanced, you must integrate Facebook features into your corporate website providing opportunities for instant engagement and word of mouth. However, don&rsquo;t foolishly send away your hard-earned traffic to Facebook without a strategy. Instead aggregate Facebook discussions right on your corporate website. Janrain Engage does just that and more &ndash; learn more here. Check out the Altimeter Slideshare presentation here: The 8 Success Criteria For Facebook Page Marketing",
				"date" : "Jul 27, 2010 7:14 AM",
				"images" : 
				[
					"/sites/default/files/altimeter.gif"
				]
			}
		},
		{
			"story" : 
			{
				"title" : "Mapping the Future of the Social Web",
				"link" : "http://www.janrain.com/mapping-future-of-the-social-web",
				"creator" : "Ivan",
				"description" : "<p><em><img alt=%34Federated Social Web Summit%34 src=%34/sites/default/files/fsws.gif%34 style=%34padding-top: 0px; padding-right: 0px; padding-bottom: 20px; padding-left: 20px; float: right; width: 180px; height: 238px; %34 /></em></p> <p><em>Janrain software engineer Ivan Pulleyn attended the <a href=%34http://federatedsocialweb.net/wiki/Federated_Social_Web_Summit_2010%34 target=%34_blank%34>Federated Social Web Summit</a> in Portland, Oregon last week.&nbsp; Below is a recap of Ivan&#39;s experience at the event:</em></p> <p>_____________</p> <p>Imagine you&#39;re backpacking through the mountains in a distant country. You catch the only bus from a small village that is headed toward the coast. The bus is crowded with locals and their luggage, but you coincidentally find yourself seated next to another expatriate like yourself. She&#39;s traveling in the same direction, but planning to head further South. The two of you hit it off and you soon find yourself lost in conversation. Hours later, you suddenly realize you&#39;re at your stop. The bus driver won&#39;t wait; he has a schedule to keep. You have to get off immediately, but you want to continue the conversation. You have a pen and nothing to write on but your arm. What&#39;s the one piece of information you ask for so you have any hope of getting back in touch?</p> <p> This was the thought experiment presented by <a href=%34http://www.crunchbase.com/person/blaine-cook%34 target=%34_blank%34>Blaine Cook</a> at the <a href=%34http://federatedsocialweb.net/wiki/Main_Page%34 target=%34_blank%34>Federated Social Web Summit</a> (FSWS) here in Portland. It&#39;s meant to illustrate a central theme that occupied much of the discussions at the summit: how do people identify each other and share information on the social web? If someone asks me for my contact information, do I give out my cell phone number, my personal email address or my work email address? How about my Twitter handle, or my employer&#39;s URL? Would I give out different information to a friend than to a colleague? Would the information vary if I was overseas rather than home here in Portland? The answers to these questions seem simple on the surface, but once you dig a little deeper, things become more complicated. The social web is imbued with varied and dynamic context and, as such, emerging methodologies, protocols and user experiences must adapt to a new set of challenges.</p> <p> The FSWS was facilitated by the technical team from <a href=%34http://Status.net%34 target=%34_blank%34>Status.net</a> to &quot;to coordinate the development of the federated social web.&quot; It was organized as a one day event preceding <a href=%34http://www.oscon.com/oscon2010%34 target=%34_blank%34>OSCON</a>, with invitations going out to a varied group of technical innovators at companies and academic institutions working on relevant protocols or architectures. I was curious to see how this rather broad agenda would manifest itself given the short amount of time we had together. The day opened with <a href=%34http://status.net/users/evan%34 target=%34_blank%34>Evan Prodromou</a>, Founder of <a href=%34http://Status.net%34 target=%34_blank%34>StatusNet</a>, sketching out a plan for the day. Each group gave a short presentation showing off their work in social federation. By lunch time I had seen presentations from StatusNet, Google, DiSo, Appleseed, Facebook, Diaspora, Six Apart, Mozilla, Microsoft, GNU Social, the Personal Data Store Project and @versionvega, among others. I presented a brief history of <a href=%34http://www.janrain.com%34>Janrain&#39;s</a> involvement in <a href=%34http://openid.net/%34 target=%34_blank%34>OpenID</a> and described some of the challenges we&#39;ve had to overcome in order to support a <a href=%34/solutions/supported-networks%34>large array of social media platforms</a>.</p> <p> The afternoon agenda for the summit was generated democratically, in real-time through the use of <a href=%34http://www.google.com/moderator/%34 target=%34_blank%34>Google Moderator</a>. Participants posted ideas for breakout sessions and we voted the topics up or down. Some common themes bubbled to the top and we eventually chose nine different tracks for detailed discussion. My interest in is protocols, so I attended three of the protocol-related tracks. The discussions centered around two major areas of pain: how to do end-user identifier discovery and how to avoid the problem of <a href=%34http://oauth.net/%34 target=%34_blank%34>OAuth</a> pre-registration. Both need to be solved before a truly open, federated social web can emerge.</p> <p> In the first session, Blaine Cook proposed a method for private <a href=%34http://code.google.com/p/pubsubhubbub/%34 target=%34_blank%34>PubSubHubbub</a> subscriptions using <a href=%34http://code.google.com/p/webfinger/wiki/WebFingerProtocol%34 target=%34_blank%34>WebFinger</a> for discovery and server dialbacks to verify the identity of the subscriber that involved an innovative use of the HTTP From: header. He proceeded to walk through an example of how person A could subscribe to person B&#39;s address book in an open, yet verifiable way, with person B being able to approve or deny access asynchronously. Following that presentation, <a href=%34http://www.google.com/profiles/bslatkin%34 target=%34_blank%34>Brett Slatkin</a> of Google proposed a more complicated version of the same use case, this time using OAuth. Martin Atkins, of Six Apart, presented a third protocol idea, this time where the end-user approves a domain for access rather than another user. This was followed by a presentation on distributed comments using <a href=%34http://www.salmon-protocol.org/%34 target=%34_blank%34>Salmon Protocol</a> by Joseph Smarr of Google. Other participants included Maxwell Salzberg of Diaspora, David Recordon of Facebook, Rob Dolin of Miscrosoft and Bear of XMPP fame.</p> <p> At the close of the day, we reconvened and Evan proposed a challenge to the group. Dave Recordon had recommended a simple social federation use case and we decided to call it the <a href=%34http://federatedsocialweb.net/wiki/SWAT0%34 target=%34_blank%34>Social Web Acid Test, level 0</a> -- SWAT0 for short. The challenge is &quot;to have as many discrete pairs of implementations pass the test by September 30, 2010.&quot; SWAT0 is a simple use case that has been implemented many times by proprietary social networks: two users sharing and tagging photos. The real challenge is to build this in a truly open, federated manner. I strongly encourage those with interest in the technical aspects of the social web participate in this effort by <a href=%34http://groups.google.com/group/federated-social-web?pli=1%34 target=%34_blank%34>joining the mailing list</a> or even building independent implementations. As FSWS closed, we enjoyed a demo of <a href=%34http://www.joindiaspora.com/%34 target=%34_blank%34>Diaspora</a> in action, followed by drinks and conversation at a local venue. I left feeling inspired to participate in this emergent collaboration.</p> <p> Now back to our thought experiment: As you watch the bus pull away, a cloud of dust settles onto the dirt road. The sun is beating down on you as you struggle with your overstuffed backpack. You look down at your arm. What&#39;s written there?</p> <p> <strong>More Info:</strong></p> <ul> <li><a href=%34http://status.net/2010/07/21/federated-social-web-summit-wrapup%34 target=%34_blank%34>Evan Prodromou&#39;s Wrap-up of FSWS</a></li> <li><a href=%34http://federatedsocialweb.net/wiki/Main_Page%34 target=%34_blank%34>Federated Social Web wiki</a></li> <li><a href=%34http://federatedsocialweb.net/wiki/SWAT0%34 target=%34_blank%34>FSWS SWAT0</a></li> <li><a href=%34https://docs.google.com/document/pub?id=1HrVmSCQM2r5bCnQk5uZPbhH0sGVHHFOGhxJ0thoKEO8&amp;embedded=true%34 target=%34_blank%34>John Panzer and Brett Slatkin&#39;s PubSubHubbub for Private feeds</a></li> <li><a href=%34http://code.google.com/p/webfinger/wiki/WebFingerProtocol%34 target=%34_blank%34>WebFinger Protocol</a><br /> &nbsp;</li> </ul>",
				"plainText" :"Janrain software engineer Ivan Pulleyn attended the Federated Social Web Summit in Portland, Oregon last week. Below is a recap of Ivan's experience at the event: _____________ Imagine you're backpacking through the mountains in a distant country. You catch the only bus from a small village that is headed toward the coast. The bus is crowded with locals and their luggage, but you coincidentally find yourself seated next to another expatriate like yourself. She's traveling in the same direction, but planning to head further South. The two of you hit it off and you soon find yourself lost in conversation. Hours later, you suddenly realize you're at your stop. The bus driver won't wait; he has a schedule to keep. You have to get off immediately, but you want to continue the conversation. You have a pen and nothing to write on but your arm. What's the one piece of information you ask for so you have any hope of getting back in touch? This was the thought experiment presented by Blaine Cook at the Federated Social Web Summit (FSWS) here in Portland. It's meant to illustrate a central theme that occupied much of the discussions at the summit: how do people identify each other and share information on the social web? If someone asks me for my contact information, do I give out my cell phone number, my personal email address or my work email address? How about my Twitter handle, or my employer's URL? Would I give out different information to a friend than to a colleague? Would the information vary if I was overseas rather than home here in Portland? The answers to these questions seem simple on the surface, but once you dig a little deeper, things become more complicated. The social web is imbued with varied and dynamic context and, as such, emerging methodologies, protocols and user experiences must adapt to a new set of challenges. The FSWS was facilitated by the technical team from Status.net to &quot;to coordinate the development of the federated social web.&quot; It was organized as a one day event preceding OSCON, with invitations going out to a varied group of technical innovators at companies and academic institutions working on relevant protocols or architectures. I was curious to see how this rather broad agenda would manifest itself given the short amount of time we had together. The day opened with Evan Prodromou, Founder of StatusNet, sketching out a plan for the day. Each group gave a short presentation showing off their work in social federation. By lunch time I had seen presentations from StatusNet, Google, DiSo, Appleseed, Facebook, Diaspora, Six Apart, Mozilla, Microsoft, GNU Social, the Personal Data Store Project and @versionvega, among others. I presented a brief history of Janrain's involvement in OpenID and described some of the challenges we've had to overcome in order to support a large array of social media platforms. The afternoon agenda for the summit was generated democratically, in real-time through the use of Google Moderator. Participants posted ideas for breakout sessions and we voted the topics up or down. Some common themes bubbled to the top and we eventually chose nine different tracks for detailed discussion. My interest in is protocols, so I attended three of the protocol-related tracks. The discussions centered around two major areas of pain: how to do end-user identifier discovery and how to avoid the problem of OAuth pre-registration. Both need to be solved before a truly open, federated social web can emerge. In the first session, Blaine Cook proposed a method for private PubSubHubbub subscriptions using WebFinger for discovery and server dialbacks to verify the identity of the subscriber that involved an innovative use of the HTTP From: header. He proceeded to walk through an example of how person A could subscribe to person B's address book in an open, yet verifiable way, with person B being able to approve or deny access asynchronously. Following that presentation, Brett Slatkin of Google proposed a more complicated version of the same use case, this time using OAuth. Martin Atkins, of Six Apart, presented a third protocol idea, this time where the end-user approves a domain for access rather than another user. This was followed by a presentation on distributed comments using Salmon Protocol by Joseph Smarr of Google. Other participants included Maxwell Salzberg of Diaspora, David Recordon of Facebook, Rob Dolin of Miscrosoft and Bear of XMPP fame. At the close of the day, we reconvened and Evan proposed a challenge to the group. Dave Recordon had recommended a simple social federation use case and we decided to call it the Social Web Acid Test, level 0 -- SWAT0 for short. The challenge is &quot;to have as many discrete pairs of implementations pass the test by September 30, 2010.&quot; SWAT0 is a simple use case that has been implemented many times by proprietary social networks: two users sharing and tagging photos. The real challenge is to build this in a truly open, federated manner. I strongly encourage those with interest in the technical aspects of the social web participate in this effort by joining the mailing list or even building independent implementations. As FSWS closed, we enjoyed a demo of Diaspora in action, followed by drinks and conversation at a local venue. I left feeling inspired to participate in this emergent collaboration. Now back to our thought experiment: As you watch the bus pull away, a cloud of dust settles onto the dirt road. The sun is beating down on you as you struggle with your overstuffed backpack. You look down at your arm. What's written there? More Info: Evan Prodromou's Wrap-up of FSWS Federated Social Web wiki FSWS SWAT0 John Panzer and Brett Slatkin's PubSubHubbub for Private feeds WebFinger Protocol",
				"date" : "Jul 26, 2010 11:34 AM",
				"images" : 
				[
					"/sites/default/files/fsws.gif"
				]
			}
		},
		{
			"story" : 
			{
				"title" : "How Interscope Records Improves Customer Acquisition with Janrain Solutions",
				"link" : "http://www.janrain.com/blogs/how-interscope-records-improves-customer-acquisition-janrain-solutions",
				"creator" : "Michael Olson",
				"description" : "<p>Yesterday at the <a href=%34http://www.cloudidentitysummit.com/%34 target=%34_blank%34>Cloud Identity Summit</a> in Denver, Colorado, Lee Hammond from <a href=%34http://www.interscope.com%34 target=%34_blank%34>Interscope Geffen A&amp;M Records</a> (a division of Universal Music Group), and Brian Kissel, CEO of <a href=%34http://www.janrain.com%34>Janrain</a>, spoke jointly about the use of social media tools to improve customer acquisition and retainment. Hammond shared Interscope&#39;s experience to achieve these goals, beginning with a native OpenID implementation and resulting in a relationship with <a href=%34http://www.janrain.com%34>Janrain</a>.</p> <p>Beginning in 2007, Interscope Records began accepting AOL identities for login on its 125 music artist websites through an in-house implementation of OpenID. Below is a screenshot of Interscope&#39;s third-party login system on Eve.com in 2007:</p> <p><img alt=%34Eve.com's old login process%34 src=%34/sites/default/files/interscope-1_1.JPG%34 style=%34width: 280px; height: 149px;%34 /></p> <p> And on another site:</p> <p><img alt=%34rooney%34 src=%34/sites/default/files/interscope-2_0.JPG%34 style=%34width: 280px; height: 179px;%34 /></p> <p> By 2008, with additional social networks (such as Facebook, Google and MySpace) becoming available for login, Interscope sought to leverage the new identity providers, make the user experience more intuitive, and minimize the challenge of scaling and maintaining the system.</p> <p>Interscope turned to <a href=%34/products/engage%34>Janrain Engage</a> in late 2008. Choosing Janrain has enabled Interscope to <strong>instantly leverage additional social networks</strong> (such as Twitter and Windows Live) as they become available and outsource maintenance of the disparate APIs from each network.</p> <p>The result? <strong>55% of all logins across 125 music artist sites occur through <a href=%34/products/engage%34>Janrain Engage</a></strong>, with that percentage as high as <a href=%34http://www.readwriteweb.com/cloud/2010/02/lady-gaga-facebook-login-twitter.php%34 target=%34_blank%34><strong>89% on sites like LadyGaga.com</strong></a>. Overall <strong>registration rates on all artist sites have improved by 10%</strong>, in part due to the intuitive user interface provided by <a href=%34/products/engage%34>Janrain Engage</a>:</p> <p><img alt=%34lady gaga%34 src=%34/sites/default/files/interscope-3_0.JPG%34 style=%34width: 280px; height: 221px;%34 /></p> <p>&nbsp;</p> <p>Here are slides from the presentation at Cloud Identity Summit:</p> <div id=%34__ss_4817856%34 style=%34width: 425px;%34><strong style=%34margin: 12px 0pt 4px; display: block;%34><a href=%34http://www.slideshare.net/lhannah/janrain-and-interscope-records-cloud-identity-summit-presentation-july-2010%34 title=%34Janrain and Interscope Records Cloud Identity Summit presentation July 2010%34>Janrain and Interscope Records Cloud Identity Summit presentation July 2010</a></strong> <object height=%34355%34 id=%34__sse4817856%34 width=%34425%34><param name=%34movie%34 value=%34http://static.slidesharecdn.com/swf/ssplayer2.swf?doc=janrainandinterscoperecordscloudidentitysummitpresentationjuly2010-100722130945-phpapp02&amp;stripped_title=janrain-and-interscope-records-cloud-identity-summit-presentation-july-2010%34 /><param name=%34allowFullScreen%34 value=%34true%34 /><param name=%34allowScriptAccess%34 value=%34always%34 /><embed allowfullscreen=%34true%34 allowscriptaccess=%34always%34 height=%34355%34 name=%34__sse4817856%34 src=%34http://static.slidesharecdn.com/swf/ssplayer2.swf?doc=janrainandinterscoperecordscloudidentitysummitpresentationjuly2010-100722130945-phpapp02&amp;stripped_title=janrain-and-interscope-records-cloud-identity-summit-presentation-july-2010%34 type=%34application/x-shockwave-flash%34 width=%34425%34></embed></object></div> <p><a href=%34/sites/default/files/Success-Story_IGA.pdf%34 onclick=%34gaTrack(this, '/downloads/Success-Story_IGA');%34><br /> Click here</a> to read more about Interscope&#39;s success with <a href=%34/products/engage%34>Janrain Engage</a>.</p>",
				"plainText" :"Yesterday at the Cloud Identity Summit in Denver, Colorado, Lee Hammond from Interscope Geffen A&M Records (a division of Universal Music Group), and Brian Kissel, CEO of Janrain, spoke jointly about the use of social media tools to improve customer acquisition and retainment. Hammond shared Interscope's experience to achieve these goals, beginning with a native OpenID implementation and resulting in a relationship with Janrain. Beginning in 2007, Interscope Records began accepting AOL identities for login on its 125 music artist websites through an in-house implementation of OpenID. Below is a screenshot of Interscope's third-party login system on Eve.com in 2007: And on another site: By 2008, with additional social networks (such as Facebook, Google and MySpace) becoming available for login, Interscope sought to leverage the new identity providers, make the user experience more intuitive, and minimize the challenge of scaling and maintaining the system. Interscope turned to Janrain Engage in late 2008. Choosing Janrain has enabled Interscope to instantly leverage additional social networks (such as Twitter and Windows Live) as they become available and outsource maintenance of the disparate APIs from each network. The result? 55% of all logins across 125 music artist sites occur through Janrain Engage, with that percentage as high as 89% on sites like LadyGaga.com. Overall registration rates on all artist sites have improved by 10%, in part due to the intuitive user interface provided by Janrain Engage : Here are slides from the presentation at Cloud Identity Summit: Janrain and Interscope Records Cloud Identity Summit presentation July 2010 Click here to read more about Interscope's success with Janrain Engage.",
				"date" : "Jul 22, 2010 9:24 AM",
				"images" : 
				[
					"/sites/default/files/interscope-1_1.JPG",
					"/sites/default/files/interscope-2_0.JPG",
					"/sites/default/files/interscope-3_0.JPG"
				]
			}
		},
		{
			"story" : 
			{
				"title" : "Tutorial on Janrain Engage Wordpress Plugin",
				"link" : "http://www.janrain.com/blogs/tutorial-janrain-engage-wordpress-plugin",
				"creator" : "Michael Olson",
				"description" : "<p><a href=%34http://teachmewp.com%34>TeachMeWP.com</a>, an excellent resource for WordPress developers, <a href=%34http://teachmewp.com/2010/06/28/044-janrain-rpxengage-single-signon-for-openid-twitter-facebook-and-other/%34>recently published a video tutorial</a> on how to configure the <a href=%34http://wordpress.org/extend/plugins/rpx%34>Janrain Engage WordPress plug-in</a>. TeachMeWP.com regularly posts valuable tips and video tutorials for WordPress developers, and this video provides a step-by-step guide to implement the Janrain Engage plug-in for WordPress.</p> <p>The plug-in can be easily installed on a WordPress site or blog in minutes with no coding required.&nbsp; Check it out the <a href=%34http://wordpress.org/extend/plugins/rpx/%34 target=%34_blank%34>Janrain Engage Wordpress Plugin</a> and let us know what you think.</p> <p><embed allowfullscreen=%34true%34 allowscriptaccess=%34always%34 height=%34300%34 src=%34http://blip.tv/play/g9QLgen_EQI%34 type=%34application/x-shockwave-flash%34 width=%34480%34></embed></p>",
				"plainText" :"TeachMeWP.com, an excellent resource for WordPress developers, recently published a video tutorial on how to configure the Janrain Engage WordPress plug-in. TeachMeWP.com regularly posts valuable tips and video tutorials for WordPress developers, and this video provides a step-by-step guide to implement the Janrain Engage plug-in for WordPress. The plug-in can be easily installed on a WordPress site or blog in minutes with no coding required.Check it out the Janrain Engage Wordpress Plugin and let us know what you think.",
				"date" : "Jul 20, 2010 12:30 PM"
			}
		},
		{
			"story" : 
			{
				"title" : "Update on OpenID and OAuth Security",
				"link" : "http://www.janrain.com/blogs/update-openid-and-oauth-security",
				"creator" : "ldrebes",
				"description" : "<p style=%34padding: 15px; background: rgb(238, 238, 238) none repeat scroll 0% 0%; -moz-background-clip: -moz-initial; -moz-background-origin: -moz-initial; -moz-background-inline-policy: -moz-initial;%34><em><strong>Update:</strong> </em>In our ongoing effort to support the <a href=%34http://openid.net%34 target=%34_blank%34>OpenID</a> standard and ensure its widespread use and adoption through the web, Janrain has patched the PHP, Ruby and Python open source OpenID libraries. <a href=%34/products/engage%34>Janrain Engage</a> and <a href=%34/products/federate%34>Janrain Federate</a> have also been updated to eliminate any non-constant time comparisons. These patches were developed and applied in response to the proposed timing attack vulnerabilities. Although no successful security breaches have been reported, the code changes made in these libraries will prevent any future attempts using this particular attack vector.&nbsp; Janrain is happy to provide this support back to the open source community for its continued success and prosperity.</p> <p> A few posts and online articles were published late last week about a potential &ldquo;timing attack&rdquo; security issue with OpenID and OAuth. We&#39;d like to provide a quick communication update.<br /> &nbsp;<br /> The reported issue is not a flaw in OpenID or OAuth at a protocol level, but rather the manner that some of the libraries have been implemented. After evaluating the hypothetical attack scenarios in the past week,&nbsp; we have deemed the probability of a viable exploit to be very low, to non existent.&nbsp; In communications with our partners and peers in the community, they have reached the same conclusion.<br /> &nbsp;<br /> Nonetheless, it seems prudent to remove this as a potential vector. We will be updating the <a href=%34/products/engage%34>Janrain Engage</a> and <a href=%34/products/federate%34>Federate</a> production versions this week to eliminate any non-constant time comparisons. Our customers and end-users will not need to do anything additional, the upgraded service will function with complete compatibility.<br /> &nbsp;<br /> In addition to further auditing our <a href=%34/products/engage%34>Janrain Engage</a> and <a href=%34/products/federate%34>Janrain Federate</a> product offerings, we will be patching the open source python and ruby libraries that we have contributed to in the past.&nbsp;</p> <div>We hope that this communication addresses any security concerns you might have had as well as answers any questions about Janrain&#39;s commitment to your application security. Rest assured that we are diligently monitoring any possible security issues and aggressively responding as necessary.</div> <div> _______</div> <div>&nbsp;</div> <div>Larry Drebes<br /> CTO</div>",
				"plainText" :"Update: In our ongoing effort to support the OpenID standard and ensure its widespread use and adoption through the web, Janrain has patched the PHP, Ruby and Python open source OpenID libraries. Janrain Engage and Janrain Federate have also been updated to eliminate any non-constant time comparisons. These patches were developed and applied in response to the proposed timing attack vulnerabilities. Although no successful security breaches have been reported, the code changes made in these libraries will prevent any future attempts using this particular attack vector.Janrain is happy to provide this support back to the open source community for its continued success and prosperity. A few posts and online articles were published late last week about a potential &ldquo;timing attack&rdquo; security issue with OpenID and OAuth. We'd like to provide a quick communication update. The reported issue is not a flaw in OpenID or OAuth at a protocol level, but rather the manner that some of the libraries have been implemented. After evaluating the hypothetical attack scenarios in the past week,we have deemed the probability of a viable exploit to be very low, to non existent.In communications with our partners and peers in the community, they have reached the same conclusion. Nonetheless, it seems prudent to remove this as a potential vector. We will be updating the Janrain Engage and Federate production versions this week to eliminate any non-constant time comparisons. Our customers and end-users will not need to do anything additional, the upgraded service will function with complete compatibility. In addition to further auditing our Janrain Engage and Janrain Federate product offerings, we will be patching the open source python and ruby libraries that we have contributed to in the past.We hope that this communication addresses any security concerns you might have had as well as answers any questions about Janrain's commitment to your application security. Rest assured that we are diligently monitoring any possible security issues and aggressively responding as necessary. _______ Larry Drebes CTO",
				"date" : "Jul 19, 2010 2:26 AM"
			}
		},
		{
			"story" : 
			{
				"title" : "Leveraging the Social Networks on Political Campaign Websites",
				"link" : "http://www.janrain.com/blogs/leveraging-social-networks-political-campaign-websites",
				"creator" : "Michael Olson",
				"description" : "<p>As we gear up for another election season, political candidates have an opportunity to leverage the social networks of their constituents to grow their supporter base and spread their campaign message.</p> <p><a href=%34http://www.voterobalexander.com/%34 target=%34_blank%34>Rob Alexander</a>, a candidate for State Representative in Utah, is making the sign-up process simple by enabling supporters on his site to quickly register using their existing social network or email accounts from Facebook, Twitter, Google and Yahoo!. <a href=%34/products/engage%34>Janrain Engage</a> powers this functionality.</p> <p><img alt=%34%34 src=%34/../../sites/default/files/rob-alexander_0.JPG%34 style=%34width: 280px; height: 163px;%34 /></p> <p>&nbsp;</p> <p>As political candidates strive to discover ways to engage online with constituents beyond mailing lists, Rob Alexander&#39;s site provides a good template for how to build a vibrant online community in this space.&nbsp; Once registered, members can create and maintain a personal profile on the site with their demographic information and profile photo pre-populated from a preferred social network.</p> <p><img alt=%34%34 src=%34/sites/default/files/rob-alexander2.JPG%34 style=%34width: 280px; height: 187px;%34 /></p> <p>Members can also participate in discussion board forums to debate issues relevant to the campaign, and create and vote in polls.</p> <p>As the Obama campaign proved in 2008, <a href=%34http://latimesblogs.latimes.com/technology/2008/11/obama-the-first.html%34 target=%34_blank%34>investment in social media technologies can help proliferate a candidate&#39;s message</a> to the public and build loyalty among supporters. Candidates can create an online community that facilitates increased membership and engagement by leveraging the social network accounts of their supporters.</p>",
				"plainText" :"As we gear up for another election season, political candidates have an opportunity to leverage the social networks of their constituents to grow their supporter base and spread their campaign message. Rob Alexander, a candidate for State Representative in Utah, is making the sign-up process simple by enabling supporters on his site to quickly register using their existing social network or email accounts from Facebook, Twitter, Google and Yahoo!. Janrain Engage powers this functionality. As political candidates strive to discover ways to engage online with constituents beyond mailing lists, Rob Alexander's site provides a good template for how to build a vibrant online community in this space.Once registered, members can create and maintain a personal profile on the site with their demographic information and profile photo pre-populated from a preferred social network. Members can also participate in discussion board forums to debate issues relevant to the campaign, and create and vote in polls. As the Obama campaign proved in 2008, investment in social media technologies can help proliferate a candidate's message to the public and build loyalty among supporters. Candidates can create an online community that facilitates increased membership and engagement by leveraging the social network accounts of their supporters.",
				"date" : "Jul 16, 2010 11:12 AM",
				"images" : 
				[
					"/../../sites/default/files/rob-alexander_0.JPG",
					"/sites/default/files/rob-alexander2.JPG"
				]
			}
		},
		{
			"story" : 
			{
				"title" : "Join us for Lunch 2.0 at Janrain",
				"link" : "http://www.janrain.com/blogs/join-us-lunch-20-janrain",
				"creator" : "Michael Olson",
				"description" : "<p>Tomorrow, we are hosting July&#39;s <a href=%34http://siliconflorist.com/2010/07/12/reminder-lunch-20-janrain-wednesday/%34 target=%34_blank%34>Lunch 2.0 event</a> in Portland, Oregon.&nbsp; Lunch 2.0 is a great technology-focused networking event that has become a highly anticipated meet and greet each month since it was introduced to Portland in February 2008.&nbsp;</p> <p><a href=%34/company/management-team%34>Brian Kissel</a>, our CEO, will share a few words about how large brands are utilizing <a href=%34http://www.janrain.com%34>Janrain&#39;s</a> solutions to optimize their online presence, and the entire Janrain team will be on hand to mingle.&nbsp; All are welcome to attend, and food and drinks will be provided.&nbsp; Please <a href=%34http://upcoming.yahoo.com/event/5833861/OR/Portland/Lunch-20-at-JanRain/JanRain/%34 target=%34_blank%34>RSVP on Upcoming</a> if you plan to make it.&nbsp; We hope to see many of you tomorrow!</p>",
				"plainText" :"Tomorrow, we are hosting July's Lunch 2.0 event in Portland, Oregon.Lunch 2.0 is a great technology-focused networking event that has become a highly anticipated meet and greet each month since it was introduced to Portland in February 2008.Brian Kissel, our CEO, will share a few words about how large brands are utilizing Janrain's solutions to optimize their online presence, and the entire Janrain team will be on hand to mingle.All are welcome to attend, and food and drinks will be provided.Please RSVP on Upcoming if you plan to make it.We hope to see many of you tomorrow!",
				"date" : "Jul 13, 2010 9:07 AM"
			}
		},
		{
			"story" : 
			{
				"title" : "Tribune Interactive Gets Creative with Beautiful Babies Contest",
				"link" : "http://www.janrain.com/blogs/tribune-interactive-gets-creative-beautiful-babies-contest",
				"creator" : "Michael Olson",
				"description" : "<p><a href=%34http://www.tribuneinteractive.com/%34>Tribune Interactive</a> recently began a <a href=%34http://tribunepromotions.com/babies/%34 target=%34_blank%34>contest to uncover the most beautiful baby</a> in the U.S.&nbsp; The Tribune is fostering wide participation by allowing visitors to media websites in local markets (such as <a href=%34http://www.chicagotribune.com/%34 target=%34_blank%34>The Chicago Tribune</a>, <a href=%34http://www.latimes.com/%34 target=%34_blank%34>LA Times</a>, <a href=%34http://www.baltimoresun.com/%34 target=%34_blank%34>Baltimore Sun</a>, and <a href=%34http://www.orlandosentinel.com/%34 target=%34_blank%34>Orlando Sentinel</a>) to register on the site and vote for their favorite babies.&nbsp; The parents of the most chic child, as voted upon by fans across the U.S. until the end of July, will win $5,000.</p> <p>The company is facilitating fan engagement by leveraging the social network and email accounts of its visitors during the sign up process, in this case through the implementation of <a href=%34/../../products/engage%34>Janrain Enage</a>.</p> <p style=%34text-align: center;%34><img alt=%34%34 src=%34/sites/default/files/chicago-tribune-2.JPG%34 style=%34width: 280px; height: 218px;%34 /></p> <p>Tribune Interactive&#39;s promotion is another example of how removing barriers to registration can yield sharp improvements in customer engagement.&nbsp; In late 2008, rock band AFI <a href=%34/../../blogs/openid-case-study-afi-begin-transmission-project%34>launched a contest</a> to allow users to submit and vote for fan-generated audition videos, with the winner invited to perform on the band&#39;s then upcoming album.&nbsp; The contest drew great interest from the band&#39;s fanbase, and by leveraging <a href=%34/products/engage%34>Janrain Engage</a>, AFI made it easy for fans to sign up on the site, submit videos and vote for their favorite fan auditions.</p> <p>Tribune Interactive has encouraged broad participation by removing the registration hassle and enabling visitors to sign up on the site with an existing social network or email account.&nbsp; We will stay tuned to see who America crowns as its most beautiful baby.</p>",
				"plainText" :"Tribune Interactive recently began a contest to uncover the most beautiful baby in the U.S.The Tribune is fostering wide participation by allowing visitors to media websites in local markets (such as The Chicago Tribune, LA Times, Baltimore Sun, and Orlando Sentinel ) to register on the site and vote for their favorite babies.The parents of the most chic child, as voted upon by fans across the U.S. until the end of July, will win $5,000. The company is facilitating fan engagement by leveraging the social network and email accounts of its visitors during the sign up process, in this case through the implementation of Janrain Enage. Tribune Interactive's promotion is another example of how removing barriers to registration can yield sharp improvements in customer engagement.In late 2008, rock band AFI launched a contest to allow users to submit and vote for fan-generated audition videos, with the winner invited to perform on the band's then upcoming album.The contest drew great interest from the band's fanbase, and by leveraging Janrain Engage, AFI made it easy for fans to sign up on the site, submit videos and vote for their favorite fan auditions. Tribune Interactive has encouraged broad participation by removing the registration hassle and enabling visitors to sign up on the site with an existing social network or email account.We will stay tuned to see who America crowns as its most beautiful baby.",
				"date" : "Jun 30, 2010 4:41 AM",
				"images" : 
				[
					"/sites/default/files/chicago-tribune-2.JPG"
				]
			}
		},
		{
			"story" : 
			{
				"title" : "Janrain Participates in Windows Live Messenger Connect Beta",
				"link" : "http://www.janrain.com/blogs/janrain-participates-windows-live-messenger-connect-beta",
				"creator" : "Vidya Shivkumar",
				"description" : "<p><img alt=%34Windows Live Connect%34 src=%34/sites/default/files/Windows_Live_Messenger_Logo.png%34 style=%34padding-top: 0px; padding-right: 0px; padding-bottom: 20px; padding-left: 20px; float: right; width: 180px; height: 157px; %34 />Today, Microsoft formally announced the&nbsp;<a href=%34/%34 style=%34color: rgb(0, 157, 220); text-decoration: none; %34 target=%34_blank%34>Windows Live Messenger Connect beta</a>. Messenger Connect is a single API that provides access to a user&rsquo;s Activities, Calendars, Contacts, Profiles, and photos stored in&nbsp;<a href=%34/%34 style=%34color: rgb(0, 157, 220); text-decoration: none; %34 target=%34_blank%34>Windows Live SkyDrive</a>.</p> <p>For&nbsp;<a href=%34/%34 style=%34color: rgb(0, 157, 220); text-decoration: none; %34>Janrain Engage</a>&nbsp;customers this means any user who logs into your website with a Windows Live ID is able to invite their friends to your site and&nbsp;<a href=%34http://windowsteamblog.com/windows_live/b/developer/archive/2010/06/28/social-distribution.aspx%34 style=%34color: rgb(0, 157, 220); text-decoration: none; %34 target=%34_blank%34>publish their activities on your site back to the Windows Live Messenger chat client</a>.&nbsp; Messenger Connect also enables websites to read and write to a user&rsquo;s activity feed. An activity feed could be uploading a photo, befriending someone, posting a video, updating a status message etc. When your website displays those activities performed by a user&rsquo;s friends on your site and filters out the rest, the experience is much more relevant and personal to the end user, which can result in the average time spent by the user on your website going up.</p> <p> Rather than launch a new social networking service, Microsoft chose to make Messenger complement the world&rsquo;s most popular social networks. It is not hard to see why. Messenger has a global user base of over 320 million and its users spend approximately 9% of total Internet minutes worldwide. This is a large and captive online user base. Recently, Microsoft also announced that the new Messenger will allow users to see what their contacts across other social networks like Facebook, LinkedIn and MySpace are doing. This is a step in the right direction. The increasing user-centric nature of social networks is leading to more open online communities across the Internet. Rather than create more islands of users, it is nice to see networks building bridges between the silos that already exist.</p> <p> <a href=%34http://www.janrain.com%34>Janrain</a> enjoys a close <a href=%34/partners/provider-partners#microsoft%34>partnership with Microsoft</a> and has had the opportunity to participate in the Messenger Connect early adoption program. We will launch support for Messenger Connect publishing in July and a deeper integration with activity feeds later this year. As always, our goal is to bring new and innovative solutions to our customers that are easy to deploy and provide a more engaging user experience.</p>",
				"plainText" :"Today, Microsoft formally announced theWindows Live Messenger Connect beta. Messenger Connect is a single API that provides access to a user's Activities, Calendars, Contacts, Profiles, and photos stored inWindows Live SkyDrive. ForJanrain Engagecustomers this means any user who logs into your website with a Windows Live ID is able to invite their friends to your site andpublish their activities on your site back to the Windows Live Messenger chat client.Messenger Connect also enables websites to read and write to a user's activity feed. An activity feed could be uploading a photo, befriending someone, posting a video, updating a status message etc. When your website displays those activities performed by a user's friends on your site and filters out the rest, the experience is much more relevant and personal to the end user, which can result in the average time spent by the user on your website going up. Rather than launch a new social networking service, Microsoft chose to make Messenger complement the world's most popular social networks. It is not hard to see why. Messenger has a global user base of over 320 million and its users spend approximately 9% of total Internet minutes worldwide. This is a large and captive online user base. Recently, Microsoft also announced that the new Messenger will allow users to see what their contacts across other social networks like Facebook, LinkedIn and MySpace are doing. This is a step in the right direction. The increasing user-centric nature of social networks is leading to more open online communities across the Internet. Rather than create more islands of users, it is nice to see networks building bridges between the silos that already exist. Janrain enjoys a close partnership with Microsoft and has had the opportunity to participate in the Messenger Connect early adoption program. We will launch support for Messenger Connect publishing in July and a deeper integration with activity feeds later this year. As always, our goal is to bring new and innovative solutions to our customers that are easy to deploy and provide a more engaging user experience.",
				"date" : "Jun 28, 2010 5:58 AM",
				"images" : 
				[
					"/sites/default/files/Windows_Live_Messenger_Logo.png"
				]
			}
		},
		{
			"story" : 
			{
				"title" : "NPR Deploys Janrain Engage To Make It Easier for Users to Login",
				"link" : "http://www.janrain.com/blogs/npr-deploys-janrain-engage-make-it-easier-users-login",
				"creator" : "Michael Olson",
				"description" : "<p>Today, <a href=%34http://www.npr.org%34 target=%34_blank%34>National Public Radio</a> (NPR) <a href=%34http://www.npr.org/blogs/inside/2010/06/24/128079309/using-your-social-networking-accounts-to-log-into-npr-org%34 target=%34_blank%34>began accepting social network accounts</a> with Janrain Engage to make it easy for its users to participate on the site by posting comments on articles and signing up for newsletters.&nbsp; Visitors to the NPR website can now quickly register and login using their existing accounts with Facebook, Google, Twitter, Yahoo!, LinkedIn or OpenID.</p> <p>&nbsp;<img alt=%34%34 src=%34/sites/default/files/npr.JPG%34 style=%34width: 280px; height: 158px;%34 /></p> <p>The integration of Janrain Engage allows NPR users to register within two clicks, pre-populate a name and email address with profile information from their preferred network, and sign-up for newsletters and other permission-based marketing programs offered by NPR.</p> <p>NPR selected Janrain Engage for its rich features and ease of implementation, which nicely complemented the organization&#39;s agile development process.&nbsp; We&#39;re excited to see <a href=%34/blogs/media-companies-optimizing-user-registration-engagement-0%34>another major media organization</a> leverage the existing social network and email accounts of its audience to improve registration rates and facilitate greater engagement.</p>",
				"plainText" :"Today, National Public Radio (NPR) began accepting social network accounts with Janrain Engage to make it easy for its users to participate on the site by posting comments on articles and signing up for newsletters.Visitors to the NPR website can now quickly register and login using their existing accounts with Facebook, Google, Twitter, Yahoo!, LinkedIn or OpenID. The integration of Janrain Engage allows NPR users to register within two clicks, pre-populate a name and email address with profile information from their preferred network, and sign-up for newsletters and other permission-based marketing programs offered by NPR. NPR selected Janrain Engage for its rich features and ease of implementation, which nicely complemented the organization's agile development process.We're excited to see another major media organization leverage the existing social network and email accounts of its audience to improve registration rates and facilitate greater engagement.",
				"date" : "Jun 24, 2010 4:29 AM",
				"images" : 
				[
					"/sites/default/files/npr.JPG"
				]
			}
		},
		{
			"story" : 
			{
				"title" : "Janrain Engage for the iPhone",
				"link" : "http://www.janrain.com/blogs/janrain-engage-iphone",
				"creator" : "Michael Olson",
				"description" : "<p>Internet users increasingly are accessing their favorite web applications through mobile phones.&nbsp; As developers and publishers of iPhone applications, you can tap into this growing market by providing an easy way for your consumers to login to your apps using popular social networking or email accounts.</p> <p>A few months ago we launched a beta program for Janrain Engage (formerly RPX) for the iPhone.&nbsp; Thank you to our many customers who participated in the program and provided valuable feedback. <strong>Today we are excited to announce the production availability of Janrain Engage for the iPhone: a native iPhone library to allow developers to quickly add 3rd party authentication to their iPhone app.</strong></p> <p>Starting today, developers may preserve the native iPhone application experience without the challenge of implementing complex third party logins.&nbsp;</p> <p>If you are an existing Janrain Engage Basic, Plus or Pro customer, you have immediate access to the libraries through your Janrain Engage dashboard. Please select iPhone library from the dropdown menu in the Sign-in area of the dashboard, and you will have all the information you need to get started.</p> <p>If you would like to see how the application works, try out <a href=%34http://itunes.apple.com/us/app/quick-sign-in/id375197510%34>Janrain Quick Sign-in</a>, our demo app listed on the Apple App Store.</p> <p><strong>Some key features and benefits</strong>:</p> <ul> <li>Companies and websites that offer an application for the iPhone can now use Janrain Engage for the iPhone to enable quick registration and login via Facebook, Google, Twitter, Yahoo!, LinkedIn and up to 11 additional identity providers.</li> <li>Janrain Engage for the iPhone maintains the look and feel of the iPhone SDK and enables websites to authenticate their users through iPhone&#39;s native UI Kit as opposed to launching a web browser for user sign in.</li> <li>Users can browse configured providers from a single-column table view, as opposed to the application&#39;s two-column view, which helps maximize the real estate of the iPhone screen.</li> <li>Janrain Engage remembers the user&#39;s preferred provider on return visits, to help ensure a positive and intuitive return user experience.</li> <li>Janrain Engage for the iPhone includes the same key features as the browser based version of the product.</li> <li>Developers can customize the number of identity providers displayed and the order in which they appear via the Janrain Engage dashboard.</li> </ul> <p style=%34text-align: center%34><img alt=%34%34 src=%34http://www.janrain.com/sites/default/files/iphone.png%34 /></p> <p>As always, <strong>we welcome your feedback</strong> and are excited to extend the benefits of Janrain Engage to our customers that are active in the mobile space.</p>",
				"plainText" :"Internet users increasingly are accessing their favorite web applications through mobile phones.As developers and publishers of iPhone applications, you can tap into this growing market by providing an easy way for your consumers to login to your apps using popular social networking or email accounts. A few months ago we launched a beta program for Janrain Engage (formerly RPX) for the iPhone.Thank you to our many customers who participated in the program and provided valuable feedback. Today we are excited to announce the production availability of Janrain Engage for the iPhone: a native iPhone library to allow developers to quickly add 3rd party authentication to their iPhone app. Starting today, developers may preserve the native iPhone application experience without the challenge of implementing complex third party logins.If you are an existing Janrain Engage Basic, Plus or Pro customer, you have immediate access to the libraries through your Janrain Engage dashboard. Please select iPhone library from the dropdown menu in the Sign-in area of the dashboard, and you will have all the information you need to get started. If you would like to see how the application works, try out Janrain Quick Sign-in, our demo app listed on the Apple App Store. Some key features and benefits : Companies and websites that offer an application for the iPhone can now use Janrain Engage for the iPhone to enable quick registration and login via Facebook, Google, Twitter, Yahoo!, LinkedIn and up to 11 additional identity providers. Janrain Engage for the iPhone maintains the look and feel of the iPhone SDK and enables websites to authenticate their users through iPhone's native UI Kit as opposed to launching a web browser for user sign in. Users can browse configured providers from a single-column table view, as opposed to the application's two-column view, which helps maximize the real estate of the iPhone screen. Janrain Engage remembers the user's preferred provider on return visits, to help ensure a positive and intuitive return user experience. Janrain Engage for the iPhone includes the same key features as the browser based version of the product. Developers can customize the number of identity providers displayed and the order in which they appear via the Janrain Engage dashboard. As always, we welcome your feedback and are excited to extend the benefits of Janrain Engage to our customers that are active in the mobile space.",
				"date" : "Jun 22, 2010 10:00 AM",
				"images" : 
				[
					"http://www.janrain.com/sites/default/files/iphone.png"
				]
			}
		},
		{
			"story" : 
			{
				"title" : "Major Media Companies Implement Janrain Engage to Better Connect with Users Online",
				"link" : "http://www.janrain.com/blogs/media-companies-optimizing-user-registration-engagement-0",
				"creator" : "Michael Olson",
				"description" : "<p>In April, we wrote about one of the <a href=%34/../../blogs/news-sites-moving-away-anonymous-online-comments%34>changing paradigms in the news media industry</a> resulting from the emergence of social media. Since establishing an online footprint, many news media companies have historically experienced two pain points:</p> <ul> <li>By allowing anonymous commenting on articles and not encouraging folks to use their real identities online, discussions on media sites can often devolve into vitriolic conversations that devalue the online experience.</li> <li>Because the registration process can be such a hassle for online users, media sites often collect inaccurate data on their members.&nbsp; This &quot;Garbage In, Garbage Out&quot; phenomenon means that many media sites are making business decisions (such as serving personalized content or targeted advertisments, for example) based on unreliable user data.&nbsp; When media sites force users to register the traditional way, they end up with far too many &quot;John Smiths&quot; from the zip code &quot;12345&quot;.</li> </ul> <p>As reported today on <a href=%34http://social.venturebeat.com/2010/06/16/janrain-la-times-openid/%34 target=%34_blank%34>VentureBeat</a>, <a href=%34http://www.digidaydaily.com/stories/janrain-signs-a-slew-of-media-heavyweights-into-identity-capture-tools/%34 target=%34_blank%34>DigiDay</a> and <a href=%34http://www.webpronews.com/topnews/2010/06/17/why-social-publishing-drives-more-valuable-traffic%34 target=%34_blank%34>WebProNews</a>, innovative media companies are utilizing <a href=%34/products/engage%34>Janrain Engage</a> (formerly RPX) to allow users to bypass the traditional registration process and sign-in via an existing account with Facebook, Google, Yahoo!, Twitter or other social platforms.&nbsp; Doing this enables media sites both to encourage users to interact on the site with a real online identity, and collect an accurate profile of their audience when a user chooses to share his or her profile data with the website.</p> <p> Media companies now using Janrain Engage to enable easy registration, login, and publishing of user comments and other website activities to multiple social networks include:</p> <ul> <li><a href=%34http://www.tribuneinteractive.com%34 target=%34_blank%34>Tribune Interactive</a> - has a dynamic online presence both locally and nationally, operating leading news and information sites in 20 major markets. Janrain Engage has already been rolled out on the online properties of the <a href=%34http://www.latimes.com%34 target=%34_blank%34>Los Angeles Times</a>, <a href=%34http://www.baltimoresun.com%34 target=%34_blank%34>Baltimore Sun</a>, <a href=%34http://www.sun-sentinel.com%34 target=%34_blank%34>Sun-Sentinel</a>, <a href=%34http://www.orlandosentinel.com%34>Orlando Sentinel</a> and four additional media properties.</li> <li><a href=%34http://www.meredith.com%34 target=%34_blank%34>Meredith </a>- the leading media and marketing company serving American women. Janrain Engage is being rolled out across several sites including <a href=%34http://www.bhg.com%34 target=%34_blank%34>Better Homes and Gardens</a>, <a href=%34http://www.parents.com%34 target=%34_blank%34>Parents.com</a>, <a href=%34http://www.recipe.com%34 target=%34_blank%34>Recipe.com</a> and <a href=%34http://www.fitnessmagazine.com%34 target=%34_blank%34>Fitness Magazine</a>.</li> <li><a href=%34http://www.scripps.com%34 target=%34_blank%34>E.W. Scripps</a> - a diverse media concern with interests in newspaper publishing, broadcast television stations, and licensing and syndication. Janrain Engage will provide authentication and social publishing across all 21 of their newspaper web properties, including those of the <a href=%34http://www.knoxnews.com%34 target=%34_blank%34>Knoxville News Sentinel</a>, <a href=%34http://www.vcstar.com%34 target=%34_blank%34>Ventura County Star</a> and <a href=%34http://www.naplesnews.com%34 target=%34_blank%34>Naples Daily News</a>.</li> <li><a href=%34http://www.dallasnews.com%34 target=%34_blank%34>Dallas Morning News</a> - has deployed Janrain Engage across four of its online properties, including dallasnews.com, the online city guides <a href=%34http://www.guidelive.com%34 target=%34_blank%34>GuideLive.com</a> and <a href=%34http://www.quickdfw.com%34 target=%34_blank%34>QuickDFW.com</a>, as well as on <a href=%34http://www.aldiatx.com%34 target=%34_blank%34>alDiaTX.com</a>, its Spanish-language news site.</li> <li><a href=%34http://www.bizjournals.com%34 target=%34_blank%34>bizjournals</a> - the online media division of American City Business Journals, the nation&rsquo;s largest publisher of metropolitan business newspapers. It operates the web sites for each of the company&#39;s 40 print business journals and operates a web-only site with local business news and information for Los Angeles.</li> <li><a href=%34http://www.ngs.org%34 target=%34_blank%34>National Geographic Society</a> - one of the largest non-profit scientific and educational institutions in the world. The Society publishes National Geographic, a leading magazine with subjects that include geography, archaeology and natural science, the promotion of environmental and historical conservation. Janrain Engage has been deployed previously on the <a href=%34http://channel.nationalgeographic.com%34 target=%34_blank%34>National Geographic Channel website</a> and is now being launched on NationalGeographic.com.</li> </ul> <p> These six media customers join a number of other major media companies already working with Janrain, including <a href=%34http://www.foxnews.com%34 target=%34_blank%34>Fox News</a>, <a href=%34http://www.npr.org%34 target=%34_blank%34>National Public Radio</a>, <a href=%34http://www.oknews.com%34 target=%34_blank%34>Oklahoma Publishing Company</a>, <a href=%34http://www.divinecaroline.com%34 target=%34_blank%34>Real Girls Media</a>, <a href=%34http://www.journalismonline.com%34 target=%34_blank%34>Journalism Online</a>, <a href=%34http://www.and.co.uk%34 target=%34_blank%34>Associated Northcliffe Digital</a>, <a href=%34http://www.avro.nl%34 target=%34_blank%34>Avro</a>, and the <a href=%34http://www.bakersfield.com%34 target=%34_blank%34>Bakersfield Californian</a>.</p>",
				"plainText" :"In April, we wrote about one of the changing paradigms in the news media industry resulting from the emergence of social media. Since establishing an online footprint, many news media companies have historically experienced two pain points: By allowing anonymous commenting on articles and not encouraging folks to use their real identities online, discussions on media sites can often devolve into vitriolic conversations that devalue the online experience. Because the registration process can be such a hassle for online users, media sites often collect inaccurate data on their members.This %34Garbage In, Garbage Out%34 phenomenon means that many media sites are making business decisions (such as serving personalized content or targeted advertisments, for example) based on unreliable user data.When media sites force users to register the traditional way, they end up with far too many %34John Smiths%34 from the zip code %3412345%34. As reported today on VentureBeat, DigiDay and WebProNews, innovative media companies are utilizing Janrain Engage (formerly RPX) to allow users to bypass the traditional registration process and sign-in via an existing account with Facebook, Google, Yahoo!, Twitter or other social platforms.Doing this enables media sites both to encourage users to interact on the site with a real online identity, and collect an accurate profile of their audience when a user chooses to share his or her profile data with the website. Media companies now using Janrain Engage to enable easy registration, login, and publishing of user comments and other website activities to multiple social networks include: Tribune Interactive - has a dynamic online presence both locally and nationally, operating leading news and information sites in 20 major markets. Janrain Engage has already been rolled out on the online properties of the Los Angeles Times, Baltimore Sun, Sun-Sentinel, Orlando Sentinel and four additional media properties. Meredith - the leading media and marketing company serving American women. Janrain Engage is being rolled out across several sites including Better Homes and Gardens, Parents.com, Recipe.com and Fitness Magazine. E.W. Scripps - a diverse media concern with interests in newspaper publishing, broadcast television stations, and licensing and syndication. Janrain Engage will provide authentication and social publishing across all 21 of their newspaper web properties, including those of the Knoxville News Sentinel, Ventura County Star and Naples Daily News. Dallas Morning News - has deployed Janrain Engage across four of its online properties, including dallasnews.com, the online city guides GuideLive.com and QuickDFW.com, as well as on alDiaTX.com, its Spanish-language news site. bizjournals - the online media division of American City Business Journals, the nation&rsquo;s largest publisher of metropolitan business newspapers. It operates the web sites for each of the company's 40 print business journals and operates a web-only site with local business news and information for Los Angeles. National Geographic Society - one of the largest non-profit scientific and educational institutions in the world. The Society publishes National Geographic, a leading magazine with subjects that include geography, archaeology and natural science, the promotion of environmental and historical conservation. Janrain Engage has been deployed previously on the National Geographic Channel website and is now being launched on NationalGeographic.com. These six media customers join a number of other major media companies already working with Janrain, including Fox News, National Public Radio, Oklahoma Publishing Company, Real Girls Media, Journalism Online, Associated Northcliffe Digital, Avro, and the Bakersfield Californian.",
				"date" : "Jun 17, 2010 9:25 AM"
			}
		},
		{
			"story" : 
			{
				"title" : "Janrain Launches New Products and New Website",
				"link" : "http://www.janrain.com/blogs/janrain-launches-new-products-and-new-website",
				"creator" : "Brian Kissel",
				"description" : "<p><img alt=%34%34 src=%34/sites/default/files/janrain-logo.png%34 style=%34padding: 0px 0px 20px 20px; float: right; width: 180px; height: 53px;%34 />Today we are announcing several exciting changes to the Janrain product portfolio, brand and website. On the product front, we have renamed our flagship product, RPX, which is currently deployed on over 200,000 websites worldwide to <strong><em><a href=%34/products/engage%34>Janrain Engage</a>.&nbsp;</em></strong> We are renaming our OPX product to <strong><a href=%34/products/federate%34>Janrain Federate</a></strong>.</p> <p>And, we are formally launching the<strong><em> <a href=%34/janrain-products-overview%34>Janrain User Management Platform (JUMP)</a></em></strong> to help organizations manage and measure online user interaction and engagement. An established&nbsp;best practice in building websites today is to use component technologies for&nbsp;content management systems (CMS), rating and reviews, commenting , eCommerce, and web analytics. Janrain provides the user management&nbsp;component, and integrates seamlessly with these additional component technologies.</p> <p><strong>Product Renaming &ndash; New names for RPX and OPX</strong></p> <ul> <li><em><strong>RPX will become <a href=%34/products/engage%34>Janrain Engage</a> </strong></em>- Leverage a user&rsquo;s existing identity profile from social networks or identity providers like Facebook, Twitter, Google and others to speed up online registration. Invite friends and publish activity data back to social networks.</li> </ul> <ul> <li><strong><em>OPX will become <a href=%34/products/federate%34>Janrain Federate</a> </em></strong>- Enable registered users of your website to seamlessly navigate to multiple web properties and partner sites using their existing credentials for a single-sign on experience.</li> </ul> <p><strong>Formally introducing&hellip; the <a href=%34/janrain-products-overview%34>Janrain User Management Platform (JUMP)</a></strong><br /> The Janrain User Management Platform helps you seamlessly manage all aspects of user interaction and social engagement. Janrain Engage connects your site to the social networks and enables you to easily authenticate your site visitors via their existing social identities, and publish their activities on your site to multiple social networks. Janrain Federate enables you to facilitate a single sign-on environment for your users and provision a centrally-managed identity. All products can be used together or separately.</p> <p>The Janrain platform integrates with content management systems (CMS), rating and review technologies, commenting systems, eCommerce platforms and web analytics software to allow for seamless deployments no matter what the use case.</p> <p><strong>A New Website and Logo</strong><br /> The Janrain website has been redesigned to make it easier to find information, and our logo has been updated &ndash; goodbye Capital R, and hello a brighter blue. As part of the site re-launch, rpxnow.com will no longer be a public site.</p> <p><strong>For Janrain customers, this news means:</strong><br /> &bull;&nbsp;Your existing Janrain solutions will continue to work without interruption and without any changes necessary on your end.<br /> &bull;&nbsp;You will access your Janrain RPX application, now renamed Janrain Engage, by signing into your dashboard through janrain.com.&nbsp; You can continue to administer your Janrain Engage application through your existing dashboard, and no changes have been made to your application settings.<br /> &bull;&nbsp;Janrain contact information remains the same.</p> <p>Thanks for reading and we look forward to continuing to develop and deliver innovative and reliable solutions for online user management. As always, your feedback and comments are welcome.</p> <p>Brian Kissel<br /> CEO, Janrain, Inc.</p>",
				"plainText" :"Today we are announcing several exciting changes to the Janrain product portfolio, brand and website. On the product front, we have renamed our flagship product, RPX, which is currently deployed on over 200,000 websites worldwide to Janrain Engage.We are renaming our OPX product to Janrain Federate. And, we are formally launching the Janrain User Management Platform (JUMP) to help organizations manage and measure online user interaction and engagement. An established best practice in building websites today is to use component technologies for content management systems (CMS), rating and reviews, commenting, eCommerce, and web analytics. Janrain provides the user management component, and integrates seamlessly with these additional component technologies. Product Renaming &ndash; New names for RPX and OPX RPX will become Janrain Engage - Leverage a user&rsquo;s existing identity profile from social networks or identity providers like Facebook, Twitter, Google and others to speed up online registration. Invite friends and publish activity data back to social networks. OPX will become Janrain Federate - Enable registered users of your website to seamlessly navigate to multiple web properties and partner sites using their existing credentials for a single-sign on experience. Formally introducing&hellip; the Janrain User Management Platform (JUMP) The Janrain User Management Platform helps you seamlessly manage all aspects of user interaction and social engagement. Janrain Engage connects your site to the social networks and enables you to easily authenticate your site visitors via their existing social identities, and publish their activities on your site to multiple social networks. Janrain Federate enables you to facilitate a single sign-on environment for your users and provision a centrally-managed identity. All products can be used together or separately. The Janrain platform integrates with content management systems (CMS), rating and review technologies, commenting systems, eCommerce platforms and web analytics software to allow for seamless deployments no matter what the use case. A New Website and Logo The Janrain website has been redesigned to make it easier to find information, and our logo has been updated &ndash; goodbye Capital R, and hello a brighter blue. As part of the site re-launch, rpxnow.com will no longer be a public site. For Janrain customers, this news means: &bull; Your existing Janrain solutions will continue to work without interruption and without any changes necessary on your end. &bull; You will access your Janrain RPX application, now renamed Janrain Engage, by signing into your dashboard through janrain.com.You can continue to administer your Janrain Engage application through your existing dashboard, and no changes have been made to your application settings. &bull; Janrain contact information remains the same. Thanks for reading and we look forward to continuing to develop and deliver innovative and reliable solutions for online user management. As always, your feedback and comments are welcome. Brian Kissel CEO, Janrain, Inc.",
				"date" : "Jun 16, 2010 5:05 AM",
				"images" : 
				[
					"/sites/default/files/janrain-logo.png"
				]
			}
		},
		{
			"story" : 
			{
				"title" : "Open Source Bridge Pub Crawl Stops By Janrain",
				"link" : "http://www.janrain.com/blogs/open-source-bridge-pub-crawl-stops-janrain",
				"creator" : "Michael Olson",
				"description" : "<p>The rain last night in Portland, Oregon didn&#39;t stop folks from making the rounds on a technology company Pub Crawl held in conjunction with the <a href=%34http://opensourcebridge.org/%34>Open Source Bridge Conference</a>. JanRain was part of an evening event hosted by <a href=%34http://facebook.com/%34>Facebook</a>. Everyone started at Kells, a local Irish pub down the street, and then moved on for drinks at a few local technology companies: JanRain, <a href=%34http://www.puppetlabs.com/%34>Puppet Labs</a> and <a href=%34http://urbanairship.com/%34>Urban Airship</a>. The night wrapped up at the offices of local ad agency <a href=%34http://www.wk.com/%34>Wieden + Kennedy</a>.</p> <p> Everyone seemed to have a great time talking with new and old friends around the keg (another local favorite - Bridgeport Brewing). Conversation topics ranged from debate over favorite tourist hot spots on the west coast to discussions of the role open source technologies can play in the continued evolution of the social web.</p> <p><img alt=%34%34 id=%34BLOGGER_PHOTO_ID_5479058692627042610%34 src=%34/sites/default/files/blog-images/_MG_4881.jpg%34 style=%34border-style: solid; border-width: 0px; margin: 0px auto 10px; text-align: center; width: 280px; display: block; height: 187px;%34 /><br /> Since it was our first event since moving into our new office a few months ago, it was great to have so many people in our space.</p> <p> Next up is <a href=%34http://upcoming.yahoo.com/event/5833861/OR/Portland/Lunch-20-at-JanRain/JanRain/%34>Lunch 2.0</a> here on July 14. Be sure to register if you would like to attend.</p>",
				"plainText" :"The rain last night in Portland, Oregon didn't stop folks from making the rounds on a technology company Pub Crawl held in conjunction with the Open Source Bridge Conference. JanRain was part of an evening event hosted by Facebook. Everyone started at Kells, a local Irish pub down the street, and then moved on for drinks at a few local technology companies: JanRain, Puppet Labs and Urban Airship. The night wrapped up at the offices of local ad agency Wieden + Kennedy. Everyone seemed to have a great time talking with new and old friends around the keg (another local favorite - Bridgeport Brewing). Conversation topics ranged from debate over favorite tourist hot spots on the west coast to discussions of the role open source technologies can play in the continued evolution of the social web. Since it was our first event since moving into our new office a few months ago, it was great to have so many people in our space. Next up is Lunch 2.0 here on July 14. Be sure to register if you would like to attend.",
				"date" : "Jun 4, 2010 10:03 AM",
				"images" : 
				[
					"/sites/default/files/blog-images/_MG_4881.jpg"
				]
			}
		},
		{
			"story" : 
			{
				"title" : "LinkedIn Social Publishing Now Available in Janrain Engage",
				"link" : "http://www.janrain.com/blogs/linkedin-social-publishing-now-available-janrain-rpx",
				"creator" : "Michael Olson",
				"description" : "<p>We&#39;re happy to announce today that we have added <a href=%34http://www.linkedin.com/%34>LinkedIn</a> as a supported network for social publishing within Janrain Engage. This means that you can now enable your website users to publish their comments, reviews, purchases, blogs, downloads, or any other activities from your site to their LinkedIn profile as a status update.<a href=%34http://4.bp.blogspot.com/_5bYjpYVN3Uo/S_ro5tu97DI/AAAAAAAAAQM/wrgl6kT_dWc/s1600/linkedin-in-social-widget.JPG%34 onblur=%34try {parent.deselectBloggerImageGracefully();} catch(e) {}%34><img alt=%34%34 id=%34BLOGGER_PHOTO_ID_5474944375249038386%34 src=%34/sites/default/files/blog-images/linkedin-in-social-widget.JPG%34 style=%34border-style: solid; border-width: 0px; margin: 0px auto 10px; display: block; text-align: center; cursor: pointer; width: 280px; height: 202px;%34 /></a></p> <p> With over 50 million members, LinkedIn is a prominent communication and networking platform for business professionals, and presents a great opportunity for you to enable word of mouth marketing via your users through another social channel.<a href=%34http://4.bp.blogspot.com/_5bYjpYVN3Uo/S_rpsjOZNuI/AAAAAAAAAQU/tHfMuKYcqRs/s1600/linkedin-published.JPG%34 onblur=%34try {parent.deselectBloggerImageGracefully();} catch(e) {}%34><img alt=%34%34 id=%34BLOGGER_PHOTO_ID_5474945248601388770%34 src=%34/sites/default/files/blog-images/linkedin-published.JPG%34 style=%34border-style: solid; border-width: 0px; margin: 0px auto 10px; display: block; text-align: center; cursor: pointer; width: 280px; height: 160px;%34 /></a></p> <p> Configuring social publishing with Janrain Engage is seamless, and can be done in minutes. Simply add a few snippets of JavaScript to your site, select the networks you wish to enable for social publishing, and you&#39;re set.<a href=%34http://4.bp.blogspot.com/_5bYjpYVN3Uo/S_r9ZgltkVI/AAAAAAAAAQc/BLIH9cTs5dA/s1600/linkedin-social-widget-setup.JPG%34 onblur=%34try {parent.deselectBloggerImageGracefully();} catch(e) {}%34><img alt=%34%34 id=%34BLOGGER_PHOTO_ID_5474966911708926290%34 src=%34/sites/default/files/blog-images/linkedin-social-widget-setup.JPG%34 style=%34border-style: solid; border-width: 0px; margin: 0px auto 10px; display: block; text-align: center; cursor: pointer; width: 280px; height: 207px;%34 /></a></p> <p> With our separate <a href=%34/blogs/janrain-rpx-enables-publishing-google-buzz%34>announcement last week about the addition of Google Buzz</a>, we now support publishing to as many as six social networks.</p>",
				"plainText" :"We're happy to announce today that we have added LinkedIn as a supported network for social publishing within Janrain Engage. This means that you can now enable your website users to publish their comments, reviews, purchases, blogs, downloads, or any other activities from your site to their LinkedIn profile as a status update. With over 50 million members, LinkedIn is a prominent communication and networking platform for business professionals, and presents a great opportunity for you to enable word of mouth marketing via your users through another social channel. Configuring social publishing with Janrain Engage is seamless, and can be done in minutes. Simply add a few snippets of JavaScript to your site, select the networks you wish to enable for social publishing, and you're set. With our separate announcement last week about the addition of Google Buzz, we now support publishing to as many as six social networks.",
				"date" : "May 24, 2010 11:14 AM",
				"images" : 
				[
					"/sites/default/files/blog-images/linkedin-in-social-widget.JPG",
					"/sites/default/files/blog-images/linkedin-published.JPG",
					"/sites/default/files/blog-images/linkedin-social-widget-setup.JPG"
				]
			}
		},
		{
			"story" : 
			{
				"title" : "A Look at the 2010 Internet Identity Workshop",
				"link" : "http://www.janrain.com/blogs/look-2010-internet-identity-workshop",
				"creator" : "Michael Olson",
				"description" : "<div style=%34text-align: left;%34>Hello, readers of the JanRain blog. I haven&#39;t posted here before, so I&#39;ll start with a brief introduction of myself. My name is Carl Howells. I&#39;m a software engineer who&#39;s been working at JanRain for a bit over six years now. In that time, I&#39;ve worked on a more projects than I can even remember.</div> <p> As far as things relevant to the current world go, I was a very early implementer of the original OpenID proposal. My work helped uncover some holes in the initial proposal, and I felt like I contributed some useful bits.</p> <p> As JanRain continued in that space, I helped with initial versions of the OpenID 2.0 specification, but I eventually moved into handling implementation of the spec, and left writing it to those with more experience writing formal specifications.</p> <p> In the time since, I&#39;ve worked on all of JanRain&#39;s OpenID-related products. I currently help maintain and develop all of them, with most of my time spent on RPX.</p> <p> A couple months ago, I was asked if I wanted to attend the 10th annual <a href=%34http://www.internetidentityworkshop.com/%34>Internet Identity Workshop</a> (IIW), as our more technical representative. I hadn&#39;t previously attended an IIW, and I didn&#39;t know what to expect. The idea was a bit scary, but I agreed. With some trepidation, I woke up exceedingly early (in engineer time) Monday morning, packed for the trip, drove to the airport, and soon found myself at IIW.</p> <p> After the intro speech, <span style=%34font-weight: bold;%34>Kaliya Hamlin </span>(<a href=%34http://www.identitywoman.net/%34>IdentityWoman</a>, the co-founder/facilitator of IIW, and one of the few present I had met before) explained the format. The short version is &quot;anyone can propose any topic for discussion, anyone can join any discussion they like.&quot; Topics were scheduled in different areas of the workshop space at the beginning of each day.</p> <p> I spent the day checking out various sessions. Some, like the in-depth discussion of <span style=%34font-weight: bold;%34>David Recordon</span>&#39;s <a href=%34http://openidconnect.com/%34>OpenID Connect</a> proposal, were discussions of technologies directly related to our business. Others were peripherally related to directions future products might take, like Alan Karp&#39;s discussion of <a href=%34http://iiw.idcommons.net/Voluntary_Oblivious_Compliance%34>Voluntary Oblivious Compliance</a>. Finally, there were a couple that turned out to have no real relation to anything JanRain&#39;s doing, but still fascinated me.</p> <p> At the close of the day, everyone retired to the dinner generously provided at an excellent Italian restaurant by several of the conference&#39;s sponsors. I spent a short time in a conversation with <a href=%34http://www.xmlgrrl.com/blog/welcome/%34>Eve Maler</a> and several others, the main topic being the seeming death of XML validation. I soon moved on to introduce myself to <a href=%34http://www.sakimura.org/en/%34>Nat Sakimura</a> and a gentleman whose name I&#39;ve forgotten from the Dutch government.</p> <p> We had a long discussion about OpenID, population sizes, and how pretty Oregon is. I had a great time getting to know people working in very distinct government environments. We discussed use cases each government had, and how they&#39;re building their solutions on top of OpenID. It was a great reminder that governments have very different requirements from commercial entities, and that they&#39;re active in getting their needs addressed as well.</p> <p> Soon dinner was served, and we retired to the hotel afterwards. Brian Kissel, CEO of JanRain, is an alumnus of Stanford. This lets him reserve rooms at the Stanford Guest House. It was a terrifically surreal experience to stay at a hotel that was behind the security checkpoint for SLAC, the Stanford Linear Accelerator.</p> <p> The highlight of day two was attending Nat Sakimura&#39;s presentation on his <a href=%34http://wiki.openid.net/Artifact_Binding%34>OpenID artifact binding</a> proposal, a specification JanRain will watch closely as it progresses in the future. It&#39;s a proposal for detaching the data transfer in OpenID from the protocol exchange itself, resulting in significantly less data sent through the user&#39;s web browser. This also provides opportunities for stronger data protection policies to be developed. It is a clean solution to several different issues we face today, and it allows new features for OpenID in the future as well.</p> <p> Day three was shorter than the rest, with fewer time slots for sessions, and fewer sessions distributed among those time slots. I spent most of the day talking one-on-one with various people. I was pleased to have Nat Sakimura ask for my thoughts about his proposal for artifact binding, and ask me to join the working group so I could continue contributing in the future.</p> <p> The biggest standout from the conference was the sheer size of it. IIW 10 was 30% larger than any previous IIW meeting. The involvement from both industry and individuals is taking off, and it&#39;s clear that we&#39;re just seeing the beginning of this movement.</p> <p> As for me? It&#39;s good to see what&#39;s going on out in the world. But it&#39;s also going to be good to get back to work on the ever-increasing list of tasks on my plate.</p> <p> ____</p> <p> Carl Howells<br /> Software Engineer<br /> JanRain</p>",
				"plainText" :"Hello, readers of the JanRain blog. I haven't posted here before, so I'll start with a brief introduction of myself. My name is Carl Howells. I'm a software engineer who's been working at JanRain for a bit over six years now. In that time, I've worked on a more projects than I can even remember. As far as things relevant to the current world go, I was a very early implementer of the original OpenID proposal. My work helped uncover some holes in the initial proposal, and I felt like I contributed some useful bits. As JanRain continued in that space, I helped with initial versions of the OpenID 2.0 specification, but I eventually moved into handling implementation of the spec, and left writing it to those with more experience writing formal specifications. In the time since, I've worked on all of JanRain's OpenID-related products. I currently help maintain and develop all of them, with most of my time spent on RPX. A couple months ago, I was asked if I wanted to attend the 10th annual Internet Identity Workshop (IIW), as our more technical representative. I hadn't previously attended an IIW, and I didn't know what to expect. The idea was a bit scary, but I agreed. With some trepidation, I woke up exceedingly early (in engineer time) Monday morning, packed for the trip, drove to the airport, and soon found myself at IIW. After the intro speech, Kaliya Hamlin ( IdentityWoman, the co-founder/facilitator of IIW, and one of the few present I had met before) explained the format. The short version is &quot;anyone can propose any topic for discussion, anyone can join any discussion they like.&quot; Topics were scheduled in different areas of the workshop space at the beginning of each day. I spent the day checking out various sessions. Some, like the in-depth discussion of David Recordon 's OpenID Connect proposal, were discussions of technologies directly related to our business. Others were peripherally related to directions future products might take, like Alan Karp's discussion of Voluntary Oblivious Compliance. Finally, there were a couple that turned out to have no real relation to anything JanRain's doing, but still fascinated me. At the close of the day, everyone retired to the dinner generously provided at an excellent Italian restaurant by several of the conference's sponsors. I spent a short time in a conversation with Eve Maler and several others, the main topic being the seeming death of XML validation. I soon moved on to introduce myself to Nat Sakimura and a gentleman whose name I've forgotten from the Dutch government. We had a long discussion about OpenID, population sizes, and how pretty Oregon is. I had a great time getting to know people working in very distinct government environments. We discussed use cases each government had, and how they're building their solutions on top of OpenID. It was a great reminder that governments have very different requirements from commercial entities, and that they're active in getting their needs addressed as well. Soon dinner was served, and we retired to the hotel afterwards. Brian Kissel, CEO of JanRain, is an alumnus of Stanford. This lets him reserve rooms at the Stanford Guest House. It was a terrifically surreal experience to stay at a hotel that was behind the security checkpoint for SLAC, the Stanford Linear Accelerator. The highlight of day two was attending Nat Sakimura's presentation on his OpenID artifact binding proposal, a specification JanRain will watch closely as it progresses in the future. It's a proposal for detaching the data transfer in OpenID from the protocol exchange itself, resulting in significantly less data sent through the user's web browser. This also provides opportunities for stronger data protection policies to be developed. It is a clean solution to several different issues we face today, and it allows new features for OpenID in the future as well. Day three was shorter than the rest, with fewer time slots for sessions, and fewer sessions distributed among those time slots. I spent most of the day talking one-on-one with various people. I was pleased to have Nat Sakimura ask for my thoughts about his proposal for artifact binding, and ask me to join the working group so I could continue contributing in the future. The biggest standout from the conference was the sheer size of it. IIW 10 was 30% larger than any previous IIW meeting. The involvement from both industry and individuals is taking off, and it's clear that we're just seeing the beginning of this movement. As for me? It's good to see what's going on out in the world. But it's also going to be good to get back to work on the ever-increasing list of tasks on my plate. ____ Carl Howells Software Engineer JanRain",
				"date" : "May 21, 2010 3:36 AM"
			}
		},
		{
			"story" : 
			{
				"title" : "Janrain RPX Enables Publishing to Google Buzz",
				"link" : "http://www.janrain.com/blogs/janrain-rpx-enables-publishing-google-buzz",
				"creator" : "Michael Olson",
				"description" : "<p style=%34background:#eee;padding:15px;%34><em><strong>Update:</strong> We have temporarily disabled support for Google Buzz functionality while we work with Google on improvements to the user experience. Google&#39;s roadmap includes implementing Google Buzz scopes for the OAuth Hybrid. This support will create a more graceful login experience. Please stay tuned and look for updates on the <a href=%34http://feedback.janrain.com/forums/62331-janrain-engage-formerly-rpx-%34>Janrain UserVoice forum</a>.</em></p> <p>Google today <a href=%34http://googlecode.blogspot.com/2010/05/introducing-google-buzz-api.html%34>announced</a> API support for publishing to Google Buzz. Built right into Gmail - where you already communicate with the people you care about - Google Buzz allows longer posts and rich media attachments and enables users to view shared videos and photos inline. Through our participation in the Buzz API program, I am happy to announce that JanRain customers now have the option to engage this social network by allowing users to publish activity on your site back to their Google Buzz followers.</p> <p> JanRain customers can deploy Google Buzz on their website in one of two ways - by simply dragging and dropping Google Buzz as a provider on RPX&#39;s social publishing widget or by leveraging our API wrapper for custom UI implementations.</p> <div style=%34text-align: center;%34><a href=%34http://1.bp.blogspot.com/_5bYjpYVN3Uo/S_QtmZddb_I/AAAAAAAAAPs/ydbZyY09-RM/s1600/rpx-social-widget-google-buzz-screenshot.JPG%34 onblur=%34try {parent.deselectBloggerImageGracefully();} catch(e) {}%34><img alt=%34%34 id=%34BLOGGER_PHOTO_ID_5473049584854724594%34 src=%34/sites/default/files/blog-images/rpx-social-widget-google-buzz-screenshot.JPG%34 style=%34border-style: solid; border-width: 0px; margin: 0px auto 10px; display: block; text-align: center; cursor: pointer; width: 280px; height: 194px;%34 /></a><br /> <span style=%34font-size: 78%;%34><span style=%34font-weight: bold;%34>JanRain RPX social publishing widget with new support for Google Buzz</span></span></div> <p> JanRain customers DivineCaroline and Qype have rolled out publishing support for Google Buzz.<a href=%34http://www.divinecaroline.com/%34></a></p> <p> DivineCaroline, the flagship site of <a href=%34http://www.realgirlsmedia.com/%34>Real Girls Media Network, Inc.</a> is an online community that enables members to easily submit and automatically publish their thoughts and stories.</p> <p> &ldquo;Low barriers to user registration and participation in the community on DivineCaroline are very important to Real Girls Media. We also want to enable our users to easily share their writing on other social sites such as Google Buzz. We are delighted that JanRain enables us to provide these features cheaply, easily and in a timely manner, as well as continues to be on the forefront of driving open standards,&rdquo; said Thomas Kudrycki, co-founder and EVP of Technology at Real Girls Media.</p> <div style=%34text-align: center;%34><a href=%34http://3.bp.blogspot.com/_5bYjpYVN3Uo/S_QtcG9IKHI/AAAAAAAAAPk/BbH7QWk2Bzk/s1600/divinecaroline-google-buzz.jpg%34 onblur=%34try {parent.deselectBloggerImageGracefully();} catch(e) {}%34><img alt=%34%34 id=%34BLOGGER_PHOTO_ID_5473049408088582258%34 src=%34/sites/default/files/blog-images/divinecaroline-google-buzz.jpg%34 style=%34border-style: solid; border-width: 0px; margin: 0px auto 10px; display: block; text-align: center; cursor: pointer; width: 280px; height: 151px;%34 /></a> <p> <span style=%34font-size: 78%;%34><span style=%34font-weight: bold;%34>DivineCaroline&rsquo;s user interface for posting a comment to Google Buzz or Facebook using JanRain RPX</span></span></p></div> <p><a href=%34http://www.qype.co.uk/%34><br /> Qype</a> is Europe&rsquo;s largest user-generated local review site, with sites in 10 countries and 7 languages, and mobile apps on most major platforms.</p> <p> &ldquo;It&rsquo;s really important for our users to be able to publish their content to as wide an audience as possible, and using RPX, we make that very easy for them. Both sign-up and sharing are now one-click experiences, and it&rsquo;s great to easily bring this to our iPhone application too,&rdquo; said Phil Chambers, CTO at Qype. &ldquo;We will roll out public publishing support for Google Buzz on May 20.&rdquo;</p> <div style=%34text-align: center;%34><a href=%34http://4.bp.blogspot.com/_5bYjpYVN3Uo/S_Q03jYT9BI/AAAAAAAAAP8/nCGx8NkDV7Q/s1600/qype-google-buzz.jpg%34 onblur=%34try {parent.deselectBloggerImageGracefully();} catch(e) {}%34><img alt=%34%34 id=%34BLOGGER_PHOTO_ID_5473057576156656658%34 src=%34/sites/default/files/blog-images/qype-google-buzz.jpg%34 style=%34border-style: solid; border-width: 0px; margin: 0px auto 10px; display: block; text-align: center; cursor: pointer; width: 280px; height: 242px;%34 /></a> <p> <span style=%34font-size: 78%;%34><span style=%34font-weight: bold;%34>Qype&#39;s user interface for publishing a review to up to 5 social networks, including Google Buzz, using JanRain RPX</span></span></p></div> <p> Both sites enable their users to either register or login with a third party identity such as Google, Facebook, Yahoo, Twitter and leave a comment on a post. The users are then prompted to publish comments to a social network with a single click.</p> <p> In addition to posting activity updates to Google Buzz, the release of the API also includes support for searching on activity feeds by latitude, longitude and radius and liking or unliking an activity. Over the next few months JanRain will be releasing features that allow websites to take advantage of the rich feature set around Google Buzz activity streams to build personalized and engaging experiences for their end users.</p> <p> Lastly, the Google Buzz API has resulted in the adoption of community-developed protocols, formats, and standards for sharing and consuming social content on the web, including ActivityStreams, Atom, AtomPub, JSON, OAuth, PubSubHubbub, MediaRSS, PortableContacts, and more. This is a huge win for the open standards community.</p> <p> _____</p> <p> Vidya Shivkumar<br /> Director, Product Management<br /> JanRain</p>",
				"plainText" :"Update: We have temporarily disabled support for Google Buzz functionality while we work with Google on improvements to the user experience. Google's roadmap includes implementing Google Buzz scopes for the OAuth Hybrid. This support will create a more graceful login experience. Please stay tuned and look for updates on the Janrain UserVoice forum. Google today announced API support for publishing to Google Buzz. Built right into Gmail - where you already communicate with the people you care about - Google Buzz allows longer posts and rich media attachments and enables users to view shared videos and photos inline. Through our participation in the Buzz API program, I am happy to announce that JanRain customers now have the option to engage this social network by allowing users to publish activity on your site back to their Google Buzz followers. JanRain customers can deploy Google Buzz on their website in one of two ways - by simply dragging and dropping Google Buzz as a provider on RPX's social publishing widget or by leveraging our API wrapper for custom UI implementations. JanRain RPX social publishing widget with new support for Google Buzz JanRain customers DivineCaroline and Qype have rolled out publishing support for Google Buzz. DivineCaroline, the flagship site of Real Girls Media Network, Inc. is an online community that enables members to easily submit and automatically publish their thoughts and stories. &ldquo;Low barriers to user registration and participation in the community on DivineCaroline are very important to Real Girls Media. We also want to enable our users to easily share their writing on other social sites such as Google Buzz. We are delighted that JanRain enables us to provide these features cheaply, easily and in a timely manner, as well as continues to be on the forefront of driving open standards,&rdquo; said Thomas Kudrycki, co-founder and EVP of Technology at Real Girls Media. DivineCaroline&rsquo;s user interface for posting a comment to Google Buzz or Facebook using JanRain RPX Qype is Europe&rsquo;s largest user-generated local review site, with sites in 10 countries and 7 languages, and mobile apps on most major platforms. &ldquo;It&rsquo;s really important for our users to be able to publish their content to as wide an audience as possible, and using RPX, we make that very easy for them. Both sign-up and sharing are now one-click experiences, and it&rsquo;s great to easily bring this to our iPhone application too,&rdquo; said Phil Chambers, CTO at Qype. &ldquo;We will roll out public publishing support for Google Buzz on May 20.&rdquo; Qype's user interface for publishing a review to up to 5 social networks, including Google Buzz, using JanRain RPX Both sites enable their users to either register or login with a third party identity such as Google, Facebook, Yahoo, Twitter and leave a comment on a post. The users are then prompted to publish comments to a social network with a single click. In addition to posting activity updates to Google Buzz, the release of the API also includes support for searching on activity feeds by latitude, longitude and radius and liking or unliking an activity. Over the next few months JanRain will be releasing features that allow websites to take advantage of the rich feature set around Google Buzz activity streams to build personalized and engaging experiences for their end users. Lastly, the Google Buzz API has resulted in the adoption of community-developed protocols, formats, and standards for sharing and consuming social content on the web, including ActivityStreams, Atom, AtomPub, JSON, OAuth, PubSubHubbub, MediaRSS, PortableContacts, and more. This is a huge win for the open standards community. _____ Vidya Shivkumar Director, Product Management JanRain",
				"date" : "May 19, 2010 8:45 AM",
				"images" : 
				[
					"/sites/default/files/blog-images/rpx-social-widget-google-buzz-screenshot.JPG",
					"/sites/default/files/blog-images/divinecaroline-google-buzz.jpg",
					"/sites/default/files/blog-images/qype-google-buzz.jpg"
				]
			}
		},
		{
			"story" : 
			{
				"title" : "Five Best Practices in Online User Registration",
				"link" : "http://www.janrain.com/blogs/five-best-practices-online-user-registration",
				"creator" : "Michael Olson",
				"description" : "<p><a href=%34http://4.bp.blogspot.com/_5bYjpYVN3Uo/S-3V2PEY1NI/AAAAAAAAAOw/BbjmCQiEDL0/s1600/marketing-brief-user-registration-shot.JPG%34 onblur=%34try {parent.deselectBloggerImageGracefully();} catch(e) {}%34><img alt=%34%34 id=%34BLOGGER_PHOTO_ID_5471264250059609298%34 src=%34/sites/default/files/blog-images/marketing-brief-user-registration-shot.JPG%34 style=%34border-style: solid; border-width: 0px; margin: 0pt 0pt 10px 10px; float: right; cursor: pointer; width: 223px; height: 274px;%34 /></a>&nbsp;We just published the 2nd in our series of Marketing Briefs. This paper highlights five key best practices for websites to optimize their user registration process. By following these guidelines, websites can achieve increased registration and conversion rates, and learn more about their site audience.</p> <p> This paper is designed to be a hands-on guide for marketers, developers, product managers and anyone in between that seeks to make their site&#39;s registration process more intuitive and simple as part of an online user engagement strategy.</p> <p> The key takeaways from the paper are:</p> <ul> <li><span style=%34font-weight: bold;%34>Keep it simple, don&#39;t hide </span><span style=%34font-weight: bold;%34>it</span></li> <li style=%34font-weight: bold;%34>Provide a choice in how a user registers</li> <li style=%34font-weight: bold;%34>User interface counts</li> <li><span style=%34font-weight: bold;%34>Watch, learn and adjust</span></li> <li><span style=%34font-weight: bold;%34>Make the most of user profile data</span></li> </ul> <p>We invite you to read the new JanRain Marketing Brief and share your feedback. <a href=%34/marketing_resources/briefs/user_registration%34>Click here</a> to download the paper.</p>",
				"plainText" :"We just published the 2nd in our series of Marketing Briefs. This paper highlights five key best practices for websites to optimize their user registration process. By following these guidelines, websites can achieve increased registration and conversion rates, and learn more about their site audience. This paper is designed to be a hands-on guide for marketers, developers, product managers and anyone in between that seeks to make their site's registration process more intuitive and simple as part of an online user engagement strategy. The key takeaways from the paper are: Keep it simple, don't hide it Provide a choice in how a user registers User interface counts Watch, learn and adjust Make the most of user profile data We invite you to read the new JanRain Marketing Brief and share your feedback. Click here to download the paper.",
				"date" : "May 15, 2010 12:15 PM",
				"images" : 
				[
					"/sites/default/files/blog-images/marketing-brief-user-registration-shot.JPG"
				]
			}
		}
	]
}