"feed" :
{
	"story" : 
	{
		"title" : "Examining Trust in Social Media",
		"link" : "http://www.janrain.comblogs/examining-trust-social-media",
		"creator" : "Michael Olson",
		"description" : "<p><a href=%34http%3a%2f%2fwww.scottmonty.com%34 target=%34_blank%34>Scott Monty<%2fa>, who heads up social media efforts at <a href=%34http%3a%2f%2fwww.ford.com%34 target=%34_blank%34>Ford Motor Company<%2fa>, recently wrote a great <a href=%34http%3a%2f%2fwww.scottmonty.com%2f2010%2f08%2fwho-do-you-trust.html%34 target=%34_blank%34>blog post about trust in social media<%2fa>.%38nbsp; Monty cites data published by <a href=%34http%3a%2f%2fwww.emarketer.com%2fArticle.aspx?R=1007863%34 target=%34_blank%34>eMarketer<%2fa> displaying the most trusted sources of information for people who use social media.<%2fp>				
										<p>It comes as little surprise that the three most trusted sources of information are all peer-generated, and two of the three most popular channels are driven by friends in social network feeds. <strong>64% of people trust posts by friends in their Facebook news feed<%2fstrong>, and <strong>55% trust tweets from friends in their Twitter stream<%2fstrong>.%38nbsp; This underscores the benefit of <a href=%34%2fproducts%2fengage%34>Janrain Engage<%2fa> social publishing, and many of our customers are experiencing an average of <strong>9 new visitors to their site<%2fstrong> each time a user publishes a post to their social network.<br %2f>				
											%38nbsp;<%2fp>				
										<p><img alt=%34sources of information users trust on social media%34 src=%34%2f..%2f..%2fsites%2fdefault%2ffiles%2feMarketer%20-%20Trust%20in%20Social%20Media.gif%34 style=%34width%3a 325px; height%3a 381px;%34 %2f><%2fp>				
										<p>	We%38rsquo;re all aware that social media has flipped the paradigm for marketers.%38nbsp; Whereas brands used to have direct control over their message in traditional marketing (advertising, direct, email), social media has democratized communication and dissemination of information.%38nbsp; Essentially, the battleground for marketers is shifting from <em>owned<%2fem> and <em>paid media<%2fem> to <em>earned media<%2fem>.%38nbsp; The result is that consumers, whose opinions are expressed through blogs, microblogging sites (such as Twitter) and social networks (like Facebook ), now command great influence over how a brand is perceived by other consumers.<%2fp>				
										<p>Brands seeking to tap into this trend can leverage peer-to-peer word of mouth marketing from their website. The social publishing features of <a href=%34%2fproducts%2fengage%34>Janrain Engage<%2fa> enable a company%38rsquo;s consumers to share activities such as comments, purchases and reviews directly with friends in a channel where trust is greater %38ndash; the social network stream.<%2fp>				
										<p><img alt=%34janrain engage social publishing%34 src=%34%2f..%2f..%2fsites%2fdefault%2ffiles%2fSocial-Publishing-Demo-scaled.jpg%34 style=%34width%3a 650px; height%3a 400px;%34 %2f><br %2f>				
											%38nbsp;<br %2f>				
											Because social network news feeds function as a recommendation engine, this strategy results in an influx of highly qualified referral traffic from the social networks, helping brands break through communication barriers to reach new audiences.<%2fp>				
										<p>For those interested in reading more about this trend, <a href=%34http%3a%2f%2fwww.edelman.com%2ftrust%2f2010%2f%34 target=%34_blank%34>Edelman%38rsquo;s annual trust barometer<%2fa> also maps the power shift in the trust continuum between corporations and individuals.<%2fp>",
		"plainText" :"Scott Monty , who heads up social media efforts at  Ford Motor Company , recently wrote a great  blog post about trust in social media .&nbsp; Monty cites data published by  eMarketer  displaying the most trusted sources of information for people who use social media.  It comes as little surprise that the three most trusted sources of information are all peer-generated, and two of the three most popular channels are driven by friends in social network feeds.  64% of people trust posts by friends in their Facebook news feed , and  55% trust tweets from friends in their Twitter stream .&nbsp; This underscores the benefit of  Janrain Engage  social publishing, and many of our customers are experiencing an average of  9 new visitors to their site  each time a user publishes a post to their social network. 	&nbsp;     	We&rsquo;re all aware that social media has flipped the paradigm for marketers.&nbsp; Whereas brands used to have direct control over their message in traditional marketing (advertising, direct, email), social media has democratized communication and dissemination of information.&nbsp; Essentially, the battleground for marketers is shifting from  owned  and  paid media  to  earned media .&nbsp; The result is that consumers, whose opinions are expressed through blogs, microblogging sites (such as Twitter) and social networks (like Facebook ), now command great influence over how a brand is perceived by other consumers.  Brands seeking to tap into this trend can leverage peer-to-peer word of mouth marketing from their website. The social publishing features of  Janrain Engage  enable a company&rsquo;s consumers to share activities such as comments, purchases and reviews directly with friends in a channel where trust is greater &ndash; the social network stream.    	&nbsp; 	Because social network news feeds function as a recommendation engine, this strategy results in an influx of highly qualified referral traffic from the social networks, helping brands break through communication barriers to reach new audiences.  For those interested in reading more about this trend,  Edelman&rsquo;s annual trust barometer  also maps the power shift in the trust continuum between corporations and individuals.",
		"date" : "Aug 17, 2010 11:07 AM",
		"images" : 	
		[
			"/../../sites/default/files/eMarketer%20-%20Trust%20in%20Social%20Media.gif",
			"/../../sites/default/files/Social-Publishing-Demo-scaled.jpg"
		]
	},
	"story" : 
	{
		"title" : "Measuring the Popularity of Social Media Platforms Across the Web",
		"link" : "http://www.janrain.comblogs/measuring-popularity-social-media-platforms-across-web",
		"creator" : "Michael Olson",
		"description" : "<p>In <a href=%34%2f..%2f..%2fblogs%2fdata-industry-trends-social-media-platforms%34 target=%34_blank%34>January<%2fa> and <a href=%34%2f..%2f..%2fblogs%2fdata-reveals-trends-among-social-media-platforms%34 target=%34_blank%34>April<%2fa> of this year, we shared data on which social network or email identities people use to sign-in to websites and their preferred social networks for sharing their online activities. Today, <a href=%34http%3a%2f%2fmashable.com%2f2010%2f08%2f16%2ffacebook-login-sharing-data%2f%34 target=%34_blank%34>Mashable published an update of our data<%2fa>.<%2fp>				
										<p>Publications such as <a href=%34http%3a%2f%2fmashable.com%2f2010%2f04%2f21%2ffacebook-open-graph%2f%34 target=%34_blank%34>Mashable<%2fa>, <a href=%34http%3a%2f%2ftechcrunch.com%2f2010%2f02%2f09%2fif-google-wave-is-the-future-google-buzz-is-the-present%2f%34 target=%34_blank%34>TechCrunch<%2fa> or <a href=%34http%3a%2f%2fwww.readwriteweb.com%2farchives%2ftwitter_announces_anywhere_publishers_platform.php%34 target=%34_blank%34>ReadWriteWeb<%2fa> frequently report on new services and features launched by major social networks and web portals like Facebook, Twitter, Google and Yahoo!. In an increasingly competitive landscape, these providers of online identity are furiously working to differentiate their offerings to reach a larger audience and build sustained loyalty among existing users.%38nbsp; For marketers, digital strategists and developers managing websites for their online businesses, this has two major implications%3a<%2fp>				
										<ul>				
										<li>It has become critical to understand the tools offered by these networks and how they can be leveraged to benefit your website and improve your online ROI. Implementing these tools on your corporate website can give your organization a huge competitive advantage.<%2fli>				
										<li>Because the networks are differentiating their features (and the plumbing and APIs for these features) so rapidly, it has become increasingly challenging to incorporate these tools into your website on your own. Hosted solutions that aggregate features from each network in a write to one, add support for many model can connect your site to the social networks quickly, saving you time and money while freeing you from ongoing maintenance and optimization.<%2fli>				
										<%2ful>				
										<p>What follows here is an updated look at the most popular networks for sign-in and sharing based on the <strong>more than 250,000 websites worldwide using <a href=%34%2fproducts%2fengage%34>Janrain Engage<%2fa><%2fstrong>. This report also looks at vertical markets such as News Media, Magazine Publishers, and Music Sites, as well as geographic preferences in Europe.<br %2f>				
											%38nbsp;<br %2f>				
											<img alt=%34social media sign-in preferences%34 src=%34%2fsites%2fdefault%2ffiles%2fsign-in-preferences-janrain-customers-scaled.jpg%34 style=%34width%3a 550px; height%3a 399px;%34 %2f><br %2f>				
											Overall relative popularity of each network has held steady during the past quarter. Google remains the most preferred network with nearly 40% share. Facebook continues to be a popular option, and Yahoo!%38rsquo;s share has grown slightly since April, with 14% preferring a Yahoo! account to sign-in. While Twitter%38rsquo;s popularity in the social web ecosystem continues to rise, it still remains the 4th most popular network for sign-in across our customers%38rsquo; websites.<br %2f>				
											%38nbsp;<br %2f>				
											The story is different with media companies. On news media sites, Yahoo! is the leading choice for sign-in with 34% share. As a content-focused network, Yahoo! users proactively seek out news and timely content across the web, making it no surprise that the network performs well in this industry segment. Facebook and Google also maintain strong presences on news media sites.<%2fp>				
										<p><img alt=%34news media sign-in preferences%34 src=%34%2fsites%2fdefault%2ffiles%2fsign-in-preferences-news-media-scaled.jpg%34 style=%34width%3a 550px; height%3a 294px;%34 %2f><%2fp>				
										<p>				
											For magazine publishers, Facebook comprises 57% share of all logins. Many magazine publishers focus on lifestyle and interests, a natural pairing with Facebook users who like to share their interests with friends.<%2fp>				
										<p><img alt=%34magazine publishers sign-in preferences%34 src=%34%2fsites%2fdefault%2ffiles%2fsign-in-preferences-magazine-publishers-scaled.jpg%34 style=%34width%3a 550px; height%3a 307px;%34 %2f><br %2f>				
											%38nbsp;<br %2f>				
											On music sites (including the official communities of leading artists), Facebook and Twitter lead the pack by a considerable margin. Given that people tend to interact with these types of sites to learn about and share events, concert dates, new albums and other, it is no surprise that Facebook and Twitter have a strong lead over other networks in this vertical.<br %2f>				
											%38nbsp;<br %2f>				
											<img alt=%34music sites sign-in preferences%34 src=%34%2fsites%2fdefault%2ffiles%2fsign-in-preferences-music-sites-scaled.jpg%34 style=%34width%3a 550px; height%3a 359px;%34 %2f><br %2f>				
											%38nbsp;<%2fp>				
										<p>On retail websites, Facebook is again the leading choice for sign-in and has grown in popularity with a 5% increase from last quarter. A sizable percentage (44% combined) also prefer to login via Yahoo! and Google.<br %2f>				
											%38nbsp;<br %2f>				
											<img alt=%34retail sign-in preferences%34 src=%34%2fsites%2fdefault%2ffiles%2fsign-in-preferences-retail-scaled.jpg%34 style=%34width%3a 550px; height%3a 289px;%34 %2f><br %2f>				
											%38nbsp;<br %2f>				
											A look across Europe shows that Facebook is the most popular network for sign-in, followed by Google and Twitter.%38nbsp; Windows Live is nearly twice as popular as a sign-in provider in Europe than in the U.S. It is important to note that regional social networks like <a href=%34http%3a%2f%2fwww.hyves.nl%34 target=%34_blank%34>Hyves<%2fa> perform very well in parts of Europe, particularly in the Netherlands.%38nbsp; On certain Dutch websites, for example, Hyves is the chosen social network for sign-in by as many as 60% of web users. This sample includes media, music entertainment, online guides, social communities and technology sites in ten countries across Europe.<%2fp>				
										<p><img alt=%34europe sign-in preferences%34 src=%34%2fsites%2fdefault%2ffiles%2fsign-in-preferences-europe-scaled.jpg%34 style=%34width%3a 550px; height%3a 276px;%34 %2f><%2fp>				
										<p>%38nbsp;<br %2f>				
											The networks people prefer to sign-in to a website is only part of the equation. With the advent of social networks as a hub for content and activity sharing, companies are leveraging the sharing tools of Janrain Engage to enable their users to publish site activities (such as comments, purchases and reviews) to their friends on multiple social networks. On average, <strong>Janrain customers are realizing 9 qualified new visitors to their site from each post or social activity from a user on that site<%2fstrong>. This is word-of-mouth marketing in action, and results in a larger audience, increased page views, increased time on site and deeper engagement with your users.<br %2f>				
											%38nbsp;<br %2f>				
											The breakdown of how consumers share their online activities through Janrain Engage social publishing%3a<%2fp>				
										<p><img alt=%34social publishing sharing preferences%34 src=%34%2fsites%2fdefault%2ffiles%2fpreferred-social-networks-for-sharing-scaled.jpg%34 style=%34width%3a 550px; height%3a 309px;%34 %2f><%2fp>				
										<p>				
											While Facebook is the most popular network for social sharing (53%), Twitter, Yahoo! and MySpace on aggregate are valued as highly (52%) by people for online activity syndication.%38nbsp; It is important to note that Janrain Engage supports publishing of user activities to multiple social networks simultaneously. As an example, certain users may choose to share a purchase, article comment or product review with friends across four social networks at once.<br %2f>				
											%38nbsp;<br %2f>				
											The landscape of the social web is competitive, and social networks and web portals are aggressively competing to be the trusted hub for a consumer%38#39;s online identity. Because of this, uniform preference among web users is hard to find. In our conversations with organizations using Janrain Engage, we%38rsquo;ve found that they reach more customers and generate more revenue from their online efforts by casting a wide net across the social networks and identity providers.<br %2f>				
											%38nbsp;<br %2f>				
											We will continue to publish data on social media platform preferences on a quarterly basis, and spotlight key new verticals.<%2fp>				
										<p>%38nbsp;<br %2f>				
											<strong>Historical Reports%3a<%2fstrong><br %2f>				
											%38nbsp;<br %2f>				
											<a href=%34%2fblogs%2fdata-reveals-trends-among-social-media-platforms%34>Data Reveals Trends Among Social Media Platforms<%2fa> %38ndash; April 2010<br %2f>				
											<a href=%34%2fblogs%2fdata-industry-trends-social-media-platforms%34>Data on Industry Trends in Social Media Platforms<%2fa>%38nbsp; - January 2010<%2fp>				
										<p>	%38nbsp;<%2fp>",
		"plainText" :"In  January  and  April  of this year, we shared data on which social network or email identities people use to sign-in to websites and their preferred social networks for sharing their online activities. Today,  Mashable published an update of our data .  Publications such as  Mashable ,  TechCrunch  or  ReadWriteWeb  frequently report on new services and features launched by major social networks and web portals like Facebook, Twitter, Google and Yahoo!. In an increasingly competitive landscape, these providers of online identity are furiously working to differentiate their offerings to reach a larger audience and build sustained loyalty among existing users.&nbsp; For marketers, digital strategists and developers managing websites for their online businesses, this has two major implications:   It has become critical to understand the tools offered by these networks and how they can be leveraged to benefit your website and improve your online ROI. Implementing these tools on your corporate website can give your organization a huge competitive advantage.  Because the networks are differentiating their features (and the plumbing and APIs for these features) so rapidly, it has become increasingly challenging to incorporate these tools into your website on your own. Hosted solutions that aggregate features from each network in a write to one, add support for many model can connect your site to the social networks quickly, saving you time and money while freeing you from ongoing maintenance and optimization.   What follows here is an updated look at the most popular networks for sign-in and sharing based on the  more than 250,000 websites worldwide using  Janrain Engage  . This report also looks at vertical markets such as News Media, Magazine Publishers, and Music Sites, as well as geographic preferences in Europe. 	&nbsp; 	  	Overall relative popularity of each network has held steady during the past quarter. Google remains the most preferred network with nearly 40% share. Facebook continues to be a popular option, and Yahoo!&rsquo;s share has grown slightly since April, with 14% preferring a Yahoo! account to sign-in. While Twitter&rsquo;s popularity in the social web ecosystem continues to rise, it still remains the 4th most popular network for sign-in across our customers&rsquo; websites. 	&nbsp; 	The story is different with media companies. On news media sites, Yahoo! is the leading choice for sign-in with 34% share. As a content-focused network, Yahoo! users proactively seek out news and timely content across the web, making it no surprise that the network performs well in this industry segment. Facebook and Google also maintain strong presences on news media sites.     	For magazine publishers, Facebook comprises 57% share of all logins. Many magazine publishers focus on lifestyle and interests, a natural pairing with Facebook users who like to share their interests with friends.    	&nbsp; 	On music sites (including the official communities of leading artists), Facebook and Twitter lead the pack by a considerable margin. Given that people tend to interact with these types of sites to learn about and share events, concert dates, new albums and other, it is no surprise that Facebook and Twitter have a strong lead over other networks in this vertical. 	&nbsp; 	  	&nbsp;  On retail websites, Facebook is again the leading choice for sign-in and has grown in popularity with a 5% increase from last quarter. A sizable percentage (44% combined) also prefer to login via Yahoo! and Google. 	&nbsp; 	  	&nbsp; 	A look across Europe shows that Facebook is the most popular network for sign-in, followed by Google and Twitter.&nbsp; Windows Live is nearly twice as popular as a sign-in provider in Europe than in the U.S. It is important to note that regional social networks like  Hyves  perform very well in parts of Europe, particularly in the Netherlands.&nbsp; On certain Dutch websites, for example, Hyves is the chosen social network for sign-in by as many as 60% of web users. This sample includes media, music entertainment, online guides, social communities and technology sites in ten countries across Europe.     &nbsp; 	The networks people prefer to sign-in to a website is only part of the equation. With the advent of social networks as a hub for content and activity sharing, companies are leveraging the sharing tools of Janrain Engage to enable their users to publish site activities (such as comments, purchases and reviews) to their friends on multiple social networks. On average,  Janrain customers are realizing 9 qualified new visitors to their site from each post or social activity from a user on that site . This is word-of-mouth marketing in action, and results in a larger audience, increased page views, increased time on site and deeper engagement with your users. 	&nbsp; 	The breakdown of how consumers share their online activities through Janrain Engage social publishing:     	While Facebook is the most popular network for social sharing (53%), Twitter, Yahoo! and MySpace on aggregate are valued as highly (52%) by people for online activity syndication.&nbsp; It is important to note that Janrain Engage supports publishing of user activities to multiple social networks simultaneously. As an example, certain users may choose to share a purchase, article comment or product review with friends across four social networks at once. 	&nbsp; 	The landscape of the social web is competitive, and social networks and web portals are aggressively competing to be the trusted hub for a consumer&#39;s online identity. Because of this, uniform preference among web users is hard to find. In our conversations with organizations using Janrain Engage, we&rsquo;ve found that they reach more customers and generate more revenue from their online efforts by casting a wide net across the social networks and identity providers. 	&nbsp; 	We will continue to publish data on social media platform preferences on a quarterly basis, and spotlight key new verticals.  &nbsp; 	 Historical Reports:  	&nbsp; 	 Data Reveals Trends Among Social Media Platforms  &ndash; April 2010 	 Data on Industry Trends in Social Media Platforms &nbsp; - January 2010  	&nbsp;",
		"date" : "Aug 16, 2010 11:59 AM",
		"images" : 	
		[
			"/sites/default/files/sign-in-preferences-janrain-customers-scaled.jpg",
			"/sites/default/files/sign-in-preferences-news-media-scaled.jpg",
			"/sites/default/files/sign-in-preferences-magazine-publishers-scaled.jpg",
			"/sites/default/files/sign-in-preferences-music-sites-scaled.jpg",
			"/sites/default/files/sign-in-preferences-retail-scaled.jpg",
			"/sites/default/files/sign-in-preferences-europe-scaled.jpg",
			"/sites/default/files/preferred-social-networks-for-sharing-scaled.jpg"
		]
	},
	"story" : 
	{
		"title" : "Janrain Launches New Online Profile Management Solution, Janrain Capture",
		"link" : "http://www.janrain.comblogs/janrain-launches-new-online-profile-management-solution-janrain-capture",
		"creator" : "Michael Olson",
		"description" : "<p><img alt=%34janrain capture%34 src=%34%2fsites%2fdefault%2ffiles%2fcapture_0.png%34 style=%34padding%3a 0px 0px 20px 20px; float%3a right; width%3a 133px; height%3a 114px;%34 %2f><%2fp>				
										<p>During the past decade, organizations have evolved their online presence from static brochureware into dynamic web destinations that provide personalized and rich experiences for users. To fuel these experiences, online businesses must have a robust repository to store user profile data, preferences and behaviors.<%2fp>				
										<p>With the advent of social networks and solutions like <a href=%34%2fproducts%2fengage%34 target=%34_blank%34>Janrain Engage<%2fa>, which enable organizations to collect rich demographic and social graph information on their audience, company databases often have not been optimized to fully leverage and encapsulate this information.<%2fp>				
										<p>That%38rsquo;s where Janrain can help. Yesterday, we <a href=%34%2fpress-releases%2fjanrain-launches-new-user-management-solution-online-businesses%34>announced the release of Janrain Capture<%2fa>, a cloud-based solution that enables online businesses to store user profile data and make it actionable. Companies such as <a href=%34http%3a%2f%2fchannel.nationalgeographic.com%34 target=%34_blank%34>National Geographic Channel<%2fa>, Kodak and <a href=%34http%3a%2f%2fwww.yellowpages.ca%34 target=%34_blank%34>YellowPages.ca<%2fa> are using Janrain Capture to <a href=%34http%3a%2f%2femediavitals.com%2fblog%2f1005%2fjanrain-launches-service-capture-users-social-data%34 target=%34_blank%34>build enriching online experiences for their members<%2fa>.<%2fp>				
										<p><a href=%34http%3a%2f%2fchannel.nationalgeographic.com%34 target=%34_blank%34>National Geographic Channel<%2fa> selected <a href=%34%2fproducts%2fcapture%34>Janrain Capture<%2fa> to provide a single, flexible hosted user profile system and distribute user profile info to the National Geographic%38rsquo;s <a href=%34http%3a%2f%2fwww.pluck.com%34 target=%34_blank%34>Pluck social community platform<%2fa> and email system. National Geographic Channel is also using <a href=%34%2fproducts%2fengage%34>Janrain Engage<%2fa> to enable its users to sign in with an existing account on Facebook, Twitter, Google or other networks.<%2fp>				
										<p><img alt=%34national geographic channel%34 src=%34%2fsites%2fdefault%2ffiles%2fnatgeochannel-engage-capture.JPG%34 style=%34width%3a 600px; height%3a 413px;%34 %2f><%2fp>				
										<p><a href=%34http%3a%2f%2fwww.yellowpages.ca%34 target=%34_blank%34>YellowPages.ca<%2fa>%38trade; chose <a href=%34%2fproducts%2fcapture%34>Janrain Capture<%2fa> to add user registration and a profile system in the cloud. Janrain Capture hosts the registration screens and the profile pages, and handles the email verification process. YellowPages.ca also uses <a href=%34%2fproducts%2fengage%34>Janrain Engage<%2fa> and <a href=%34%2fproducts%2ffederate%34>Janrain Federate<%2fa> to offer login via Facebook and federated single sign on across partner sites.<%2fp>				
										<p><img alt=%34yellowpages%34 src=%34%2fsites%2fdefault%2ffiles%2fyellowpages-capture.JPG%34 style=%34width%3a 600px; height%3a 454px;%34 %2f><%2fp>				
										<p><strong>Key Features of <a href=%34%2fproducts%2fcapture%34>Janrain Capture<%2fa> include%3a<%2fstrong><%2fp>				
										<ul>				
										<li>Customizable profile database<%2fli>				
										<li>Branded registration helper screens for data capture<%2fli>				
										<li>Connectors to 3rd party systems such as Commenting, CMS, Ratings %38amp; Reviews, or Analytics<%2fli>				
										<li>Public profile pages for end users<%2fli>				
										<li>End user self-service administrative screens<%2fli>				
										<li>Safeguards and access controls for user profile data<%2fli>				
										<li>Data import tool for importing existing user databases<%2fli>				
										<li>Software as a service deployment<%2fli>				
										<%2ful>				
										<p><a href=%34%2fproducts%2fengage%34>Janrain Engage<%2fa>, <a href=%34%2fproducts%2ffederate%34>Janrain Federate<%2fa> and <a href=%34%2fproducts%2fcapture%34>Janrain Capture<%2fa> can be used separately or together in the Janrain User Management platform to help companies manage all aspects of user engagement.<%2fp>",
		"plainText" :"During the past decade, organizations have evolved their online presence from static brochureware into dynamic web destinations that provide personalized and rich experiences for users. To fuel these experiences, online businesses must have a robust repository to store user profile data, preferences and behaviors.  With the advent of social networks and solutions like  Janrain Engage , which enable organizations to collect rich demographic and social graph information on their audience, company databases often have not been optimized to fully leverage and encapsulate this information.  That&rsquo;s where Janrain can help. Yesterday, we  announced the release of Janrain Capture , a cloud-based solution that enables online businesses to store user profile data and make it actionable. Companies such as  National Geographic Channel , Kodak and  YellowPages.ca  are using Janrain Capture to  build enriching online experiences for their members .   National Geographic Channel  selected  Janrain Capture  to provide a single, flexible hosted user profile system and distribute user profile info to the National Geographic&rsquo;s  Pluck social community platform  and email system. National Geographic Channel is also using  Janrain Engage  to enable its users to sign in with an existing account on Facebook, Twitter, Google or other networks.      YellowPages.ca &trade; chose  Janrain Capture  to add user registration and a profile system in the cloud. Janrain Capture hosts the registration screens and the profile pages, and handles the email verification process. YellowPages.ca also uses  Janrain Engage  and  Janrain Federate  to offer login via Facebook and federated single sign on across partner sites.      Key Features of  Janrain Capture  include:    Customizable profile database  Branded registration helper screens for data capture  Connectors to 3rd party systems such as Commenting, CMS, Ratings &amp; Reviews, or Analytics  Public profile pages for end users  End user self-service administrative screens  Safeguards and access controls for user profile data  Data import tool for importing existing user databases  Software as a service deployment    Janrain Engage ,  Janrain Federate  and  Janrain Capture  can be used separately or together in the Janrain User Management platform to help companies manage all aspects of user engagement.",
		"date" : "Aug 11, 2010 8:40 AM",
		"images" : 	
		[
			"/sites/default/files/capture_0.png",
			"/sites/default/files/natgeochannel-engage-capture.JPG",
			"/sites/default/files/yellowpages-capture.JPG"
		]
	},
	"story" : 
	{
		"title" : "Tal.ki sees a 40% increase in website logins with Janrain Engage",
		"link" : "http://www.janrain.comblogs/talki-sees-40-increase-login-janrain-engage",
		"creator" : "Vincent Lauria",
		"description" : "<p><img alt=%34Tal.ki uses Janrain Engage%34 src=%34%2fsites%2fdefault%2ffiles%2fpartner-talki.png%34 style=%34padding-top%3a 0px; padding-right%3a 0px; padding-bottom%3a 20px; padding-left%3a 20px; float%3a right; width%3a 150px; height%3a 87px; %34 %2f><%2fp>				
											<p><em>Our partner, Vincent Lauria of Tal.ki, contributed this post for today%3a<%2fem><%2fp>				
											<p>	We%38#39;ve been running on the <a href=%34%2fjanrain-products-overview%34>Janrain platform<%2fa> for over half a year now. We use <a href=%34%2fproducts%2fengage%34>Janrain Engage<%2fa> to allow for third-party logins, such as Facebook, Twitter, Google, etc. When we first built our product, <a href=%34http%3a%2f%2ftal.ki%2f%34 target=%34_blank%34>Tal.ki Embeddable Forums<%2fa>, we made the%38nbsp;conscious%38nbsp;decision to not build our own user login system, we wanted to go the third-party route, this had two advantages%3a<%2fp>				
											<ol>				
											<li>Less development time to get to market<%2fli>				
											<li>A seamless experience for forums embedded across thousands of sites, no need to signup and create a new profile each time, just hop in and join the conversation.<%2fli>				
											<%2fol>				
											<p>At first, we directly integrated with the third-party providers and provided support for Facebook, Google, and Twitter. But <strong>we quickly learned that managing these providers required ongoing work to follow their ever-changing APIs<%2fstrong> (I%38#39;m looking at you Facebook). For a startup, that was taking significant resources. A colleague had mentioned <a href=%34http%3a%2f%2fwww.janrain.com%34>Janrain<%2fa>. I was familiar with the company from their very early work %38amp; contributions in the OpenID space. After reading up on their documentation, we really liked the idea of supporting only *one* API and letting Janrain handle the rest, from evolving APIs to adding new <a href=%34%2fsolutions%2fsupported-networks%34>providers<%2fa>. The decision was clear for us and we made the switch rapidly.<%2fp>				
											<p>We quickly became impressed with the <a href=%34%2fproducts%2fjanrain-engage%2ffeatures%34>features Janrain had to offer<%2fa>, like login analytics, and a dashboard to select and edit login network preferences. The ability to track daily logins has proved useful. It allows us to know where to focus our attention for pushing updates to a person%38#39;s activity stream. And because we support Single Sign-On (SSO), we can also track the logins of third-party companies we partner with and see how their daily activity is improving. Some of our partners include <a href=%34http%3a%2f%2fwww.weebly.com%2f%34 target=%34_blank%34>Weebly<%2fa>, <a href=%34http%3a%2f%2fwww.bligoo.com%2f%34 target=%34_blank%34>Bligoo<%2fa>, and <a href=%34http%3a%2f%2fwww.yola.com%2f%34 target=%34_blank%34>Yola<%2fa>.<%2fp>				
											<p>We%38#39;re now supporting more logins than we had ever planned, and that is important, for instance, when the Facebook privacy issue hit the mainstream news, we saw Facebook logins drop, and a handful of other logins picked up, that we wouldn%38#39;t have previously supported.<%2fp>				
											<p style=%34text-align%3a center; %34><img alt=%34%34 src=%34%2fsites%2fdefault%2ffiles%2fsoccer.jpg%34 style=%34width%3a 500px; height%3a 298px; %34 %2f><%2fp>				
											<p>We have a second product line that doesn%38#39;t have support for third-party logins, comparing the two services, I%38#39;ve noticed a few interesting things%3a<%2fp>				
											<ul>				
											<li>More visitors signing in. When we switched to third-party logins with Janrain, <strong>we saw the number of visitors who login increase by over 40%<%2fstrong>!<%2fli>				
											<li><strong>Less time with our support team<%2fstrong>. Previously, we had over 30 people%2fday with login issues that needed to head to a support site. Now with Janrain, <strong>we have not had one support issue due to login<%2fstrong>, issues like forgotten passwords, incorrect emails, expired or conflicting cookies are ting of the past.<%2fli>				
											<%2ful>				
											<p>We%38#39;re continuing to integrate more of the Janrain product line into our services, and in the past few months, I%38#39;ve had a number of colleagues tell me they%38#39;re doing the same.<%2fp>",
		"plainText" :"Our partner, Vincent Lauria of Tal.ki, contributed this post for today:   	We&#39;ve been running on the  Janrain platform  for over half a year now. We use  Janrain Engage  to allow for third-party logins, such as Facebook, Twitter, Google, etc. When we first built our product,  Tal.ki Embeddable Forums , we made the&nbsp;conscious&nbsp;decision to not build our own user login system, we wanted to go the third-party route, this had two advantages:   Less development time to get to market  A seamless experience for forums embedded across thousands of sites, no need to signup and create a new profile each time, just hop in and join the conversation.   At first, we directly integrated with the third-party providers and provided support for Facebook, Google, and Twitter. But  we quickly learned that managing these providers required ongoing work to follow their ever-changing APIs  (I&#39;m looking at you Facebook). For a startup, that was taking significant resources. A colleague had mentioned  Janrain . I was familiar with the company from their very early work &amp; contributions in the OpenID space. After reading up on their documentation, we really liked the idea of supporting only *one* API and letting Janrain handle the rest, from evolving APIs to adding new  providers . The decision was clear for us and we made the switch rapidly.  We quickly became impressed with the  features Janrain had to offer , like login analytics, and a dashboard to select and edit login network preferences. The ability to track daily logins has proved useful. It allows us to know where to focus our attention for pushing updates to a person&#39;s activity stream. And because we support Single Sign-On (SSO), we can also track the logins of third-party companies we partner with and see how their daily activity is improving. Some of our partners include  Weebly ,  Bligoo , and  Yola .  We&#39;re now supporting more logins than we had ever planned, and that is important, for instance, when the Facebook privacy issue hit the mainstream news, we saw Facebook logins drop, and a handful of other logins picked up, that we wouldn&#39;t have previously supported.     We have a second product line that doesn&#39;t have support for third-party logins, comparing the two services, I&#39;ve noticed a few interesting things:   More visitors signing in. When we switched to third-party logins with Janrain,  we saw the number of visitors who login increase by over 40% !   Less time with our support team . Previously, we had over 30 people/day with login issues that needed to head to a support site. Now with Janrain,  we have not had one support issue due to login , issues like forgotten passwords, incorrect emails, expired or conflicting cookies are ting of the past.   We&#39;re continuing to integrate more of the Janrain product line into our services, and in the past few months, I&#39;ve had a number of colleagues tell me they&#39;re doing the same.",
		"date" : "Aug 6, 2010 8:40 AM",
		"images" : 	
		[
			"/sites/default/files/partner-talki.png",
			"/sites/default/files/soccer.jpg"
		]
	},
	"story" : 
	{
		"title" : "Janrain to Speak at eTail East on August 11",
		"link" : "http://www.janrain.comblogs/janrain-speaking-etail-east-august-11",
		"creator" : "Lisa Hannah",
		"description" : "<p><img alt=%34%34 src=%34%2fsites%2fdefault%2ffiles%2f10359_005_logo.jpg%34 style=%34padding-top%3a 0px; padding-right%3a 0px; padding-bottom%3a 20px; padding-left%3a 20px; float%3a right; width%3a 155px; height%3a 55px; %34 %2f>Next week <a href=%34http%3a%2f%2fwww.janrain.com%34>Janrain<%2fa> will be speaking at <a href=%34http%3a%2f%2fwww.wbresearch.com%2fetailusaeast%2fhome.aspx%34 target=%34_blank%34>eTail East<%2fa> in Baltimore, MD, one of the largest annual internet retail conferences.<%2fp>				
											<p>Janrain CEO, Brian Kissel, will be on a panel on Wednesday, August 11 on the important topic of %38ldquo;<strong>Re-designing Your Website to Increase Conversion Rates %38amp; Better Engage Customers.<%2fstrong>%38quot; Bill Aicher, Director of Web and Marketing of <a href=%34http%3a%2f%2fMusicnotes.com%34 target=%34_blank%34>Musicnotes.com<%2fa> and Josh Himwich, Director of eCommerce Solutions of <a href=%34http%3a%2f%2fDiapers.com%34 target=%34_blank%34>Diapers.com<%2fa> will join Kissel in this discussion about identifying your strategic goals when redesigning your website and also how to engage your users throughout the purchasing process.<%2fp>				
											<p>We are looking forward to contributing to the discussions, seeing some of our retail customers, and meeting new people. Key conference themes include social media and engagement, the evolution of SEO and creating a relevant, personalized experience.<%2fp>				
											<p>If you plan on attending, <a href=%34%2fcontact-us%34>please let us know<%2fa> %38ndash; we%38rsquo;d love to connect in person.<%2fp>",
		"plainText" :"Next week  Janrain  will be speaking at  eTail East  in Baltimore, MD, one of the largest annual internet retail conferences.  Janrain CEO, Brian Kissel, will be on a panel on Wednesday, August 11 on the important topic of &ldquo; Re-designing Your Website to Increase Conversion Rates &amp; Better Engage Customers. &quot; Bill Aicher, Director of Web and Marketing of  Musicnotes.com  and Josh Himwich, Director of eCommerce Solutions of  Diapers.com  will join Kissel in this discussion about identifying your strategic goals when redesigning your website and also how to engage your users throughout the purchasing process.  We are looking forward to contributing to the discussions, seeing some of our retail customers, and meeting new people. Key conference themes include social media and engagement, the evolution of SEO and creating a relevant, personalized experience.  If you plan on attending,  please let us know  &ndash; we&rsquo;d love to connect in person.",
		"date" : "Aug 5, 2010 11:38 AM",
		"images" : 	
		[
			"/sites/default/files/10359_005_logo.jpg"
		]
	},
	"story" : 
	{
		"title" : "Janrain Helps Radio Stations Take Advantage of Social Media",
		"link" : "http://www.janrain.comblogs/janrain-helps-radio-stations-take-advantage-social-media",
		"creator" : "Lisa Hannah",
		"description" : "<p>Last week we announced a new relationship with <a href=%34http%3a%2f%2fwww.tritondigitalmedia.com%34 target=%34_blank%34>Triton Media Group<%2fa>, the leading supplier of digital products and services to the media industry. Its <a href=%34http%3a%2f%2fwww.tritondigitalmedia.com%34 target=%34_blank%34>Triton Digital<%2fa> division supports more than 6,000 radio station affiliations with applications and content.<%2fp>				
											<p>Noted media researcher and strategist, <a href=%34http%3a%2f%2fwww.markramseymedia.com%2f%34 target=%34_blank%34>Mark Ramsey<%2fa>, has interviewed execs at both companies to discuss more about how radio stations are using, or need to be using social media to remain competitive.<%2fp>				
											<p>According to Mark, %38ldquo;With social media being an increasingly important and central component of every consumer%38#39;s online experience, it%38#39;s critical for broadcasters to meet consumers where they live, nurture relationships based on who these individuals actually are, and dive into a conversation where consumers - not billboards and TV spots - become their brand ambassadors. Janrain makes that goal achievable.%38rdquo;<%2fp>				
											<p>The <a href=%34http%3a%2f%2fwww.markramseymedia.com%2f2010%2f08%2ftritons-mike-agovino-on-radios-social-media-future%2f%34 target=%34_blank%34>first video interview is with Mike Agovino, COO of Triton Media<%2fa>, and the <a href=%34http%3a%2f%2fwww.markramseymedia.com%2f2010%2f08%2fthe-power-of-social-media-finally-comes-to-radio%2f%34 target=%34_blank%34>second is with Brian Kissel, CEO of Janrain<%2fa>. Both go into detail about how radio can take advantage of their listeners%38rsquo; affiliations on different social networks to build more engaging relationships, uncover new revenue streams and connect media sites to the social web.<%2fp>				
											<p><object height=%34270%34 width=%34480%34><param name=%34allowfullscreen%34 value=%34true%34 %2f><param name=%34allowscriptaccess%34 value=%34always%34 %2f><param name=%34movie%34 value=%34http%3a%2f%2fvimeo.com%2fmoogaloop.swf?clip_id=13806473%38amp;server=vimeo.com%38amp;show_title=1%38amp;show_byline=1%38amp;show_portrait=0%38amp;color=00adef%38amp;fullscreen=1%38amp;autoplay=0%38amp;loop=0%34 %2f><embed allowfullscreen=%34true%34 allowscriptaccess=%34always%34 height=%34270%34 src=%34http%3a%2f%2fvimeo.com%2fmoogaloop.swf?clip_id=13806473%38amp;server=vimeo.com%38amp;show_title=1%38amp;show_byline=1%38amp;show_portrait=0%38amp;color=00adef%38amp;fullscreen=1%38amp;autoplay=0%38amp;loop=0%34 type=%34application%2fx-shockwave-flash%34 width=%34480%34><%2fembed><%2fobject><%2fp>				
											<p><object height=%34270%34 width=%34480%34><param name=%34allowfullscreen%34 value=%34true%34 %2f><param name=%34allowscriptaccess%34 value=%34always%34 %2f><param name=%34movie%34 value=%34http%3a%2f%2fvimeo.com%2fmoogaloop.swf?clip_id=13852757%38amp;server=vimeo.com%38amp;show_title=1%38amp;show_byline=1%38amp;show_portrait=0%38amp;color=00adef%38amp;fullscreen=1%38amp;autoplay=0%38amp;loop=0%34 %2f><embed allowfullscreen=%34true%34 allowscriptaccess=%34always%34 height=%34270%34 src=%34http%3a%2f%2fvimeo.com%2fmoogaloop.swf?clip_id=13852757%38amp;server=vimeo.com%38amp;show_title=1%38amp;show_byline=1%38amp;show_portrait=0%38amp;color=00adef%38amp;fullscreen=1%38amp;autoplay=0%38amp;loop=0%34 type=%34application%2fx-shockwave-flash%34 width=%34480%34><%2fembed><%2fobject><%2fp>",
		"plainText" :"Last week we announced a new relationship with  Triton Media Group , the leading supplier of digital products and services to the media industry. Its  Triton Digital  division supports more than 6,000 radio station affiliations with applications and content.  Noted media researcher and strategist,  Mark Ramsey , has interviewed execs at both companies to discuss more about how radio stations are using, or need to be using social media to remain competitive.  According to Mark, &ldquo;With social media being an increasingly important and central component of every consumer&#39;s online experience, it&#39;s critical for broadcasters to meet consumers where they live, nurture relationships based on who these individuals actually are, and dive into a conversation where consumers - not billboards and TV spots - become their brand ambassadors. Janrain makes that goal achievable.&rdquo;  The  first video interview is with Mike Agovino, COO of Triton Media , and the  second is with Brian Kissel, CEO of Janrain . Both go into detail about how radio can take advantage of their listeners&rsquo; affiliations on different social networks to build more engaging relationships, uncover new revenue streams and connect media sites to the social web.",
		"date" : "Aug 4, 2010 9:02 AM",
	},
	"story" : 
	{
		"title" : "Triton Digital Media Ramps up Social Media Presence with Janrain Engage",
		"link" : "http://www.janrain.comblogs/triton-digital-media-ramps-social-media-presence",
		"creator" : "Michael Olson",
		"description" : "<p><img alt=%34triton digital media%34 src=%34%2f..%2f..%2fsites%2fdefault%2ffiles%2ftriton-digital.JPG%34 style=%34padding%3a 0pt 0pt 20px 20px; width%3a 180px; height%3a 78px; float%3a right;%34 %2f><%2fp>				
											<p>Today, it was announced that <a href=%34http%3a%2f%2fwww.prweb.com%2freleases%2f2010%2f07%2fprweb4316704.htm%34 target=%34_blank%34>Triton Digital Media plans to integrate Janrain Engage<%2fa> authentication and social publishing functionality into its Loyalty Program, enabling <a href=%34http%3a%2f%2fwww.allaccess.com%2fnet-news%2farchive%2fstory%2f78640%2ftriton-digital-ramps-up-social-media-presence-with%34 target=%34_blank%34>Triton Digital%38#39;s radio affiliates to connect their website to the social web<%2fa> by making it easy for visitors to sign up with an existing social network identity and share their site activities with friends on multiple social networks.<%2fp>				
											<p>One of the challenges for marketers, content managers and digital strategists at radio companies today is how to monetize their content and drive additional revenue streams that augment sales of radio advertising spots. <a href=%34http%3a%2f%2fwww.tritondigitalmedia.com%34 target=%34_blank%34>Triton Digital Media<%2fa>%38#39;s platform helps radio companies foster engagement and optimize their corporate web presence, and its Loyalty Program includes a CMS, ad serving and e-commerce to help radio stations drive a larger percentage of revenues from their online presence. Triton Digital currently supports more than 6,000 radio station affiliates across the U.S.<%2fp>				
											<p>	A few months ago, Jim Kerr, VP Stategy at Triton Digital Media, touched upon the digital revolution that is starting to occur in the radio industry%3a<%2fp>				
											<p><embed allowfullscreen=%34true%34 allowscriptaccess=%34always%34 height=%34300%34 src=%34http%3a%2f%2fblip.tv%2fplay%2fulOBsL5sAg%34 type=%34application%2fx-shockwave-flash%34 width=%34480%34><%2fembed><%2fp>				
											<p>	At the 5%3a30 mark in the discussion, the interviewer notes an example of a radio company%38#39;s use of Facebook ads to promote its Facebook page. In the example, the metric for success was based on the number of impressions and new visitors that the Facebook ad campaign generated on Facebook. By not also pointing listeners to the radio station%38#39;s corporate site, where personalized content and targeted ads can be served, a revenue opportunity was missed.<%2fp>				
											<p>	Kerr points out that radio stations have historically lacked tools to continue conversations from the social networks and engage listeners on their own site - where they control the playing field, originate content and serve ads. <a href=%34http%3a%2f%2ftritondigitalmedia.com%2finteractive%2f%34 target=%34_blank%34>Triton%38#39;s solutions<%2fa> address this challenge by making it easy for radio stations to create and publish engaging content on their corporate site. <a href=%34%2fproducts%2fengage%34>Janrain Engage<%2fa> enables increased registration rates and user interactions on that site to be shared virally on the social networks, thus creating a steady stream of qualified referral traffic back to the radio affiliate site.<%2fp>				
											<p>	<a href=%34http%3a%2f%2fwww.markramseymedia.com%34 target=%34_blank%34>The interviewer<%2fa> closes the conversation with Kerr by noting a mantra in comedy that %38quot;a joke only works if you commit to it.%38quot; The same applies when it comes to social media%38nbsp; Radio stations can gain a competitive advantage by incorporating social media tools that extend the conversation beyond a Facebook or Twitter page and drive engagement back on their own website. Triton Digital Media%38#39;s solutions, enhanced with Janrain Engage, make this possible.<%2fp>",
		"plainText" :"Today, it was announced that  Triton Digital Media plans to integrate Janrain Engage  authentication and social publishing functionality into its Loyalty Program, enabling  Triton Digital&#39;s radio affiliates to connect their website to the social web  by making it easy for visitors to sign up with an existing social network identity and share their site activities with friends on multiple social networks.  One of the challenges for marketers, content managers and digital strategists at radio companies today is how to monetize their content and drive additional revenue streams that augment sales of radio advertising spots.  Triton Digital Media &#39;s platform helps radio companies foster engagement and optimize their corporate web presence, and its Loyalty Program includes a CMS, ad serving and e-commerce to help radio stations drive a larger percentage of revenues from their online presence. Triton Digital currently supports more than 6,000 radio station affiliates across the U.S.  	A few months ago, Jim Kerr, VP Stategy at Triton Digital Media, touched upon the digital revolution that is starting to occur in the radio industry:      	At the 5:30 mark in the discussion, the interviewer notes an example of a radio company&#39;s use of Facebook ads to promote its Facebook page. In the example, the metric for success was based on the number of impressions and new visitors that the Facebook ad campaign generated on Facebook. By not also pointing listeners to the radio station&#39;s corporate site, where personalized content and targeted ads can be served, a revenue opportunity was missed.  	Kerr points out that radio stations have historically lacked tools to continue conversations from the social networks and engage listeners on their own site - where they control the playing field, originate content and serve ads.  Triton&#39;s solutions  address this challenge by making it easy for radio stations to create and publish engaging content on their corporate site.  Janrain Engage  enables increased registration rates and user interactions on that site to be shared virally on the social networks, thus creating a steady stream of qualified referral traffic back to the radio affiliate site.  	 The interviewer  closes the conversation with Kerr by noting a mantra in comedy that &quot;a joke only works if you commit to it.&quot; The same applies when it comes to social media&nbsp; Radio stations can gain a competitive advantage by incorporating social media tools that extend the conversation beyond a Facebook or Twitter page and drive engagement back on their own website. Triton Digital Media&#39;s solutions, enhanced with Janrain Engage, make this possible.",
		"date" : "Jul 30, 2010 1:27 AM",
		"images" : 	
		[
			"/../../sites/default/files/triton-digital.JPG"
		]
	},
	"story" : 
	{
		"title" : "The 8 Success Criteria for Facebook Page Marketing from Altimeter Group",
		"link" : "http://www.janrain.comblogs/8-success-criteria-facebook-page-marketing-altimeter-group",
		"creator" : "Lisa Hannah",
		"description" : "<p><img alt=%34%34 src=%34%2fsites%2fdefault%2ffiles%2faltimeter.gif%34 style=%34padding-top%3a 0px; padding-right%3a 0px; padding-bottom%3a 20px; padding-left%3a 20px; float%3a right; width%3a 180px; height%3a 233px; %34 %2f>Today the <a href=%34http%3a%2f%2fwww.altimetergroup.com%2f%34 target=%34_blank%34>Altimeter Group<%2fa> published a new report%3a <strong><em><a href=%34http%3a%2f%2fwww.web-strategist.com%2fblog%2f2010%2f07%2f27%2faltimeter-report-the-8-success-criteria-for-facebook-page-marketing%2f%34 target=%34_blank%34>The 8 Success Criteria for Facebook Page Marketing<%2fa><%2fem><%2fstrong>. Drawing on input from 34 vendors (including <a href=%34http%3a%2f%2fwww.janrain.com%34>Janrain<%2fa>), agencies and experts, Altimeter defines the golden rules for getting the most out of your Facebook marketing efforts and tests the maturity level of 30 top brands across this criteria.<%2fp>				
											<p>Citing real world examples from the likes of Pampers, Target, Sears and Macys, Altimeter does a nice job of packaging up best practices in this area. The bottom line is that most companies still have a ways to go to fully tap into the marketing engine inside Facebook.<%2fp>				
											<p>Considering that 68% of consumers with a Facebook account say a positive referral from a Facebook friend would make them more likely to buy from or visit a retailer, this is clearly something all marketers need to figure out quickly.<%2fp>				
											<p>On the bright side, it isn%38rsquo;t rocket science, and the report includes practical tips and pointers that are relevant to any organization, regardless of size or industry.<%2fp>				
											<p>A final recommendation is to%3a<%2fp>				
											<p><strong><em>Connect the Facebook experience with existing efforts, like your corporate website.<br %2f>				
												<%2fem><%2fstrong><em>Customers want to connect to their friends on Facebook and beyond. As you become advanced, you must integrate Facebook features into your corporate website providing opportunities for instant engagement and word of mouth. However, don%38rsquo;t foolishly send away your hard-earned traffic to Facebook without a strategy. Instead aggregate Facebook discussions right on your corporate website.<%2fem><%2fp>				
											<p><a href=%34%2fproducts%2fengage%34>Janrain Engage<%2fa> does just that and more %38ndash; <a href=%34%2fproducts%2fengage%34>learn more here<%2fa>.<%2fp>				
											<p>Check out the Altimeter Slideshare presentation here%3a<%2fp>				
											<div id=%34__ss_4850455%34 style=%34width%3a477px%34><strong style=%34display%3ablock;margin%3a12px 0 4px%34><a href=%34http%3a%2f%2fwww.slideshare.net%2fjeremiah_owyang%2fthe-8-success-criteria-for-facebook-page-marketing%34 title=%34The 8 Success Criteria For Facebook Page Marketing  %34>The 8 Success Criteria For Facebook Page Marketing <%2fa><%2fstrong>				
											<object height=%34510%34 id=%34__sse4850455%34 width=%34477%34><param name=%34movie%34 value=%34http%3a%2f%2fstatic.slidesharecdn.com%2fswf%2fdoc_player.swf?doc=facebookreportfinal-100727110656-phpapp02%38amp;stripped_title=the-8-success-criteria-for-facebook-page-marketing%34 %2f><param name=%34allowFullScreen%34 value=%34true%34 %2f><param name=%34allowScriptAccess%34 value=%34always%34 %2f><embed allowfullscreen=%34true%34 allowscriptaccess=%34always%34 flashvars=%34gig_lt=1280258515269%38amp;gig_pt=1280258518699%38amp;gig_g=2%34 height=%34510%34 name=%34__sse4850455%34 src=%34http%3a%2f%2fstatic.slidesharecdn.com%2fswf%2fdoc_player.swf?doc=facebookreportfinal-100727110656-phpapp02%38amp;stripped_title=the-8-success-criteria-for-facebook-page-marketing%34 type=%34application%2fx-shockwave-flash%34 width=%34477%34><%2fembed> <param name=%34FlashVars%34 value=%34gig_lt=1280258515269%38amp;gig_pt=1280258518699%38amp;gig_g=2%34 %2f><%2fobject><%2fdiv>",
		"plainText" :"Today the  Altimeter Group  published a new report:    The 8 Success Criteria for Facebook Page Marketing   . Drawing on input from 34 vendors (including  Janrain ), agencies and experts, Altimeter defines the golden rules for getting the most out of your Facebook marketing efforts and tests the maturity level of 30 top brands across this criteria.  Citing real world examples from the likes of Pampers, Target, Sears and Macys, Altimeter does a nice job of packaging up best practices in this area. The bottom line is that most companies still have a ways to go to fully tap into the marketing engine inside Facebook.  Considering that 68% of consumers with a Facebook account say a positive referral from a Facebook friend would make them more likely to buy from or visit a retailer, this is clearly something all marketers need to figure out quickly.  On the bright side, it isn&rsquo;t rocket science, and the report includes practical tips and pointers that are relevant to any organization, regardless of size or industry.  A final recommendation is to:    Connect the Facebook experience with existing efforts, like your corporate website. 	   Customers want to connect to their friends on Facebook and beyond. As you become advanced, you must integrate Facebook features into your corporate website providing opportunities for instant engagement and word of mouth. However, don&rsquo;t foolishly send away your hard-earned traffic to Facebook without a strategy. Instead aggregate Facebook discussions right on your corporate website.    Janrain Engage  does just that and more &ndash;  learn more here .  Check out the Altimeter Slideshare presentation here:    The 8 Success Criteria For Facebook Page Marketing",
		"date" : "Jul 27, 2010 7:14 AM",
		"images" : 	
		[
			"/sites/default/files/altimeter.gif"
		]
	},
	"story" : 
	{
		"title" : "Mapping the Future of the Social Web",
		"link" : "http://www.janrain.commapping-future-of-the-social-web",
		"creator" : "Ivan",
		"description" : "<p><em><img alt=%34Federated Social Web Summit%34 src=%34%2fsites%2fdefault%2ffiles%2ffsws.gif%34 style=%34padding-top%3a 0px; padding-right%3a 0px; padding-bottom%3a 20px; padding-left%3a 20px; float%3a right; width%3a 180px; height%3a 238px; %34 %2f><%2fem><%2fp>				
											<p><em>Janrain software engineer Ivan Pulleyn attended the <a href=%34http%3a%2f%2ffederatedsocialweb.net%2fwiki%2fFederated_Social_Web_Summit_2010%34 target=%34_blank%34>Federated Social Web Summit<%2fa> in Portland, Oregon last week.%38nbsp; Below is a recap of Ivan%38#39;s experience at the event%3a<%2fem><%2fp>				
											<p>_____________<%2fp>				
											<p>Imagine you%38#39;re backpacking through the mountains in a distant country. You catch the only bus from a small village that is headed toward the coast. The bus is crowded with locals and their luggage, but you coincidentally find yourself seated next to another expatriate like yourself. She%38#39;s traveling in the same direction, but planning to head further South. The two of you hit it off and you soon find yourself lost in conversation. Hours later, you suddenly realize you%38#39;re at your stop. The bus driver won%38#39;t wait; he has a schedule to keep. You have to get off immediately, but you want to continue the conversation. You have a pen and nothing to write on but your arm. What%38#39;s the one piece of information you ask for so you have any hope of getting back in touch?<%2fp>				
											<p>	This was the thought experiment presented by <a href=%34http%3a%2f%2fwww.crunchbase.com%2fperson%2fblaine-cook%34 target=%34_blank%34>Blaine Cook<%2fa> at the <a href=%34http%3a%2f%2ffederatedsocialweb.net%2fwiki%2fMain_Page%34 target=%34_blank%34>Federated Social Web Summit<%2fa> (FSWS) here in Portland. It%38#39;s meant to illustrate a central theme that occupied much of the discussions at the summit%3a how do people identify each other and share information on the social web? If someone asks me for my contact information, do I give out my cell phone number, my personal email address or my work email address? How about my Twitter handle, or my employer%38#39;s URL? Would I give out different information to a friend than to a colleague? Would the information vary if I was overseas rather than home here in Portland? The answers to these questions seem simple on the surface, but once you dig a little deeper, things become more complicated. The social web is imbued with varied and dynamic context and, as such, emerging methodologies, protocols and user experiences must adapt to a new set of challenges.<%2fp>				
											<p>	The FSWS was facilitated by the technical team from <a href=%34http%3a%2f%2fStatus.net%34 target=%34_blank%34>Status.net<%2fa> to %38quot;to coordinate the development of the federated social web.%38quot; It was organized as a one day event preceding <a href=%34http%3a%2f%2fwww.oscon.com%2foscon2010%34 target=%34_blank%34>OSCON<%2fa>, with invitations going out to a varied group of technical innovators at companies and academic institutions working on relevant protocols or architectures. I was curious to see how this rather broad agenda would manifest itself given the short amount of time we had together. The day opened with <a href=%34http%3a%2f%2fstatus.net%2fusers%2fevan%34 target=%34_blank%34>Evan Prodromou<%2fa>, Founder of <a href=%34http%3a%2f%2fStatus.net%34 target=%34_blank%34>StatusNet<%2fa>, sketching out a plan for the day. Each group gave a short presentation showing off their work in social federation. By lunch time I had seen presentations from StatusNet, Google, DiSo, Appleseed, Facebook, Diaspora, Six Apart, Mozilla, Microsoft, GNU Social, the Personal Data Store Project and @versionvega, among others. I presented a brief history of <a href=%34http%3a%2f%2fwww.janrain.com%34>Janrain%38#39;s<%2fa> involvement in <a href=%34http%3a%2f%2fopenid.net%2f%34 target=%34_blank%34>OpenID<%2fa> and described some of the challenges we%38#39;ve had to overcome in order to support a <a href=%34%2fsolutions%2fsupported-networks%34>large array of social media platforms<%2fa>.<%2fp>				
											<p>	The afternoon agenda for the summit was generated democratically, in real-time through the use of <a href=%34http%3a%2f%2fwww.google.com%2fmoderator%2f%34 target=%34_blank%34>Google Moderator<%2fa>. Participants posted ideas for breakout sessions and we voted the topics up or down. Some common themes bubbled to the top and we eventually chose nine different tracks for detailed discussion. My interest in is protocols, so I attended three of the protocol-related tracks. The discussions centered around two major areas of pain%3a how to do end-user identifier discovery and how to avoid the problem of <a href=%34http%3a%2f%2foauth.net%2f%34 target=%34_blank%34>OAuth<%2fa> pre-registration. Both need to be solved before a truly open, federated social web can emerge.<%2fp>				
											<p>	In the first session, Blaine Cook proposed a method for private <a href=%34http%3a%2f%2fcode.google.com%2fp%2fpubsubhubbub%2f%34 target=%34_blank%34>PubSubHubbub<%2fa> subscriptions using <a href=%34http%3a%2f%2fcode.google.com%2fp%2fwebfinger%2fwiki%2fWebFingerProtocol%34 target=%34_blank%34>WebFinger<%2fa> for discovery and server dialbacks to verify the identity of the subscriber that involved an innovative use of the HTTP From%3a header. He proceeded to walk through an example of how person A could subscribe to person B%38#39;s address book in an open, yet verifiable way, with person B being able to approve or deny access asynchronously. Following that presentation, <a href=%34http%3a%2f%2fwww.google.com%2fprofiles%2fbslatkin%34 target=%34_blank%34>Brett Slatkin<%2fa> of Google proposed a more complicated version of the same use case, this time using OAuth. Martin Atkins, of Six Apart, presented a third protocol idea, this time where the end-user approves a domain for access rather than another user. This was followed by a presentation on distributed comments using <a href=%34http%3a%2f%2fwww.salmon-protocol.org%2f%34 target=%34_blank%34>Salmon Protocol<%2fa> by Joseph Smarr of Google. Other participants included Maxwell Salzberg of Diaspora, David Recordon of Facebook, Rob Dolin of Miscrosoft and Bear of XMPP fame.<%2fp>				
											<p>	At the close of the day, we reconvened and Evan proposed a challenge to the group. Dave Recordon had recommended a simple social federation use case and we decided to call it the <a href=%34http%3a%2f%2ffederatedsocialweb.net%2fwiki%2fSWAT0%34 target=%34_blank%34>Social Web Acid Test, level 0<%2fa> -- SWAT0 for short. The challenge is %38quot;to have as many discrete pairs of implementations pass the test by September 30, 2010.%38quot; SWAT0 is a simple use case that has been implemented many times by proprietary social networks%3a two users sharing and tagging photos. The real challenge is to build this in a truly open, federated manner. I strongly encourage those with interest in the technical aspects of the social web participate in this effort by <a href=%34http%3a%2f%2fgroups.google.com%2fgroup%2ffederated-social-web?pli=1%34 target=%34_blank%34>joining the mailing list<%2fa> or even building independent implementations. As FSWS closed, we enjoyed a demo of <a href=%34http%3a%2f%2fwww.joindiaspora.com%2f%34 target=%34_blank%34>Diaspora<%2fa> in action, followed by drinks and conversation at a local venue. I left feeling inspired to participate in this emergent collaboration.<%2fp>				
											<p>	Now back to our thought experiment%3a As you watch the bus pull away, a cloud of dust settles onto the dirt road. The sun is beating down on you as you struggle with your overstuffed backpack. You look down at your arm. What%38#39;s written there?<%2fp>				
											<p>	<strong>More Info%3a<%2fstrong><%2fp>				
											<ul>				
											<li><a href=%34http%3a%2f%2fstatus.net%2f2010%2f07%2f21%2ffederated-social-web-summit-wrapup%34 target=%34_blank%34>Evan Prodromou%38#39;s Wrap-up of FSWS<%2fa><%2fli>				
											<li><a href=%34http%3a%2f%2ffederatedsocialweb.net%2fwiki%2fMain_Page%34 target=%34_blank%34>Federated Social Web wiki<%2fa><%2fli>				
											<li><a href=%34http%3a%2f%2ffederatedsocialweb.net%2fwiki%2fSWAT0%34 target=%34_blank%34>FSWS SWAT0<%2fa><%2fli>				
											<li><a href=%34https%3a%2f%2fdocs.google.com%2fdocument%2fpub?id=1HrVmSCQM2r5bCnQk5uZPbhH0sGVHHFOGhxJ0thoKEO8%38amp;embedded=true%34 target=%34_blank%34>John Panzer and Brett Slatkin%38#39;s PubSubHubbub for Private feeds<%2fa><%2fli>				
											<li><a href=%34http%3a%2f%2fcode.google.com%2fp%2fwebfinger%2fwiki%2fWebFingerProtocol%34 target=%34_blank%34>WebFinger Protocol<%2fa><br %2f>				
													%38nbsp;<%2fli>				
											<%2ful>",
		"plainText" :"Janrain software engineer Ivan Pulleyn attended the  Federated Social Web Summit  in Portland, Oregon last week.&nbsp; Below is a recap of Ivan&#39;s experience at the event:   _____________  Imagine you&#39;re backpacking through the mountains in a distant country. You catch the only bus from a small village that is headed toward the coast. The bus is crowded with locals and their luggage, but you coincidentally find yourself seated next to another expatriate like yourself. She&#39;s traveling in the same direction, but planning to head further South. The two of you hit it off and you soon find yourself lost in conversation. Hours later, you suddenly realize you&#39;re at your stop. The bus driver won&#39;t wait; he has a schedule to keep. You have to get off immediately, but you want to continue the conversation. You have a pen and nothing to write on but your arm. What&#39;s the one piece of information you ask for so you have any hope of getting back in touch?  	This was the thought experiment presented by  Blaine Cook  at the  Federated Social Web Summit  (FSWS) here in Portland. It&#39;s meant to illustrate a central theme that occupied much of the discussions at the summit: how do people identify each other and share information on the social web? If someone asks me for my contact information, do I give out my cell phone number, my personal email address or my work email address? How about my Twitter handle, or my employer&#39;s URL? Would I give out different information to a friend than to a colleague? Would the information vary if I was overseas rather than home here in Portland? The answers to these questions seem simple on the surface, but once you dig a little deeper, things become more complicated. The social web is imbued with varied and dynamic context and, as such, emerging methodologies, protocols and user experiences must adapt to a new set of challenges.  	The FSWS was facilitated by the technical team from  Status.net  to &quot;to coordinate the development of the federated social web.&quot; It was organized as a one day event preceding  OSCON , with invitations going out to a varied group of technical innovators at companies and academic institutions working on relevant protocols or architectures. I was curious to see how this rather broad agenda would manifest itself given the short amount of time we had together. The day opened with  Evan Prodromou , Founder of  StatusNet , sketching out a plan for the day. Each group gave a short presentation showing off their work in social federation. By lunch time I had seen presentations from StatusNet, Google, DiSo, Appleseed, Facebook, Diaspora, Six Apart, Mozilla, Microsoft, GNU Social, the Personal Data Store Project and @versionvega, among others. I presented a brief history of  Janrain&#39;s  involvement in  OpenID  and described some of the challenges we&#39;ve had to overcome in order to support a  large array of social media platforms .  	The afternoon agenda for the summit was generated democratically, in real-time through the use of  Google Moderator . Participants posted ideas for breakout sessions and we voted the topics up or down. Some common themes bubbled to the top and we eventually chose nine different tracks for detailed discussion. My interest in is protocols, so I attended three of the protocol-related tracks. The discussions centered around two major areas of pain: how to do end-user identifier discovery and how to avoid the problem of  OAuth  pre-registration. Both need to be solved before a truly open, federated social web can emerge.  	In the first session, Blaine Cook proposed a method for private  PubSubHubbub  subscriptions using  WebFinger  for discovery and server dialbacks to verify the identity of the subscriber that involved an innovative use of the HTTP From: header. He proceeded to walk through an example of how person A could subscribe to person B&#39;s address book in an open, yet verifiable way, with person B being able to approve or deny access asynchronously. Following that presentation,  Brett Slatkin  of Google proposed a more complicated version of the same use case, this time using OAuth. Martin Atkins, of Six Apart, presented a third protocol idea, this time where the end-user approves a domain for access rather than another user. This was followed by a presentation on distributed comments using  Salmon Protocol  by Joseph Smarr of Google. Other participants included Maxwell Salzberg of Diaspora, David Recordon of Facebook, Rob Dolin of Miscrosoft and Bear of XMPP fame.  	At the close of the day, we reconvened and Evan proposed a challenge to the group. Dave Recordon had recommended a simple social federation use case and we decided to call it the  Social Web Acid Test, level 0  -- SWAT0 for short. The challenge is &quot;to have as many discrete pairs of implementations pass the test by September 30, 2010.&quot; SWAT0 is a simple use case that has been implemented many times by proprietary social networks: two users sharing and tagging photos. The real challenge is to build this in a truly open, federated manner. I strongly encourage those with interest in the technical aspects of the social web participate in this effort by  joining the mailing list  or even building independent implementations. As FSWS closed, we enjoyed a demo of  Diaspora  in action, followed by drinks and conversation at a local venue. I left feeling inspired to participate in this emergent collaboration.  	Now back to our thought experiment: As you watch the bus pull away, a cloud of dust settles onto the dirt road. The sun is beating down on you as you struggle with your overstuffed backpack. You look down at your arm. What&#39;s written there?  	 More Info:     Evan Prodromou&#39;s Wrap-up of FSWS    Federated Social Web wiki    FSWS SWAT0    John Panzer and Brett Slatkin&#39;s PubSubHubbub for Private feeds    WebFinger Protocol  		&nbsp;",
		"date" : "Jul 26, 2010 11:34 AM",
		"images" : 	
		[
			"/sites/default/files/fsws.gif"
		]
	},
	"story" : 
	{
		"title" : "How Interscope Records Improves Customer Acquisition with Janrain Solutions",
		"link" : "http://www.janrain.comblogs/how-interscope-records-improves-customer-acquisition-janrain-solutions",
		"creator" : "Michael Olson",
		"description" : "<p>Yesterday at the <a href=%34http%3a%2f%2fwww.cloudidentitysummit.com%2f%34 target=%34_blank%34>Cloud Identity Summit<%2fa> in Denver, Colorado, Lee Hammond from <a href=%34http%3a%2f%2fwww.interscope.com%34 target=%34_blank%34>Interscope Geffen A%38amp;M Records<%2fa> (a division of Universal Music Group), and Brian Kissel, CEO of <a href=%34http%3a%2f%2fwww.janrain.com%34>Janrain<%2fa>, spoke jointly about the use of social media tools to improve customer acquisition and retainment. Hammond shared Interscope%38#39;s experience to achieve these goals, beginning with a native OpenID implementation and resulting in a relationship with <a href=%34http%3a%2f%2fwww.janrain.com%34>Janrain<%2fa>.<%2fp>				
											<p>Beginning in 2007, Interscope Records began accepting AOL identities for login on its 125 music artist websites through an in-house implementation of OpenID. Below is a screenshot of Interscope%38#39;s third-party login system on Eve.com in 2007%3a<%2fp>				
											<p><img alt=%34Eve.com's old login process%34 src=%34%2fsites%2fdefault%2ffiles%2finterscope-1_1.JPG%34 style=%34width%3a 550px; height%3a 293px;%34 %2f><%2fp>				
											<p>	And on another site%3a<%2fp>				
											<p><img alt=%34rooney%34 src=%34%2fsites%2fdefault%2ffiles%2finterscope-2_0.JPG%34 style=%34width%3a 550px; height%3a 351px;%34 %2f><%2fp>				
											<p>	By 2008, with additional social networks (such as Facebook, Google and MySpace) becoming available for login, Interscope sought to leverage the new identity providers, make the user experience more intuitive, and minimize the challenge of scaling and maintaining the system.<%2fp>				
											<p>Interscope turned to <a href=%34%2fproducts%2fengage%34>Janrain Engage<%2fa> in late 2008. Choosing Janrain has enabled Interscope to <strong>instantly leverage additional social networks<%2fstrong> (such as Twitter and Windows Live) as they become available and outsource maintenance of the disparate APIs from each network.<%2fp>				
											<p>The result? <strong>55% of all logins across 125 music artist sites occur through <a href=%34%2fproducts%2fengage%34>Janrain Engage<%2fa><%2fstrong>, with that percentage as high as <a href=%34http%3a%2f%2fwww.readwriteweb.com%2fcloud%2f2010%2f02%2flady-gaga-facebook-login-twitter.php%34 target=%34_blank%34><strong>89% on sites like LadyGaga.com<%2fstrong><%2fa>. Overall <strong>registration rates on all artist sites have improved by 10%<%2fstrong>, in part due to the intuitive user interface provided by <a href=%34%2fproducts%2fengage%34>Janrain Engage<%2fa>%3a<%2fp>				
											<p><img alt=%34lady gaga%34 src=%34%2fsites%2fdefault%2ffiles%2finterscope-3_0.JPG%34 style=%34width%3a 550px; height%3a 435px;%34 %2f><%2fp>				
											<p>%38nbsp;<%2fp>				
											<p>Here are slides from the presentation at Cloud Identity Summit%3a<%2fp>				
											<div id=%34__ss_4817856%34 style=%34width%3a 425px;%34><strong style=%34margin%3a 12px 0pt 4px; display%3a block;%34><a href=%34http%3a%2f%2fwww.slideshare.net%2flhannah%2fjanrain-and-interscope-records-cloud-identity-summit-presentation-july-2010%34 title=%34Janrain and Interscope Records Cloud Identity Summit presentation July 2010%34>Janrain and Interscope Records Cloud Identity Summit presentation July 2010<%2fa><%2fstrong>				
											<object height=%34355%34 id=%34__sse4817856%34 width=%34425%34><param name=%34movie%34 value=%34http%3a%2f%2fstatic.slidesharecdn.com%2fswf%2fssplayer2.swf?doc=janrainandinterscoperecordscloudidentitysummitpresentationjuly2010-100722130945-phpapp02%38amp;stripped_title=janrain-and-interscope-records-cloud-identity-summit-presentation-july-2010%34 %2f><param name=%34allowFullScreen%34 value=%34true%34 %2f><param name=%34allowScriptAccess%34 value=%34always%34 %2f><embed allowfullscreen=%34true%34 allowscriptaccess=%34always%34 height=%34355%34 name=%34__sse4817856%34 src=%34http%3a%2f%2fstatic.slidesharecdn.com%2fswf%2fssplayer2.swf?doc=janrainandinterscoperecordscloudidentitysummitpresentationjuly2010-100722130945-phpapp02%38amp;stripped_title=janrain-and-interscope-records-cloud-identity-summit-presentation-july-2010%34 type=%34application%2fx-shockwave-flash%34 width=%34425%34><%2fembed><%2fobject><%2fdiv>				
											<p><a href=%34%2fsites%2fdefault%2ffiles%2fSuccess-Story_IGA.pdf%34 onclick=%34gaTrack(this, '%2fdownloads%2fSuccess-Story_IGA');%34><br %2f>				
												Click here<%2fa> to read more about Interscope%38#39;s success with <a href=%34%2fproducts%2fengage%34>Janrain Engage<%2fa>.<%2fp>",
		"plainText" :"Yesterday at the  Cloud Identity Summit  in Denver, Colorado, Lee Hammond from  Interscope Geffen A&amp;M Records  (a division of Universal Music Group), and Brian Kissel, CEO of  Janrain , spoke jointly about the use of social media tools to improve customer acquisition and retainment. Hammond shared Interscope&#39;s experience to achieve these goals, beginning with a native OpenID implementation and resulting in a relationship with  Janrain .  Beginning in 2007, Interscope Records began accepting AOL identities for login on its 125 music artist websites through an in-house implementation of OpenID. Below is a screenshot of Interscope&#39;s third-party login system on Eve.com in 2007:     	And on another site:     	By 2008, with additional social networks (such as Facebook, Google and MySpace) becoming available for login, Interscope sought to leverage the new identity providers, make the user experience more intuitive, and minimize the challenge of scaling and maintaining the system.  Interscope turned to  Janrain Engage  in late 2008. Choosing Janrain has enabled Interscope to  instantly leverage additional social networks  (such as Twitter and Windows Live) as they become available and outsource maintenance of the disparate APIs from each network.  The result?  55% of all logins across 125 music artist sites occur through  Janrain Engage  , with that percentage as high as   89% on sites like LadyGaga.com  . Overall  registration rates on all artist sites have improved by 10% , in part due to the intuitive user interface provided by  Janrain Engage :     &nbsp;  Here are slides from the presentation at Cloud Identity Summit:    Janrain and Interscope Records Cloud Identity Summit presentation July 2010             	Click here  to read more about Interscope&#39;s success with  Janrain Engage .",
		"date" : "Jul 22, 2010 9:24 AM",
		"images" : 	
		[
			"/sites/default/files/interscope-1_1.JPG",
			"/sites/default/files/interscope-2_0.JPG",
			"/sites/default/files/interscope-3_0.JPG"
		]
	},
	"story" : 
	{
		"title" : "Tutorial on Janrain Engage Wordpress Plugin",
		"link" : "http://www.janrain.comblogs/tutorial-janrain-engage-wordpress-plugin",
		"creator" : "Michael Olson",
		"description" : "<p><a href=%34http%3a%2f%2fteachmewp.com%34>TeachMeWP.com<%2fa>, an excellent resource for WordPress developers, <a href=%34http%3a%2f%2fteachmewp.com%2f2010%2f06%2f28%2f044-janrain-rpxengage-single-signon-for-openid-twitter-facebook-and-other%2f%34>recently published a video tutorial<%2fa> on how to configure the <a href=%34http%3a%2f%2fwordpress.org%2fextend%2fplugins%2frpx%34>Janrain Engage WordPress plug-in<%2fa>. TeachMeWP.com regularly posts valuable tips and video tutorials for WordPress developers, and this video provides a step-by-step guide to implement the Janrain Engage plug-in for WordPress.<%2fp>				
											<p>The plug-in can be easily installed on a WordPress site or blog in minutes with no coding required.%38nbsp; Check it out the <a href=%34http%3a%2f%2fwordpress.org%2fextend%2fplugins%2frpx%2f%34 target=%34_blank%34>Janrain Engage Wordpress Plugin<%2fa> and let us know what you think.<%2fp>				
											<p><embed allowfullscreen=%34true%34 allowscriptaccess=%34always%34 height=%34300%34 src=%34http%3a%2f%2fblip.tv%2fplay%2fg9QLgen_EQI%34 type=%34application%2fx-shockwave-flash%34 width=%34480%34><%2fembed><%2fp>",
		"plainText" :"TeachMeWP.com , an excellent resource for WordPress developers,  recently published a video tutorial  on how to configure the  Janrain Engage WordPress plug-in . TeachMeWP.com regularly posts valuable tips and video tutorials for WordPress developers, and this video provides a step-by-step guide to implement the Janrain Engage plug-in for WordPress.  The plug-in can be easily installed on a WordPress site or blog in minutes with no coding required.&nbsp; Check it out the  Janrain Engage Wordpress Plugin  and let us know what you think.",
		"date" : "Jul 20, 2010 12:30 PM",
	},
	"story" : 
	{
		"title" : "Update on OpenID and OAuth Security",
		"link" : "http://www.janrain.comblogs/update-openid-and-oauth-security",
		"creator" : "ldrebes",
		"description" : "<p style=%34padding%3a 15px; background%3a rgb(238, 238, 238) none repeat scroll 0% 0%; -moz-background-clip%3a -moz-initial; -moz-background-origin%3a -moz-initial; -moz-background-inline-policy%3a -moz-initial;%34><em><strong>Update%3a<%2fstrong> <%2fem>In our ongoing effort to support the <a href=%34http%3a%2f%2fopenid.net%34 target=%34_blank%34>OpenID<%2fa> standard and ensure its widespread use and adoption through the web, Janrain has patched the PHP, Ruby and Python open source OpenID libraries. <a href=%34%2fproducts%2fengage%34>Janrain Engage<%2fa> and <a href=%34%2fproducts%2ffederate%34>Janrain Federate<%2fa> have also been updated to eliminate any non-constant time comparisons. These patches were developed and applied in response to the proposed timing attack vulnerabilities. Although no successful security breaches have been reported, the code changes made in these libraries will prevent any future attempts using this particular attack vector.%38nbsp; Janrain is happy to provide this support back to the open source community for its continued success and prosperity.<%2fp>				
											<p>				
												A few posts and online articles were published late last week about a potential %38ldquo;timing attack%38rdquo; security issue with OpenID and OAuth. We%38#39;d like to provide a quick communication update.<br %2f>				
												%38nbsp;<br %2f>				
												The reported issue is not a flaw in OpenID or OAuth at a protocol level, but rather the manner that some of the libraries have been implemented. After evaluating the hypothetical attack scenarios in the past week,%38nbsp; we have deemed the probability of a viable exploit to be very low, to non existent.%38nbsp; In communications with our partners and peers in the community, they have reached the same conclusion.<br %2f>				
												%38nbsp;<br %2f>				
												Nonetheless, it seems prudent to remove this as a potential vector. We will be updating the <a href=%34%2fproducts%2fengage%34>Janrain Engage<%2fa> and <a href=%34%2fproducts%2ffederate%34>Federate<%2fa> production versions this week to eliminate any non-constant time comparisons. Our customers and end-users will not need to do anything additional, the upgraded service will function with complete compatibility.<br %2f>				
												%38nbsp;<br %2f>				
												In addition to further auditing our <a href=%34%2fproducts%2fengage%34>Janrain Engage<%2fa> and <a href=%34%2fproducts%2ffederate%34>Janrain Federate<%2fa> product offerings, we will be patching the open source python and ruby libraries that we have contributed to in the past.%38nbsp;<%2fp>				
											<div>We hope that this communication addresses any security concerns you might have had as well as answers any questions about Janrain%38#39;s commitment to your application security. Rest assured that we are diligently monitoring any possible security issues and aggressively responding as necessary.<%2fdiv>				
											<div>				
												_______<%2fdiv>				
											<div>%38nbsp;<%2fdiv>				
											<div>Larry Drebes<br %2f>				
												CTO<%2fdiv>",
		"plainText" :"Update:   In our ongoing effort to support the  OpenID  standard and ensure its widespread use and adoption through the web, Janrain has patched the PHP, Ruby and Python open source OpenID libraries.  Janrain Engage  and  Janrain Federate  have also been updated to eliminate any non-constant time comparisons. These patches were developed and applied in response to the proposed timing attack vulnerabilities. Although no successful security breaches have been reported, the code changes made in these libraries will prevent any future attempts using this particular attack vector.&nbsp; Janrain is happy to provide this support back to the open source community for its continued success and prosperity.  	A few posts and online articles were published late last week about a potential &ldquo;timing attack&rdquo; security issue with OpenID and OAuth. We&#39;d like to provide a quick communication update. 	&nbsp; 	The reported issue is not a flaw in OpenID or OAuth at a protocol level, but rather the manner that some of the libraries have been implemented. After evaluating the hypothetical attack scenarios in the past week,&nbsp; we have deemed the probability of a viable exploit to be very low, to non existent.&nbsp; In communications with our partners and peers in the community, they have reached the same conclusion. 	&nbsp; 	Nonetheless, it seems prudent to remove this as a potential vector. We will be updating the  Janrain Engage  and  Federate  production versions this week to eliminate any non-constant time comparisons. Our customers and end-users will not need to do anything additional, the upgraded service will function with complete compatibility. 	&nbsp; 	In addition to further auditing our  Janrain Engage  and  Janrain Federate  product offerings, we will be patching the open source python and ruby libraries that we have contributed to in the past.&nbsp;  We hope that this communication addresses any security concerns you might have had as well as answers any questions about Janrain&#39;s commitment to your application security. Rest assured that we are diligently monitoring any possible security issues and aggressively responding as necessary.  	_______  &nbsp;  Larry Drebes 	CTO",
		"date" : "Jul 19, 2010 2:26 AM",
	},
	"story" : 
	{
		"title" : "Leveraging the Social Networks on Political Campaign Websites",
		"link" : "http://www.janrain.comblogs/leveraging-social-networks-political-campaign-websites",
		"creator" : "Michael Olson",
		"description" : "<p>As we gear up for another election season, political candidates have an opportunity to leverage the social networks of their constituents to grow their supporter base and spread their campaign message.<%2fp>				
											<p><a href=%34http%3a%2f%2fwww.voterobalexander.com%2f%34 target=%34_blank%34>Rob Alexander<%2fa>, a candidate for State Representative in Utah, is making the sign-up process simple by enabling supporters on his site to quickly register using their existing social network or email accounts from Facebook, Twitter, Google and Yahoo!. <a href=%34%2fproducts%2fengage%34>Janrain Engage<%2fa> powers this functionality.<%2fp>				
											<p><img alt=%34%34 src=%34%2f..%2f..%2fsites%2fdefault%2ffiles%2frob-alexander_0.JPG%34 style=%34width%3a 550px; height%3a 322px;%34 %2f><%2fp>				
											<p>%38nbsp;<%2fp>				
											<p>As political candidates strive to discover ways to engage online with constituents beyond mailing lists, Rob Alexander%38#39;s site provides a good template for how to build a vibrant online community in this space.%38nbsp; Once registered, members can create and maintain a personal profile on the site with their demographic information and profile photo pre-populated from a preferred social network.<%2fp>				
											<p><img alt=%34%34 src=%34%2fsites%2fdefault%2ffiles%2frob-alexander2.JPG%34 style=%34width%3a 557px; height%3a 372px;%34 %2f><%2fp>				
											<p>Members can also participate in discussion board forums to debate issues relevant to the campaign, and create and vote in polls.<%2fp>				
											<p>As the Obama campaign proved in 2008, <a href=%34http%3a%2f%2flatimesblogs.latimes.com%2ftechnology%2f2008%2f11%2fobama-the-first.html%34 target=%34_blank%34>investment in social media technologies can help proliferate a candidate%38#39;s message<%2fa> to the public and build loyalty among supporters. Candidates can create an online community that facilitates increased membership and engagement by leveraging the social network accounts of their supporters.<%2fp>",
		"plainText" :"As we gear up for another election season, political candidates have an opportunity to leverage the social networks of their constituents to grow their supporter base and spread their campaign message.   Rob Alexander , a candidate for State Representative in Utah, is making the sign-up process simple by enabling supporters on his site to quickly register using their existing social network or email accounts from Facebook, Twitter, Google and Yahoo!.  Janrain Engage  powers this functionality.     &nbsp;  As political candidates strive to discover ways to engage online with constituents beyond mailing lists, Rob Alexander&#39;s site provides a good template for how to build a vibrant online community in this space.&nbsp; Once registered, members can create and maintain a personal profile on the site with their demographic information and profile photo pre-populated from a preferred social network.     Members can also participate in discussion board forums to debate issues relevant to the campaign, and create and vote in polls.  As the Obama campaign proved in 2008,  investment in social media technologies can help proliferate a candidate&#39;s message  to the public and build loyalty among supporters. Candidates can create an online community that facilitates increased membership and engagement by leveraging the social network accounts of their supporters.",
		"date" : "Jul 16, 2010 11:12 AM",
		"images" : 	
		[
			"/../../sites/default/files/rob-alexander_0.JPG",
			"/sites/default/files/rob-alexander2.JPG"
		]
	},
	"story" : 
	{
		"title" : "Join us for Lunch 2.0 at Janrain",
		"link" : "http://www.janrain.comblogs/join-us-lunch-20-janrain",
		"creator" : "Michael Olson",
		"description" : "<p>Tomorrow, we are hosting July%38#39;s <a href=%34http%3a%2f%2fsiliconflorist.com%2f2010%2f07%2f12%2freminder-lunch-20-janrain-wednesday%2f%34 target=%34_blank%34>Lunch 2.0 event<%2fa> in Portland, Oregon.%38nbsp; Lunch 2.0 is a great technology-focused networking event that has become a highly anticipated meet and greet each month since it was introduced to Portland in February 2008.%38nbsp;<%2fp>				
											<p><a href=%34%2fcompany%2fmanagement-team%34>Brian Kissel<%2fa>, our CEO, will share a few words about how large brands are utilizing <a href=%34http%3a%2f%2fwww.janrain.com%34>Janrain%38#39;s<%2fa> solutions to optimize their online presence, and the entire Janrain team will be on hand to mingle.%38nbsp; All are welcome to attend, and food and drinks will be provided.%38nbsp; Please <a href=%34http%3a%2f%2fupcoming.yahoo.com%2fevent%2f5833861%2fOR%2fPortland%2fLunch-20-at-JanRain%2fJanRain%2f%34 target=%34_blank%34>RSVP on Upcoming<%2fa> if you plan to make it.%38nbsp; We hope to see many of you tomorrow!<%2fp>",
		"plainText" :"Tomorrow, we are hosting July&#39;s  Lunch 2.0 event  in Portland, Oregon.&nbsp; Lunch 2.0 is a great technology-focused networking event that has become a highly anticipated meet and greet each month since it was introduced to Portland in February 2008.&nbsp;   Brian Kissel , our CEO, will share a few words about how large brands are utilizing  Janrain&#39;s  solutions to optimize their online presence, and the entire Janrain team will be on hand to mingle.&nbsp; All are welcome to attend, and food and drinks will be provided.&nbsp; Please  RSVP on Upcoming  if you plan to make it.&nbsp; We hope to see many of you tomorrow!",
		"date" : "Jul 13, 2010 9:07 AM",
	},
	"story" : 
	{
		"title" : "Tribune Interactive Gets Creative with Beautiful Babies Contest",
		"link" : "http://www.janrain.comblogs/tribune-interactive-gets-creative-beautiful-babies-contest",
		"creator" : "Michael Olson",
		"description" : "<p><a href=%34http%3a%2f%2fwww.tribuneinteractive.com%2f%34>Tribune Interactive<%2fa> recently began a <a href=%34http%3a%2f%2ftribunepromotions.com%2fbabies%2f%34 target=%34_blank%34>contest to uncover the most beautiful baby<%2fa> in the U.S.%38nbsp; The Tribune is fostering wide participation by allowing visitors to media websites in local markets (such as <a href=%34http%3a%2f%2fwww.chicagotribune.com%2f%34 target=%34_blank%34>The Chicago Tribune<%2fa>, <a href=%34http%3a%2f%2fwww.latimes.com%2f%34 target=%34_blank%34>LA Times<%2fa>, <a href=%34http%3a%2f%2fwww.baltimoresun.com%2f%34 target=%34_blank%34>Baltimore Sun<%2fa>, and <a href=%34http%3a%2f%2fwww.orlandosentinel.com%2f%34 target=%34_blank%34>Orlando Sentinel<%2fa>) to register on the site and vote for their favorite babies.%38nbsp; The parents of the most chic child, as voted upon by fans across the U.S. until the end of July, will win $5,000.<%2fp>				
											<p>The company is facilitating fan engagement by leveraging the social network and email accounts of its visitors during the sign up process, in this case through the implementation of <a href=%34%2f..%2f..%2fproducts%2fengage%34>Janrain Enage<%2fa>.<%2fp>				
											<p style=%34text-align%3a center;%34><img alt=%34%34 src=%34%2fsites%2fdefault%2ffiles%2fchicago-tribune-2.JPG%34 style=%34width%3a 550px; height%3a 428px;%34 %2f><%2fp>				
											<p>Tribune Interactive%38#39;s promotion is another example of how removing barriers to registration can yield sharp improvements in customer engagement.%38nbsp; In late 2008, rock band AFI <a href=%34%2f..%2f..%2fblogs%2fopenid-case-study-afi-begin-transmission-project%34>launched a contest<%2fa> to allow users to submit and vote for fan-generated audition videos, with the winner invited to perform on the band%38#39;s then upcoming album.%38nbsp; The contest drew great interest from the band%38#39;s fanbase, and by leveraging <a href=%34%2fproducts%2fengage%34>Janrain Engage<%2fa>, AFI made it easy for fans to sign up on the site, submit videos and vote for their favorite fan auditions.<%2fp>				
											<p>Tribune Interactive has encouraged broad participation by removing the registration hassle and enabling visitors to sign up on the site with an existing social network or email account.%38nbsp; We will stay tuned to see who America crowns as its most beautiful baby.<%2fp>",
		"plainText" :"Tribune Interactive  recently began a  contest to uncover the most beautiful baby  in the U.S.&nbsp; The Tribune is fostering wide participation by allowing visitors to media websites in local markets (such as  The Chicago Tribune ,  LA Times ,  Baltimore Sun , and  Orlando Sentinel ) to register on the site and vote for their favorite babies.&nbsp; The parents of the most chic child, as voted upon by fans across the U.S. until the end of July, will win $5,000.  The company is facilitating fan engagement by leveraging the social network and email accounts of its visitors during the sign up process, in this case through the implementation of  Janrain Enage .     Tribune Interactive&#39;s promotion is another example of how removing barriers to registration can yield sharp improvements in customer engagement.&nbsp; In late 2008, rock band AFI  launched a contest  to allow users to submit and vote for fan-generated audition videos, with the winner invited to perform on the band&#39;s then upcoming album.&nbsp; The contest drew great interest from the band&#39;s fanbase, and by leveraging  Janrain Engage , AFI made it easy for fans to sign up on the site, submit videos and vote for their favorite fan auditions.  Tribune Interactive has encouraged broad participation by removing the registration hassle and enabling visitors to sign up on the site with an existing social network or email account.&nbsp; We will stay tuned to see who America crowns as its most beautiful baby.",
		"date" : "Jun 30, 2010 4:41 AM",
		"images" : 	
		[
			"/sites/default/files/chicago-tribune-2.JPG"
		]
	},
	"story" : 
	{
		"title" : "Janrain Participates in Windows Live Messenger Connect Beta",
		"link" : "http://www.janrain.comblogs/janrain-participates-windows-live-messenger-connect-beta",
		"creator" : "Vidya Shivkumar",
		"description" : "<p><img alt=%34Windows Live Connect%34 src=%34%2fsites%2fdefault%2ffiles%2fWindows_Live_Messenger_Logo.png%34 style=%34padding-top%3a 0px; padding-right%3a 0px; padding-bottom%3a 20px; padding-left%3a 20px; float%3a right; width%3a 180px; height%3a 157px; %34 %2f>Today, Microsoft formally announced the%38nbsp;<a href=%34%2f%34 style=%34color%3a rgb(0, 157, 220); text-decoration%3a none; %34 target=%34_blank%34>Windows Live Messenger Connect beta<%2fa>. Messenger Connect is a single API that provides access to a user%38rsquo;s Activities, Calendars, Contacts, Profiles, and photos stored in%38nbsp;<a href=%34%2f%34 style=%34color%3a rgb(0, 157, 220); text-decoration%3a none; %34 target=%34_blank%34>Windows Live SkyDrive<%2fa>.<%2fp>				
											<p>For%38nbsp;<a href=%34%2f%34 style=%34color%3a rgb(0, 157, 220); text-decoration%3a none; %34>Janrain Engage<%2fa>%38nbsp;customers this means any user who logs into your website with a Windows Live ID is able to invite their friends to your site and%38nbsp;<a href=%34http%3a%2f%2fwindowsteamblog.com%2fwindows_live%2fb%2fdeveloper%2farchive%2f2010%2f06%2f28%2fsocial-distribution.aspx%34 style=%34color%3a rgb(0, 157, 220); text-decoration%3a none; %34 target=%34_blank%34>publish their activities on your site back to the Windows Live Messenger chat client<%2fa>.%38nbsp; Messenger Connect also enables websites to read and write to a user%38rsquo;s activity feed. An activity feed could be uploading a photo, befriending someone, posting a video, updating a status message etc. When your website displays those activities performed by a user%38rsquo;s friends on your site and filters out the rest, the experience is much more relevant and personal to the end user, which can result in the average time spent by the user on your website going up.<%2fp>				
											<p>	Rather than launch a new social networking service, Microsoft chose to make Messenger complement the world%38rsquo;s most popular social networks. It is not hard to see why. Messenger has a global user base of over 320 million and its users spend approximately 9% of total Internet minutes worldwide. This is a large and captive online user base. Recently, Microsoft also announced that the new Messenger will allow users to see what their contacts across other social networks like Facebook, LinkedIn and MySpace are doing. This is a step in the right direction. The increasing user-centric nature of social networks is leading to more open online communities across the Internet. Rather than create more islands of users, it is nice to see networks building bridges between the silos that already exist.<%2fp>				
											<p>	<a href=%34http%3a%2f%2fwww.janrain.com%34>Janrain<%2fa> enjoys a close <a href=%34%2fpartners%2fprovider-partners#microsoft%34>partnership with Microsoft<%2fa> and has had the opportunity to participate in the Messenger Connect early adoption program. We will launch support for Messenger Connect publishing in July and a deeper integration with activity feeds later this year. As always, our goal is to bring new and innovative solutions to our customers that are easy to deploy and provide a more engaging user experience.<%2fp>",
		"plainText" :"Today, Microsoft formally announced the&nbsp; Windows Live Messenger Connect beta . Messenger Connect is a single API that provides access to a user&rsquo;s Activities, Calendars, Contacts, Profiles, and photos stored in&nbsp; Windows Live SkyDrive .  For&nbsp; Janrain Engage &nbsp;customers this means any user who logs into your website with a Windows Live ID is able to invite their friends to your site and&nbsp; publish their activities on your site back to the Windows Live Messenger chat client .&nbsp; Messenger Connect also enables websites to read and write to a user&rsquo;s activity feed. An activity feed could be uploading a photo, befriending someone, posting a video, updating a status message etc. When your website displays those activities performed by a user&rsquo;s friends on your site and filters out the rest, the experience is much more relevant and personal to the end user, which can result in the average time spent by the user on your website going up.  	Rather than launch a new social networking service, Microsoft chose to make Messenger complement the world&rsquo;s most popular social networks. It is not hard to see why. Messenger has a global user base of over 320 million and its users spend approximately 9% of total Internet minutes worldwide. This is a large and captive online user base. Recently, Microsoft also announced that the new Messenger will allow users to see what their contacts across other social networks like Facebook, LinkedIn and MySpace are doing. This is a step in the right direction. The increasing user-centric nature of social networks is leading to more open online communities across the Internet. Rather than create more islands of users, it is nice to see networks building bridges between the silos that already exist.  	 Janrain  enjoys a close  partnership with Microsoft  and has had the opportunity to participate in the Messenger Connect early adoption program. We will launch support for Messenger Connect publishing in July and a deeper integration with activity feeds later this year. As always, our goal is to bring new and innovative solutions to our customers that are easy to deploy and provide a more engaging user experience.",
		"date" : "Jun 28, 2010 5:58 AM",
		"images" : 	
		[
			"/sites/default/files/Windows_Live_Messenger_Logo.png"
		]
	},
	"story" : 
	{
		"title" : "NPR Deploys Janrain Engage To Make It Easier for Users to Login",
		"link" : "http://www.janrain.comblogs/npr-deploys-janrain-engage-make-it-easier-users-login",
		"creator" : "Michael Olson",
		"description" : "<p>Today, <a href=%34http%3a%2f%2fwww.npr.org%34 target=%34_blank%34>National Public Radio<%2fa> (NPR) <a href=%34http%3a%2f%2fwww.npr.org%2fblogs%2finside%2f2010%2f06%2f24%2f128079309%2fusing-your-social-networking-accounts-to-log-into-npr-org%34 target=%34_blank%34>began accepting social network accounts<%2fa> with Janrain Engage to make it easy for its users to participate on the site by posting comments on articles and signing up for newsletters.%38nbsp; Visitors to the NPR website can now quickly register and login using their existing accounts with Facebook, Google, Twitter, Yahoo!, LinkedIn or OpenID.<%2fp>				
											<p>%38nbsp;<img alt=%34%34 src=%34%2fsites%2fdefault%2ffiles%2fnpr.JPG%34 style=%34width%3a 500px; height%3a 282px;%34 %2f><%2fp>				
											<p>The integration of Janrain Engage allows NPR users to register within two clicks, pre-populate a name and email address with profile information from their preferred network, and sign-up for newsletters and other permission-based marketing programs offered by NPR.<%2fp>				
											<p>NPR selected Janrain Engage for its rich features and ease of implementation, which nicely complemented the organization%38#39;s agile development process.%38nbsp; We%38#39;re excited to see <a href=%34%2fblogs%2fmedia-companies-optimizing-user-registration-engagement-0%34>another major media organization<%2fa> leverage the existing social network and email accounts of its audience to improve registration rates and facilitate greater engagement.<%2fp>",
		"plainText" :"Today,  National Public Radio  (NPR)  began accepting social network accounts  with Janrain Engage to make it easy for its users to participate on the site by posting comments on articles and signing up for newsletters.&nbsp; Visitors to the NPR website can now quickly register and login using their existing accounts with Facebook, Google, Twitter, Yahoo!, LinkedIn or OpenID.  &nbsp;   The integration of Janrain Engage allows NPR users to register within two clicks, pre-populate a name and email address with profile information from their preferred network, and sign-up for newsletters and other permission-based marketing programs offered by NPR.  NPR selected Janrain Engage for its rich features and ease of implementation, which nicely complemented the organization&#39;s agile development process.&nbsp; We&#39;re excited to see  another major media organization  leverage the existing social network and email accounts of its audience to improve registration rates and facilitate greater engagement.",
		"date" : "Jun 24, 2010 4:29 AM",
		"images" : 	
		[
			"/sites/default/files/npr.JPG"
		]
	},
	"story" : 
	{
		"title" : "Janrain Engage for the iPhone",
		"link" : "http://www.janrain.comblogs/janrain-engage-iphone",
		"creator" : "Michael Olson",
		"description" : "<p>Internet users increasingly are accessing their favorite web applications through mobile phones.%38nbsp; As developers and publishers of iPhone applications, you can tap into this growing market by providing an easy way for your consumers to login to your apps using popular social networking or email accounts.<%2fp>				
											<p>A few months ago we launched a beta program for Janrain Engage (formerly RPX) for the iPhone.%38nbsp; Thank you to our many customers who participated in the program and provided valuable feedback. <strong>Today we are excited to announce the production availability of Janrain Engage for the iPhone%3a a native iPhone library to allow developers to quickly add 3rd party authentication to their iPhone app.<%2fstrong><%2fp>				
											<p>Starting today, developers may preserve the native iPhone application experience without the challenge of implementing complex third party logins.%38nbsp;<%2fp>				
											<p>If you are an existing Janrain Engage Basic, Plus or Pro customer, you have immediate access to the libraries through your Janrain Engage dashboard. Please select iPhone library from the dropdown menu in the Sign-in area of the dashboard, and you will have all the information you need to get started.<%2fp>				
											<p>If you would like to see how the application works, try out <a href=%34http%3a%2f%2fitunes.apple.com%2fus%2fapp%2fquick-sign-in%2fid375197510%34>Janrain Quick Sign-in<%2fa>, our demo app listed on the Apple App Store.<%2fp>				
											<p><strong>Some key features and benefits<%2fstrong>%3a<%2fp>				
											<ul>				
											<li>Companies and websites that offer an application for the iPhone can now use Janrain Engage for the iPhone to enable quick registration and login via Facebook, Google, Twitter, Yahoo!, LinkedIn and up to 11 additional identity providers.<%2fli>				
											<li>Janrain Engage for the iPhone maintains the look and feel of the iPhone SDK and enables websites to authenticate their users through iPhone%38#39;s native UI Kit as opposed to launching a web browser for user sign in.<%2fli>				
											<li>Users can browse configured providers from a single-column table view, as opposed to the application%38#39;s two-column view, which helps maximize the real estate of the iPhone screen.<%2fli>				
											<li>Janrain Engage remembers the user%38#39;s preferred provider on return visits, to help ensure a positive and intuitive return user experience.<%2fli>				
											<li>Janrain Engage for the iPhone includes the same key features as the browser based version of the product.<%2fli>				
											<li>Developers can customize the number of identity providers displayed and the order in which they appear via the Janrain Engage dashboard.<%2fli>				
											<%2ful>				
											<p style=%34text-align%3a center%34><img alt=%34%34 src=%34http%3a%2f%2fwww.janrain.com%2fsites%2fdefault%2ffiles%2fiphone.png%34 %2f><%2fp>				
											<p>As always, <strong>we welcome your feedback<%2fstrong> and are excited to extend the benefits of Janrain Engage to our customers that are active in the mobile space.<%2fp>",
		"plainText" :"Internet users increasingly are accessing their favorite web applications through mobile phones.&nbsp; As developers and publishers of iPhone applications, you can tap into this growing market by providing an easy way for your consumers to login to your apps using popular social networking or email accounts.  A few months ago we launched a beta program for Janrain Engage (formerly RPX) for the iPhone.&nbsp; Thank you to our many customers who participated in the program and provided valuable feedback.  Today we are excited to announce the production availability of Janrain Engage for the iPhone: a native iPhone library to allow developers to quickly add 3rd party authentication to their iPhone app.   Starting today, developers may preserve the native iPhone application experience without the challenge of implementing complex third party logins.&nbsp;  If you are an existing Janrain Engage Basic, Plus or Pro customer, you have immediate access to the libraries through your Janrain Engage dashboard. Please select iPhone library from the dropdown menu in the Sign-in area of the dashboard, and you will have all the information you need to get started.  If you would like to see how the application works, try out  Janrain Quick Sign-in , our demo app listed on the Apple App Store.   Some key features and benefits :   Companies and websites that offer an application for the iPhone can now use Janrain Engage for the iPhone to enable quick registration and login via Facebook, Google, Twitter, Yahoo!, LinkedIn and up to 11 additional identity providers.  Janrain Engage for the iPhone maintains the look and feel of the iPhone SDK and enables websites to authenticate their users through iPhone&#39;s native UI Kit as opposed to launching a web browser for user sign in.  Users can browse configured providers from a single-column table view, as opposed to the application&#39;s two-column view, which helps maximize the real estate of the iPhone screen.  Janrain Engage remembers the user&#39;s preferred provider on return visits, to help ensure a positive and intuitive return user experience.  Janrain Engage for the iPhone includes the same key features as the browser based version of the product.  Developers can customize the number of identity providers displayed and the order in which they appear via the Janrain Engage dashboard.      As always,  we welcome your feedback  and are excited to extend the benefits of Janrain Engage to our customers that are active in the mobile space.",
		"date" : "Jun 22, 2010 10:00 AM",
		"images" : 	
		[
			"http://www.janrain.com/sites/default/files/iphone.png"
		]
	},
	"story" : 
	{
		"title" : "Major Media Companies Implement Janrain Engage to Better Connect with Users Online",
		"link" : "http://www.janrain.comblogs/media-companies-optimizing-user-registration-engagement-0",
		"creator" : "Michael Olson",
		"description" : "<p>In April, we wrote about one of the <a href=%34%2f..%2f..%2fblogs%2fnews-sites-moving-away-anonymous-online-comments%34>changing paradigms in the news media industry<%2fa> resulting from the emergence of social media. Since establishing an online footprint, many news media companies have historically experienced two pain points%3a<%2fp>				
											<ul>				
											<li>By allowing anonymous commenting on articles and not encouraging folks to use their real identities online, discussions on media sites can often devolve into vitriolic conversations that devalue the online experience.<%2fli>				
											<li>Because the registration process can be such a hassle for online users, media sites often collect inaccurate data on their members.%38nbsp; This %38quot;Garbage In, Garbage Out%38quot; phenomenon means that many media sites are making business decisions (such as serving personalized content or targeted advertisments, for example) based on unreliable user data.%38nbsp; When media sites force users to register the traditional way, they end up with far too many %38quot;John Smiths%38quot; from the zip code %38quot;12345%38quot;.<%2fli>				
											<%2ful>				
											<p>As reported today on <a href=%34http%3a%2f%2fsocial.venturebeat.com%2f2010%2f06%2f16%2fjanrain-la-times-openid%2f%34 target=%34_blank%34>VentureBeat<%2fa>, <a href=%34http%3a%2f%2fwww.digidaydaily.com%2fstories%2fjanrain-signs-a-slew-of-media-heavyweights-into-identity-capture-tools%2f%34 target=%34_blank%34>DigiDay<%2fa> and <a href=%34http%3a%2f%2fwww.webpronews.com%2ftopnews%2f2010%2f06%2f17%2fwhy-social-publishing-drives-more-valuable-traffic%34 target=%34_blank%34>WebProNews<%2fa>, innovative media companies are utilizing <a href=%34%2fproducts%2fengage%34>Janrain Engage<%2fa> (formerly RPX) to allow users to bypass the traditional registration process and sign-in via an existing account with Facebook, Google, Yahoo!, Twitter or other social platforms.%38nbsp; Doing this enables media sites both to encourage users to interact on the site with a real online identity, and collect an accurate profile of their audience when a user chooses to share his or her profile data with the website.<%2fp>				
											<p>	Media companies now using Janrain Engage to enable easy registration, login, and publishing of user comments and other website activities to multiple social networks include%3a<%2fp>				
											<ul>				
											<li><a href=%34http%3a%2f%2fwww.tribuneinteractive.com%34 target=%34_blank%34>Tribune Interactive<%2fa> - has a dynamic online presence both locally and nationally, operating leading news and information sites in 20 major markets. Janrain Engage has already been rolled out on the online properties of the <a href=%34http%3a%2f%2fwww.latimes.com%34 target=%34_blank%34>Los Angeles Times<%2fa>, <a href=%34http%3a%2f%2fwww.baltimoresun.com%34 target=%34_blank%34>Baltimore Sun<%2fa>, <a href=%34http%3a%2f%2fwww.sun-sentinel.com%34 target=%34_blank%34>Sun-Sentinel<%2fa>, <a href=%34http%3a%2f%2fwww.orlandosentinel.com%34>Orlando Sentinel<%2fa> and four additional media properties.<%2fli>				
											<li><a href=%34http%3a%2f%2fwww.meredith.com%34 target=%34_blank%34>Meredith <%2fa>- the leading media and marketing company serving American women. Janrain Engage is being rolled out across several sites including <a href=%34http%3a%2f%2fwww.bhg.com%34 target=%34_blank%34>Better Homes and Gardens<%2fa>, <a href=%34http%3a%2f%2fwww.parents.com%34 target=%34_blank%34>Parents.com<%2fa>, <a href=%34http%3a%2f%2fwww.recipe.com%34 target=%34_blank%34>Recipe.com<%2fa> and <a href=%34http%3a%2f%2fwww.fitnessmagazine.com%34 target=%34_blank%34>Fitness Magazine<%2fa>.<%2fli>				
											<li><a href=%34http%3a%2f%2fwww.scripps.com%34 target=%34_blank%34>E.W. Scripps<%2fa> - a diverse media concern with interests in newspaper publishing, broadcast television stations, and licensing and syndication. Janrain Engage will provide authentication and social publishing across all 21 of their newspaper web properties, including those of the <a href=%34http%3a%2f%2fwww.knoxnews.com%34 target=%34_blank%34>Knoxville News Sentinel<%2fa>, <a href=%34http%3a%2f%2fwww.vcstar.com%34 target=%34_blank%34>Ventura County Star<%2fa> and <a href=%34http%3a%2f%2fwww.naplesnews.com%34 target=%34_blank%34>Naples Daily News<%2fa>.<%2fli>				
											<li><a href=%34http%3a%2f%2fwww.dallasnews.com%34 target=%34_blank%34>Dallas Morning News<%2fa> - has deployed Janrain Engage across four of its online properties, including dallasnews.com, the online city guides <a href=%34http%3a%2f%2fwww.guidelive.com%34 target=%34_blank%34>GuideLive.com<%2fa> and <a href=%34http%3a%2f%2fwww.quickdfw.com%34 target=%34_blank%34>QuickDFW.com<%2fa>, as well as on <a href=%34http%3a%2f%2fwww.aldiatx.com%34 target=%34_blank%34>alDiaTX.com<%2fa>, its Spanish-language news site.<%2fli>				
											<li><a href=%34http%3a%2f%2fwww.bizjournals.com%34 target=%34_blank%34>bizjournals<%2fa> - the online media division of American City Business Journals, the nation%38rsquo;s largest publisher of metropolitan business newspapers. It operates the web sites for each of the company%38#39;s 40 print business journals and operates a web-only site with local business news and information for Los Angeles.<%2fli>				
											<li><a href=%34http%3a%2f%2fwww.ngs.org%34 target=%34_blank%34>National Geographic Society<%2fa> - one of the largest non-profit scientific and educational institutions in the world. The Society publishes National Geographic, a leading magazine with subjects that include geography, archaeology and natural science, the promotion of environmental and historical conservation. Janrain Engage has been deployed previously on the <a href=%34http%3a%2f%2fchannel.nationalgeographic.com%34 target=%34_blank%34>National Geographic Channel website<%2fa> and is now being launched on NationalGeographic.com.<%2fli>				
											<%2ful>				
											<p>				
												These six media customers join a number of other major media companies already working with Janrain, including <a href=%34http%3a%2f%2fwww.foxnews.com%34 target=%34_blank%34>Fox News<%2fa>, <a href=%34http%3a%2f%2fwww.npr.org%34 target=%34_blank%34>National Public Radio<%2fa>, <a href=%34http%3a%2f%2fwww.oknews.com%34 target=%34_blank%34>Oklahoma Publishing Company<%2fa>, <a href=%34http%3a%2f%2fwww.divinecaroline.com%34 target=%34_blank%34>Real Girls Media<%2fa>, <a href=%34http%3a%2f%2fwww.journalismonline.com%34 target=%34_blank%34>Journalism Online<%2fa>, <a href=%34http%3a%2f%2fwww.and.co.uk%34 target=%34_blank%34>Associated Northcliffe Digital<%2fa>, <a href=%34http%3a%2f%2fwww.avro.nl%34 target=%34_blank%34>Avro<%2fa>, and the <a href=%34http%3a%2f%2fwww.bakersfield.com%34 target=%34_blank%34>Bakersfield Californian<%2fa>.<%2fp>",
		"plainText" :"In April, we wrote about one of the  changing paradigms in the news media industry  resulting from the emergence of social media. Since establishing an online footprint, many news media companies have historically experienced two pain points:   By allowing anonymous commenting on articles and not encouraging folks to use their real identities online, discussions on media sites can often devolve into vitriolic conversations that devalue the online experience.  Because the registration process can be such a hassle for online users, media sites often collect inaccurate data on their members.&nbsp; This &quot;Garbage In, Garbage Out&quot; phenomenon means that many media sites are making business decisions (such as serving personalized content or targeted advertisments, for example) based on unreliable user data.&nbsp; When media sites force users to register the traditional way, they end up with far too many &quot;John Smiths&quot; from the zip code &quot;12345&quot;.   As reported today on  VentureBeat ,  DigiDay  and  WebProNews , innovative media companies are utilizing  Janrain Engage  (formerly RPX) to allow users to bypass the traditional registration process and sign-in via an existing account with Facebook, Google, Yahoo!, Twitter or other social platforms.&nbsp; Doing this enables media sites both to encourage users to interact on the site with a real online identity, and collect an accurate profile of their audience when a user chooses to share his or her profile data with the website.  	Media companies now using Janrain Engage to enable easy registration, login, and publishing of user comments and other website activities to multiple social networks include:    Tribune Interactive  - has a dynamic online presence both locally and nationally, operating leading news and information sites in 20 major markets. Janrain Engage has already been rolled out on the online properties of the  Los Angeles Times ,  Baltimore Sun ,  Sun-Sentinel ,  Orlando Sentinel  and four additional media properties.   Meredith  - the leading media and marketing company serving American women. Janrain Engage is being rolled out across several sites including  Better Homes and Gardens ,  Parents.com ,  Recipe.com  and  Fitness Magazine .   E.W. Scripps  - a diverse media concern with interests in newspaper publishing, broadcast television stations, and licensing and syndication. Janrain Engage will provide authentication and social publishing across all 21 of their newspaper web properties, including those of the  Knoxville News Sentinel ,  Ventura County Star  and  Naples Daily News .   Dallas Morning News  - has deployed Janrain Engage across four of its online properties, including dallasnews.com, the online city guides  GuideLive.com  and  QuickDFW.com , as well as on  alDiaTX.com , its Spanish-language news site.   bizjournals  - the online media division of American City Business Journals, the nation&rsquo;s largest publisher of metropolitan business newspapers. It operates the web sites for each of the company&#39;s 40 print business journals and operates a web-only site with local business news and information for Los Angeles.   National Geographic Society  - one of the largest non-profit scientific and educational institutions in the world. The Society publishes National Geographic, a leading magazine with subjects that include geography, archaeology and natural science, the promotion of environmental and historical conservation. Janrain Engage has been deployed previously on the  National Geographic Channel website  and is now being launched on NationalGeographic.com.   	These six media customers join a number of other major media companies already working with Janrain, including  Fox News ,  National Public Radio ,  Oklahoma Publishing Company ,  Real Girls Media ,  Journalism Online ,  Associated Northcliffe Digital ,  Avro , and the  Bakersfield Californian .",
		"date" : "Jun 17, 2010 9:25 AM",
	},
	"story" : 
	{
		"title" : "Janrain Launches New Products and New Website",
		"link" : "http://www.janrain.comblogs/janrain-launches-new-products-and-new-website",
		"creator" : "Brian Kissel",
		"description" : "<p><img alt=%34%34 src=%34%2fsites%2fdefault%2ffiles%2fjanrain-logo.png%34 style=%34padding%3a 0px 0px 20px 20px; float%3a right; width%3a 180px; height%3a 53px;%34 %2f>Today we are announcing several exciting changes to the Janrain product portfolio, brand and website. On the product front, we have renamed our flagship product, RPX, which is currently deployed on over 200,000 websites worldwide to <strong><em><a href=%34%2fproducts%2fengage%34>Janrain Engage<%2fa>.%38nbsp;<%2fem><%2fstrong> We are renaming our OPX product to <strong><a href=%34%2fproducts%2ffederate%34>Janrain Federate<%2fa><%2fstrong>.<%2fp>				
											<p>And, we are formally launching the<strong><em> <a href=%34%2fjanrain-products-overview%34>Janrain User Management Platform (JUMP)<%2fa><%2fem><%2fstrong> to help organizations manage and measure online user interaction and engagement. An established%38nbsp;best practice in building websites today is to use component technologies for%38nbsp;content management systems (CMS), rating and reviews, commenting , eCommerce, and web analytics. Janrain provides the user management%38nbsp;component, and integrates seamlessly with these additional component technologies.<%2fp>				
											<p><strong>Product Renaming %38ndash; New names for RPX and OPX<%2fstrong><%2fp>				
											<ul>				
											<li><em><strong>RPX will become <a href=%34%2fproducts%2fengage%34>Janrain Engage<%2fa> <%2fstrong><%2fem>- Leverage a user%38rsquo;s existing identity profile from social networks or identity providers like Facebook, Twitter, Google and others to speed up online registration. Invite friends and publish activity data back to social networks.<%2fli>				
											<%2ful>				
											<ul>				
											<li><strong><em>OPX will become <a href=%34%2fproducts%2ffederate%34>Janrain Federate<%2fa> <%2fem><%2fstrong>- Enable registered users of your website to seamlessly navigate to multiple web properties and partner sites using their existing credentials for a single-sign on experience.<%2fli>				
											<%2ful>				
											<p><strong>Formally introducing%38hellip; the <a href=%34%2fjanrain-products-overview%34>Janrain User Management Platform (JUMP)<%2fa><%2fstrong><br %2f>				
												The Janrain User Management Platform helps you seamlessly manage all aspects of user interaction and social engagement. Janrain Engage connects your site to the social networks and enables you to easily authenticate your site visitors via their existing social identities, and publish their activities on your site to multiple social networks. Janrain Federate enables you to facilitate a single sign-on environment for your users and provision a centrally-managed identity. All products can be used together or separately.<%2fp>				
											<p>The Janrain platform integrates with content management systems (CMS), rating and review technologies, commenting systems, eCommerce platforms and web analytics software to allow for seamless deployments no matter what the use case.<%2fp>				
											<p><strong>A New Website and Logo<%2fstrong><br %2f>				
												The Janrain website has been redesigned to make it easier to find information, and our logo has been updated %38ndash; goodbye Capital R, and hello a brighter blue. As part of the site re-launch, rpxnow.com will no longer be a public site.<%2fp>				
											<p><strong>For Janrain customers, this news means%3a<%2fstrong><br %2f>				
												%38bull;%38nbsp;Your existing Janrain solutions will continue to work without interruption and without any changes necessary on your end.<br %2f>				
												%38bull;%38nbsp;You will access your Janrain RPX application, now renamed Janrain Engage, by signing into your dashboard through janrain.com.%38nbsp; You can continue to administer your Janrain Engage application through your existing dashboard, and no changes have been made to your application settings.<br %2f>				
												%38bull;%38nbsp;Janrain contact information remains the same.<%2fp>				
											<p>Thanks for reading and we look forward to continuing to develop and deliver innovative and reliable solutions for online user management. As always, your feedback and comments are welcome.<%2fp>				
											<p>Brian Kissel<br %2f>				
												CEO, Janrain, Inc.<%2fp>",
		"plainText" :"Today we are announcing several exciting changes to the Janrain product portfolio, brand and website. On the product front, we have renamed our flagship product, RPX, which is currently deployed on over 200,000 websites worldwide to    Janrain Engage .&nbsp;   We are renaming our OPX product to   Janrain Federate  .  And, we are formally launching the    Janrain User Management Platform (JUMP)    to help organizations manage and measure online user interaction and engagement. An established&nbsp;best practice in building websites today is to use component technologies for&nbsp;content management systems (CMS), rating and reviews, commenting , eCommerce, and web analytics. Janrain provides the user management&nbsp;component, and integrates seamlessly with these additional component technologies.   Product Renaming &ndash; New names for RPX and OPX      RPX will become  Janrain Engage    - Leverage a user&rsquo;s existing identity profile from social networks or identity providers like Facebook, Twitter, Google and others to speed up online registration. Invite friends and publish activity data back to social networks.      OPX will become  Janrain Federate    - Enable registered users of your website to seamlessly navigate to multiple web properties and partner sites using their existing credentials for a single-sign on experience.    Formally introducing&hellip; the  Janrain User Management Platform (JUMP)   	The Janrain User Management Platform helps you seamlessly manage all aspects of user interaction and social engagement. Janrain Engage connects your site to the social networks and enables you to easily authenticate your site visitors via their existing social identities, and publish their activities on your site to multiple social networks. Janrain Federate enables you to facilitate a single sign-on environment for your users and provision a centrally-managed identity. All products can be used together or separately.  The Janrain platform integrates with content management systems (CMS), rating and review technologies, commenting systems, eCommerce platforms and web analytics software to allow for seamless deployments no matter what the use case.   A New Website and Logo  	The Janrain website has been redesigned to make it easier to find information, and our logo has been updated &ndash; goodbye Capital R, and hello a brighter blue. As part of the site re-launch, rpxnow.com will no longer be a public site.   For Janrain customers, this news means:  	&bull;&nbsp;Your existing Janrain solutions will continue to work without interruption and without any changes necessary on your end. 	&bull;&nbsp;You will access your Janrain RPX application, now renamed Janrain Engage, by signing into your dashboard through janrain.com.&nbsp; You can continue to administer your Janrain Engage application through your existing dashboard, and no changes have been made to your application settings. 	&bull;&nbsp;Janrain contact information remains the same.  Thanks for reading and we look forward to continuing to develop and deliver innovative and reliable solutions for online user management. As always, your feedback and comments are welcome.  Brian Kissel 	CEO, Janrain, Inc.",
		"date" : "Jun 16, 2010 5:05 AM",
		"images" : 	
		[
			"/sites/default/files/janrain-logo.png"
		]
	},
	"story" : 
	{
		"title" : "Open Source Bridge Pub Crawl Stops By Janrain",
		"link" : "http://www.janrain.comblogs/open-source-bridge-pub-crawl-stops-janrain",
		"creator" : "Michael Olson",
		"description" : "<p>The rain last night in Portland, Oregon didn%38#39;t stop folks from making the rounds on a technology company Pub Crawl held in conjunction with the <a href=%34http%3a%2f%2fopensourcebridge.org%2f%34>Open Source Bridge Conference<%2fa>. JanRain was part of an evening event hosted by <a href=%34http%3a%2f%2ffacebook.com%2f%34>Facebook<%2fa>. Everyone started at Kells, a local Irish pub down the street, and then moved on for drinks at a few local technology companies%3a JanRain, <a href=%34http%3a%2f%2fwww.puppetlabs.com%2f%34>Puppet Labs<%2fa> and <a href=%34http%3a%2f%2furbanairship.com%2f%34>Urban Airship<%2fa>. The night wrapped up at the offices of local ad agency <a href=%34http%3a%2f%2fwww.wk.com%2f%34>Wieden + Kennedy<%2fa>.<%2fp>				
											<p>	Everyone seemed to have a great time talking with new and old friends around the keg (another local favorite - Bridgeport Brewing). Conversation topics ranged from debate over favorite tourist hot spots on the west coast to discussions of the role open source technologies can play in the continued evolution of the social web.<%2fp>				
											<p><img alt=%34%34 id=%34BLOGGER_PHOTO_ID_5479058692627042610%34 src=%34%2fsites%2fdefault%2ffiles%2fblog-images%2f_MG_4881.jpg%34 style=%34border-style%3a solid; border-width%3a 0px; margin%3a 0px auto 10px; text-align%3a center; width%3a 400px; display%3a block; height%3a 267px;%34 %2f><br %2f>				
												Since it was our first event since moving into our new office a few months ago, it was great to have so many people in our space.<%2fp>				
											<p>	Next up is <a href=%34http%3a%2f%2fupcoming.yahoo.com%2fevent%2f5833861%2fOR%2fPortland%2fLunch-20-at-JanRain%2fJanRain%2f%34>Lunch 2.0<%2fa> here on July 14. Be sure to register if you would like to attend.<%2fp>",
		"plainText" :"The rain last night in Portland, Oregon didn&#39;t stop folks from making the rounds on a technology company Pub Crawl held in conjunction with the  Open Source Bridge Conference . JanRain was part of an evening event hosted by  Facebook . Everyone started at Kells, a local Irish pub down the street, and then moved on for drinks at a few local technology companies: JanRain,  Puppet Labs  and  Urban Airship . The night wrapped up at the offices of local ad agency  Wieden + Kennedy .  	Everyone seemed to have a great time talking with new and old friends around the keg (another local favorite - Bridgeport Brewing). Conversation topics ranged from debate over favorite tourist hot spots on the west coast to discussions of the role open source technologies can play in the continued evolution of the social web.    	Since it was our first event since moving into our new office a few months ago, it was great to have so many people in our space.  	Next up is  Lunch 2.0  here on July 14. Be sure to register if you would like to attend.",
		"date" : "Jun 4, 2010 10:03 AM",
		"images" : 	
		[
			"/sites/default/files/blog-images/_MG_4881.jpg"
		]
	},
	"story" : 
	{
		"title" : "LinkedIn Social Publishing Now Available in Janrain Engage",
		"link" : "http://www.janrain.comblogs/linkedin-social-publishing-now-available-janrain-rpx",
		"creator" : "Michael Olson",
		"description" : "<p>We%38#39;re happy to announce today that we have added <a href=%34http%3a%2f%2fwww.linkedin.com%2f%34>LinkedIn<%2fa> as a supported network for social publishing within Janrain Engage. This means that you can now enable your website users to publish their comments, reviews, purchases, blogs, downloads, or any other activities from your site to their LinkedIn profile as a status update.<a href=%34http%3a%2f%2f4.bp.blogspot.com%2f_5bYjpYVN3Uo%2fS_ro5tu97DI%2fAAAAAAAAAQM%2fwrgl6kT_dWc%2fs1600%2flinkedin-in-social-widget.JPG%34 onblur=%34try {parent.deselectBloggerImageGracefully();} catch(e) {}%34><img alt=%34%34 id=%34BLOGGER_PHOTO_ID_5474944375249038386%34 src=%34%2fsites%2fdefault%2ffiles%2fblog-images%2flinkedin-in-social-widget.JPG%34 style=%34border-style%3a solid; border-width%3a 0px; margin%3a 0px auto 10px; display%3a block; text-align%3a center; cursor%3a pointer; width%3a 400px; height%3a 288px;%34 %2f><%2fa><%2fp>				
											<p>				
												With over 50 million members, LinkedIn is a prominent communication and networking platform for business professionals, and presents a great opportunity for you to enable word of mouth marketing via your users through another social channel.<a href=%34http%3a%2f%2f4.bp.blogspot.com%2f_5bYjpYVN3Uo%2fS_rpsjOZNuI%2fAAAAAAAAAQU%2ftHfMuKYcqRs%2fs1600%2flinkedin-published.JPG%34 onblur=%34try {parent.deselectBloggerImageGracefully();} catch(e) {}%34><img alt=%34%34 id=%34BLOGGER_PHOTO_ID_5474945248601388770%34 src=%34%2fsites%2fdefault%2ffiles%2fblog-images%2flinkedin-published.JPG%34 style=%34border-style%3a solid; border-width%3a 0px; margin%3a 0px auto 10px; display%3a block; text-align%3a center; cursor%3a pointer; width%3a 400px; height%3a 228px;%34 %2f><%2fa><%2fp>				
											<p>				
												Configuring social publishing with Janrain Engage is seamless, and can be done in minutes. Simply add a few snippets of JavaScript to your site, select the networks you wish to enable for social publishing, and you%38#39;re set.<a href=%34http%3a%2f%2f4.bp.blogspot.com%2f_5bYjpYVN3Uo%2fS_r9ZgltkVI%2fAAAAAAAAAQc%2fBLIH9cTs5dA%2fs1600%2flinkedin-social-widget-setup.JPG%34 onblur=%34try {parent.deselectBloggerImageGracefully();} catch(e) {}%34><img alt=%34%34 id=%34BLOGGER_PHOTO_ID_5474966911708926290%34 src=%34%2fsites%2fdefault%2ffiles%2fblog-images%2flinkedin-social-widget-setup.JPG%34 style=%34border-style%3a solid; border-width%3a 0px; margin%3a 0px auto 10px; display%3a block; text-align%3a center; cursor%3a pointer; width%3a 400px; height%3a 297px;%34 %2f><%2fa><%2fp>				
											<p>	With our separate <a href=%34%2fblogs%2fjanrain-rpx-enables-publishing-google-buzz%34>announcement last week about the addition of Google Buzz<%2fa>, we now support publishing to as many as six social networks.<%2fp>",
		"plainText" :"We&#39;re happy to announce today that we have added  LinkedIn  as a supported network for social publishing within Janrain Engage. This means that you can now enable your website users to publish their comments, reviews, purchases, blogs, downloads, or any other activities from your site to their LinkedIn profile as a status update.     	With over 50 million members, LinkedIn is a prominent communication and networking platform for business professionals, and presents a great opportunity for you to enable word of mouth marketing via your users through another social channel.     	Configuring social publishing with Janrain Engage is seamless, and can be done in minutes. Simply add a few snippets of JavaScript to your site, select the networks you wish to enable for social publishing, and you&#39;re set.     	With our separate  announcement last week about the addition of Google Buzz , we now support publishing to as many as six social networks.",
		"date" : "May 24, 2010 11:14 AM",
		"images" : 	
		[
			"/sites/default/files/blog-images/linkedin-in-social-widget.JPG",
			"/sites/default/files/blog-images/linkedin-published.JPG",
			"/sites/default/files/blog-images/linkedin-social-widget-setup.JPG"
		]
	},
	"story" : 
	{
		"title" : "A Look at the 2010 Internet Identity Workshop",
		"link" : "http://www.janrain.comblogs/look-2010-internet-identity-workshop",
		"creator" : "Michael Olson",
		"description" : "<div style=%34text-align%3a left;%34>Hello, readers of the JanRain blog. I haven%38#39;t posted here before, so I%38#39;ll start with a brief introduction of myself. My name is Carl Howells. I%38#39;m a software engineer who%38#39;s been working at JanRain for a bit over six years now. In that time, I%38#39;ve worked on a more projects than I can even remember.<%2fdiv>				
											<p>				
												As far as things relevant to the current world go, I was a very early implementer of the original OpenID proposal. My work helped uncover some holes in the initial proposal, and I felt like I contributed some useful bits.<%2fp>				
											<p>	As JanRain continued in that space, I helped with initial versions of the OpenID 2.0 specification, but I eventually moved into handling implementation of the spec, and left writing it to those with more experience writing formal specifications.<%2fp>				
											<p>	In the time since, I%38#39;ve worked on all of JanRain%38#39;s OpenID-related products. I currently help maintain and develop all of them, with most of my time spent on RPX.<%2fp>				
											<p>	A couple months ago, I was asked if I wanted to attend the 10th annual <a href=%34http%3a%2f%2fwww.internetidentityworkshop.com%2f%34>Internet Identity Workshop<%2fa> (IIW), as our more technical representative. I hadn%38#39;t previously attended an IIW, and I didn%38#39;t know what to expect. The idea was a bit scary, but I agreed. With some trepidation, I woke up exceedingly early (in engineer time) Monday morning, packed for the trip, drove to the airport, and soon found myself at IIW.<%2fp>				
											<p>	After the intro speech, <span style=%34font-weight%3a bold;%34>Kaliya Hamlin <%2fspan>(<a href=%34http%3a%2f%2fwww.identitywoman.net%2f%34>IdentityWoman<%2fa>, the co-founder%2ffacilitator of IIW, and one of the few present I had met before) explained the format. The short version is %38quot;anyone can propose any topic for discussion, anyone can join any discussion they like.%38quot; Topics were scheduled in different areas of the workshop space at the beginning of each day.<%2fp>				
											<p>	I spent the day checking out various sessions. Some, like the in-depth discussion of <span style=%34font-weight%3a bold;%34>David Recordon<%2fspan>%38#39;s <a href=%34http%3a%2f%2fopenidconnect.com%2f%34>OpenID Connect<%2fa> proposal, were discussions of technologies directly related to our business. Others were peripherally related to directions future products might take, like Alan Karp%38#39;s discussion of <a href=%34http%3a%2f%2fiiw.idcommons.net%2fVoluntary_Oblivious_Compliance%34>Voluntary Oblivious Compliance<%2fa>. Finally, there were a couple that turned out to have no real relation to anything JanRain%38#39;s doing, but still fascinated me.<%2fp>				
											<p>	At the close of the day, everyone retired to the dinner generously provided at an excellent Italian restaurant by several of the conference%38#39;s sponsors. I spent a short time in a conversation with <a href=%34http%3a%2f%2fwww.xmlgrrl.com%2fblog%2fwelcome%2f%34>Eve Maler<%2fa> and several others, the main topic being the seeming death of XML validation. I soon moved on to introduce myself to <a href=%34http%3a%2f%2fwww.sakimura.org%2fen%2f%34>Nat Sakimura<%2fa> and a gentleman whose name I%38#39;ve forgotten from the Dutch government.<%2fp>				
											<p>	We had a long discussion about OpenID, population sizes, and how pretty Oregon is. I had a great time getting to know people working in very distinct government environments. We discussed use cases each government had, and how they%38#39;re building their solutions on top of OpenID. It was a great reminder that governments have very different requirements from commercial entities, and that they%38#39;re active in getting their needs addressed as well.<%2fp>				
											<p>	Soon dinner was served, and we retired to the hotel afterwards. Brian Kissel, CEO of JanRain, is an alumnus of Stanford. This lets him reserve rooms at the Stanford Guest House. It was a terrifically surreal experience to stay at a hotel that was behind the security checkpoint for SLAC, the Stanford Linear Accelerator.<%2fp>				
											<p>	The highlight of day two was attending Nat Sakimura%38#39;s presentation on his <a href=%34http%3a%2f%2fwiki.openid.net%2fArtifact_Binding%34>OpenID artifact binding<%2fa> proposal, a specification JanRain will watch closely as it progresses in the future. It%38#39;s a proposal for detaching the data transfer in OpenID from the protocol exchange itself, resulting in significantly less data sent through the user%38#39;s web browser. This also provides opportunities for stronger data protection policies to be developed. It is a clean solution to several different issues we face today, and it allows new features for OpenID in the future as well.<%2fp>				
											<p>	Day three was shorter than the rest, with fewer time slots for sessions, and fewer sessions distributed among those time slots. I spent most of the day talking one-on-one with various people. I was pleased to have Nat Sakimura ask for my thoughts about his proposal for artifact binding, and ask me to join the working group so I could continue contributing in the future.<%2fp>				
											<p>	The biggest standout from the conference was the sheer size of it. IIW 10 was 30% larger than any previous IIW meeting. The involvement from both industry and individuals is taking off, and it%38#39;s clear that we%38#39;re just seeing the beginning of this movement.<%2fp>				
											<p>	As for me? It%38#39;s good to see what%38#39;s going on out in the world. But it%38#39;s also going to be good to get back to work on the ever-increasing list of tasks on my plate.<%2fp>				
											<p>	____<%2fp>				
											<p>	Carl Howells<br %2f>				
												Software Engineer<br %2f>				
												JanRain<%2fp>",
		"plainText" :"Hello, readers of the JanRain blog. I haven&#39;t posted here before, so I&#39;ll start with a brief introduction of myself. My name is Carl Howells. I&#39;m a software engineer who&#39;s been working at JanRain for a bit over six years now. In that time, I&#39;ve worked on a more projects than I can even remember.  	As far as things relevant to the current world go, I was a very early implementer of the original OpenID proposal. My work helped uncover some holes in the initial proposal, and I felt like I contributed some useful bits.  	As JanRain continued in that space, I helped with initial versions of the OpenID 2.0 specification, but I eventually moved into handling implementation of the spec, and left writing it to those with more experience writing formal specifications.  	In the time since, I&#39;ve worked on all of JanRain&#39;s OpenID-related products. I currently help maintain and develop all of them, with most of my time spent on RPX.  	A couple months ago, I was asked if I wanted to attend the 10th annual  Internet Identity Workshop  (IIW), as our more technical representative. I hadn&#39;t previously attended an IIW, and I didn&#39;t know what to expect. The idea was a bit scary, but I agreed. With some trepidation, I woke up exceedingly early (in engineer time) Monday morning, packed for the trip, drove to the airport, and soon found myself at IIW.  	After the intro speech,  Kaliya Hamlin  ( IdentityWoman , the co-founder/facilitator of IIW, and one of the few present I had met before) explained the format. The short version is &quot;anyone can propose any topic for discussion, anyone can join any discussion they like.&quot; Topics were scheduled in different areas of the workshop space at the beginning of each day.  	I spent the day checking out various sessions. Some, like the in-depth discussion of  David Recordon &#39;s  OpenID Connect  proposal, were discussions of technologies directly related to our business. Others were peripherally related to directions future products might take, like Alan Karp&#39;s discussion of  Voluntary Oblivious Compliance . Finally, there were a couple that turned out to have no real relation to anything JanRain&#39;s doing, but still fascinated me.  	At the close of the day, everyone retired to the dinner generously provided at an excellent Italian restaurant by several of the conference&#39;s sponsors. I spent a short time in a conversation with  Eve Maler  and several others, the main topic being the seeming death of XML validation. I soon moved on to introduce myself to  Nat Sakimura  and a gentleman whose name I&#39;ve forgotten from the Dutch government.  	We had a long discussion about OpenID, population sizes, and how pretty Oregon is. I had a great time getting to know people working in very distinct government environments. We discussed use cases each government had, and how they&#39;re building their solutions on top of OpenID. It was a great reminder that governments have very different requirements from commercial entities, and that they&#39;re active in getting their needs addressed as well.  	Soon dinner was served, and we retired to the hotel afterwards. Brian Kissel, CEO of JanRain, is an alumnus of Stanford. This lets him reserve rooms at the Stanford Guest House. It was a terrifically surreal experience to stay at a hotel that was behind the security checkpoint for SLAC, the Stanford Linear Accelerator.  	The highlight of day two was attending Nat Sakimura&#39;s presentation on his  OpenID artifact binding  proposal, a specification JanRain will watch closely as it progresses in the future. It&#39;s a proposal for detaching the data transfer in OpenID from the protocol exchange itself, resulting in significantly less data sent through the user&#39;s web browser. This also provides opportunities for stronger data protection policies to be developed. It is a clean solution to several different issues we face today, and it allows new features for OpenID in the future as well.  	Day three was shorter than the rest, with fewer time slots for sessions, and fewer sessions distributed among those time slots. I spent most of the day talking one-on-one with various people. I was pleased to have Nat Sakimura ask for my thoughts about his proposal for artifact binding, and ask me to join the working group so I could continue contributing in the future.  	The biggest standout from the conference was the sheer size of it. IIW 10 was 30% larger than any previous IIW meeting. The involvement from both industry and individuals is taking off, and it&#39;s clear that we&#39;re just seeing the beginning of this movement.  	As for me? It&#39;s good to see what&#39;s going on out in the world. But it&#39;s also going to be good to get back to work on the ever-increasing list of tasks on my plate.  	____  	Carl Howells 	Software Engineer 	JanRain",
		"date" : "May 21, 2010 3:36 AM",
	},
	"story" : 
	{
		"title" : "Janrain RPX Enables Publishing to Google Buzz",
		"link" : "http://www.janrain.comblogs/janrain-rpx-enables-publishing-google-buzz",
		"creator" : "Michael Olson",
		"description" : "<p style=%34background%3a#eee;padding%3a15px;%34><em><strong>Update%3a<%2fstrong> We have temporarily disabled support for Google Buzz functionality while we work with Google on improvements to the user experience. Google%38#39;s roadmap includes implementing Google Buzz scopes for the OAuth Hybrid. This support will create a more graceful login experience. Please stay tuned and look for updates on the <a href=%34http%3a%2f%2ffeedback.janrain.com%2fforums%2f62331-janrain-engage-formerly-rpx-%34>Janrain UserVoice forum<%2fa>.<%2fem><%2fp>				
											<p>Google today <a href=%34http%3a%2f%2fgooglecode.blogspot.com%2f2010%2f05%2fintroducing-google-buzz-api.html%34>announced<%2fa> API support for publishing to Google Buzz. Built right into Gmail - where you already communicate with the people you care about - Google Buzz allows longer posts and rich media attachments and enables users to view shared videos and photos inline. Through our participation in the Buzz API program, I am happy to announce that JanRain customers now have the option to engage this social network by allowing users to publish activity on your site back to their Google Buzz followers.<%2fp>				
											<p>	JanRain customers can deploy Google Buzz on their website in one of two ways - by simply dragging and dropping Google Buzz as a provider on RPX%38#39;s social publishing widget or by leveraging our API wrapper for custom UI implementations.<%2fp>				
											<div style=%34text-align%3a center;%34><a href=%34http%3a%2f%2f1.bp.blogspot.com%2f_5bYjpYVN3Uo%2fS_QtmZddb_I%2fAAAAAAAAAPs%2fydbZyY09-RM%2fs1600%2frpx-social-widget-google-buzz-screenshot.JPG%34 onblur=%34try {parent.deselectBloggerImageGracefully();} catch(e) {}%34><img alt=%34%34 id=%34BLOGGER_PHOTO_ID_5473049584854724594%34 src=%34%2fsites%2fdefault%2ffiles%2fblog-images%2frpx-social-widget-google-buzz-screenshot.JPG%34 style=%34border-style%3a solid; border-width%3a 0px; margin%3a 0px auto 10px; display%3a block; text-align%3a center; cursor%3a pointer; width%3a 299px; height%3a 207px;%34 %2f><%2fa><br %2f>				
												<span style=%34font-size%3a 78%;%34><span style=%34font-weight%3a bold;%34>JanRain RPX social publishing widget with new support for Google Buzz<%2fspan><%2fspan><%2fdiv>				
											<p>				
												JanRain customers DivineCaroline and Qype have rolled out publishing support for Google Buzz.<a href=%34http%3a%2f%2fwww.divinecaroline.com%2f%34><%2fa><%2fp>				
											<p>	DivineCaroline, the flagship site of <a href=%34http%3a%2f%2fwww.realgirlsmedia.com%2f%34>Real Girls Media Network, Inc.<%2fa> is an online community that enables members to easily submit and automatically publish their thoughts and stories.<%2fp>				
											<p>	%38ldquo;Low barriers to user registration and participation in the community on DivineCaroline are very important to Real Girls Media. We also want to enable our users to easily share their writing on other social sites such as Google Buzz. We are delighted that JanRain enables us to provide these features cheaply, easily and in a timely manner, as well as continues to be on the forefront of driving open standards,%38rdquo; said Thomas Kudrycki, co-founder and EVP of Technology at Real Girls Media.<%2fp>				
											<div style=%34text-align%3a center;%34><a href=%34http%3a%2f%2f3.bp.blogspot.com%2f_5bYjpYVN3Uo%2fS_QtcG9IKHI%2fAAAAAAAAAPk%2fBbH7QWk2Bzk%2fs1600%2fdivinecaroline-google-buzz.jpg%34 onblur=%34try {parent.deselectBloggerImageGracefully();} catch(e) {}%34><img alt=%34%34 id=%34BLOGGER_PHOTO_ID_5473049408088582258%34 src=%34%2fsites%2fdefault%2ffiles%2fblog-images%2fdivinecaroline-google-buzz.jpg%34 style=%34border-style%3a solid; border-width%3a 0px; margin%3a 0px auto 10px; display%3a block; text-align%3a center; cursor%3a pointer; width%3a 400px; height%3a 216px;%34 %2f><%2fa>				
											<p>	<span style=%34font-size%3a 78%;%34><span style=%34font-weight%3a bold;%34>DivineCaroline%38rsquo;s user interface for posting a comment to Google Buzz or Facebook using JanRain RPX<%2fspan><%2fspan><%2fp><%2fdiv>				
											<p><a href=%34http%3a%2f%2fwww.qype.co.uk%2f%34><br %2f>				
												Qype<%2fa> is Europe%38rsquo;s largest user-generated local review site, with sites in 10 countries and 7 languages, and mobile apps on most major platforms.<%2fp>				
											<p>	%38ldquo;It%38rsquo;s really important for our users to be able to publish their content to as wide an audience as possible, and using RPX, we make that very easy for them. Both sign-up and sharing are now one-click experiences, and it%38rsquo;s great to easily bring this to our iPhone application too,%38rdquo; said Phil Chambers, CTO at Qype. %38ldquo;We will roll out public publishing support for Google Buzz on May 20.%38rdquo;<%2fp>				
											<div style=%34text-align%3a center;%34><a href=%34http%3a%2f%2f4.bp.blogspot.com%2f_5bYjpYVN3Uo%2fS_Q03jYT9BI%2fAAAAAAAAAP8%2fnCGx8NkDV7Q%2fs1600%2fqype-google-buzz.jpg%34 onblur=%34try {parent.deselectBloggerImageGracefully();} catch(e) {}%34><img alt=%34%34 id=%34BLOGGER_PHOTO_ID_5473057576156656658%34 src=%34%2fsites%2fdefault%2ffiles%2fblog-images%2fqype-google-buzz.jpg%34 style=%34border-style%3a solid; border-width%3a 0px; margin%3a 0px auto 10px; display%3a block; text-align%3a center; cursor%3a pointer; width%3a 400px; height%3a 346px;%34 %2f><%2fa>				
											<p>	<span style=%34font-size%3a 78%;%34><span style=%34font-weight%3a bold;%34>Qype%38#39;s user interface for publishing a review to up to 5 social networks, including Google Buzz, using JanRain RPX<%2fspan><%2fspan><%2fp><%2fdiv>				
											<p>				
												Both sites enable their users to either register or login with a third party identity such as Google, Facebook, Yahoo, Twitter and leave a comment on a post. The users are then prompted to publish comments to a social network with a single click.<%2fp>				
											<p>	In addition to posting activity updates to Google Buzz, the release of the API also includes support for searching on activity feeds by latitude, longitude and radius and liking or unliking an activity. Over the next few months JanRain will be releasing features that allow websites to take advantage of the rich feature set around Google Buzz activity streams to build personalized and engaging experiences for their end users.<%2fp>				
											<p>	Lastly, the Google Buzz API has resulted in the adoption of community-developed protocols, formats, and standards for sharing and consuming social content on the web, including ActivityStreams, Atom, AtomPub, JSON, OAuth, PubSubHubbub, MediaRSS, PortableContacts, and more. This is a huge win for the open standards community.<%2fp>				
											<p>	_____<%2fp>				
											<p>	Vidya Shivkumar<br %2f>				
												Director, Product Management<br %2f>				
												JanRain<%2fp>",
		"plainText" :"Update:  We have temporarily disabled support for Google Buzz functionality while we work with Google on improvements to the user experience. Google&#39;s roadmap includes implementing Google Buzz scopes for the OAuth Hybrid. This support will create a more graceful login experience. Please stay tuned and look for updates on the  Janrain UserVoice forum .   Google today  announced  API support for publishing to Google Buzz. Built right into Gmail - where you already communicate with the people you care about - Google Buzz allows longer posts and rich media attachments and enables users to view shared videos and photos inline. Through our participation in the Buzz API program, I am happy to announce that JanRain customers now have the option to engage this social network by allowing users to publish activity on your site back to their Google Buzz followers.  	JanRain customers can deploy Google Buzz on their website in one of two ways - by simply dragging and dropping Google Buzz as a provider on RPX&#39;s social publishing widget or by leveraging our API wrapper for custom UI implementations.      	  JanRain RPX social publishing widget with new support for Google Buzz    	JanRain customers DivineCaroline and Qype have rolled out publishing support for Google Buzz.    	DivineCaroline, the flagship site of  Real Girls Media Network, Inc.  is an online community that enables members to easily submit and automatically publish their thoughts and stories.  	&ldquo;Low barriers to user registration and participation in the community on DivineCaroline are very important to Real Girls Media. We also want to enable our users to easily share their writing on other social sites such as Google Buzz. We are delighted that JanRain enables us to provide these features cheaply, easily and in a timely manner, as well as continues to be on the forefront of driving open standards,&rdquo; said Thomas Kudrycki, co-founder and EVP of Technology at Real Girls Media.      	  DivineCaroline&rsquo;s user interface for posting a comment to Google Buzz or Facebook using JanRain RPX       	Qype  is Europe&rsquo;s largest user-generated local review site, with sites in 10 countries and 7 languages, and mobile apps on most major platforms.  	&ldquo;It&rsquo;s really important for our users to be able to publish their content to as wide an audience as possible, and using RPX, we make that very easy for them. Both sign-up and sharing are now one-click experiences, and it&rsquo;s great to easily bring this to our iPhone application too,&rdquo; said Phil Chambers, CTO at Qype. &ldquo;We will roll out public publishing support for Google Buzz on May 20.&rdquo;      	  Qype&#39;s user interface for publishing a review to up to 5 social networks, including Google Buzz, using JanRain RPX     	Both sites enable their users to either register or login with a third party identity such as Google, Facebook, Yahoo, Twitter and leave a comment on a post. The users are then prompted to publish comments to a social network with a single click.  	In addition to posting activity updates to Google Buzz, the release of the API also includes support for searching on activity feeds by latitude, longitude and radius and liking or unliking an activity. Over the next few months JanRain will be releasing features that allow websites to take advantage of the rich feature set around Google Buzz activity streams to build personalized and engaging experiences for their end users.  	Lastly, the Google Buzz API has resulted in the adoption of community-developed protocols, formats, and standards for sharing and consuming social content on the web, including ActivityStreams, Atom, AtomPub, JSON, OAuth, PubSubHubbub, MediaRSS, PortableContacts, and more. This is a huge win for the open standards community.  	_____  	Vidya Shivkumar 	Director, Product Management 	JanRain",
		"date" : "May 19, 2010 8:45 AM",
		"images" : 	
		[
			"/sites/default/files/blog-images/rpx-social-widget-google-buzz-screenshot.JPG",
			"/sites/default/files/blog-images/divinecaroline-google-buzz.jpg",
			"/sites/default/files/blog-images/qype-google-buzz.jpg"
		]
	},
	"story" : 
	{
		"title" : "Five Best Practices in Online User Registration",
		"link" : "http://www.janrain.comblogs/five-best-practices-online-user-registration",
		"creator" : "Michael Olson",
		"description" : "<p><a href=%34http%3a%2f%2f4.bp.blogspot.com%2f_5bYjpYVN3Uo%2fS-3V2PEY1NI%2fAAAAAAAAAOw%2fBbjmCQiEDL0%2fs1600%2fmarketing-brief-user-registration-shot.JPG%34 onblur=%34try {parent.deselectBloggerImageGracefully();} catch(e) {}%34><img alt=%34%34 id=%34BLOGGER_PHOTO_ID_5471264250059609298%34 src=%34%2fsites%2fdefault%2ffiles%2fblog-images%2fmarketing-brief-user-registration-shot.JPG%34 style=%34border-style%3a solid; border-width%3a 0px; margin%3a 0pt 0pt 10px 10px; float%3a right; cursor%3a pointer; width%3a 223px; height%3a 274px;%34 %2f><%2fa>%38nbsp;We just published the 2nd in our series of Marketing Briefs. This paper highlights five key best practices for websites to optimize their user registration process. By following these guidelines, websites can achieve increased registration and conversion rates, and learn more about their site audience.<%2fp>				
											<p>	This paper is designed to be a hands-on guide for marketers, developers, product managers and anyone in between that seeks to make their site%38#39;s registration process more intuitive and simple as part of an online user engagement strategy.<%2fp>				
											<p>	The key takeaways from the paper are%3a<%2fp>				
											<ul>				
											<li><span style=%34font-weight%3a bold;%34>Keep it simple, don%38#39;t hide <%2fspan><span style=%34font-weight%3a bold;%34>it<%2fspan><%2fli>				
											<li style=%34font-weight%3a bold;%34>Provide a choice in how a user registers<%2fli>				
											<li style=%34font-weight%3a bold;%34>User interface counts<%2fli>				
											<li><span style=%34font-weight%3a bold;%34>Watch, learn and adjust<%2fspan><%2fli>				
											<li><span style=%34font-weight%3a bold;%34>Make the most of user profile data<%2fspan><%2fli>				
											<%2ful>				
											<p>We invite you to read the new JanRain Marketing Brief and share your feedback. <a href=%34%2fmarketing_resources%2fbriefs%2fuser_registration%34>Click here<%2fa> to download the paper.<%2fp>",
		"plainText" :"&nbsp;We just published the 2nd in our series of Marketing Briefs. This paper highlights five key best practices for websites to optimize their user registration process. By following these guidelines, websites can achieve increased registration and conversion rates, and learn more about their site audience.  	This paper is designed to be a hands-on guide for marketers, developers, product managers and anyone in between that seeks to make their site&#39;s registration process more intuitive and simple as part of an online user engagement strategy.  	The key takeaways from the paper are:    Keep it simple, don&#39;t hide   it   Provide a choice in how a user registers  User interface counts   Watch, learn and adjust    Make the most of user profile data    We invite you to read the new JanRain Marketing Brief and share your feedback.  Click here  to download the paper.",
		"date" : "May 15, 2010 12:15 PM",
		"images" : 	
		[
			"/sites/default/files/blog-images/marketing-brief-user-registration-shot.JPG"
		]
	}
}