{  "feed" :  [  	{      "story" :      {        "title" : "Janrain Engage for iPhone now supports sharing via Email and SMS",        "description" : "<p>In October, as part of our ongoing feature enhancements to <a href=&quot;/products/engage/mobile&quot;>Janrain Engage for Mobile</a>, we released the ability for iPhone Apps to enable <a href=&quot;/blogs/janrain-engage-makes-it-easy-iphone-users-share-social-networks&quot;>sharing</a>&nbsp;to social networks such as Facebook, Twitter, LinkedIn and others. Janrain&rsquo;s iPhone SDK was released as a beta to give our customers and the mobile community an opportunity to test drive and provide input in areas such as ease of implementation, comprehensiveness of feature set, and customizations offered.</p> <p>We are extremely happy with the amount and quality of feedback, and adoption of our iPhone SDK. Today we are announcing that Janrain Engage for iPhone is officially out of beta. &nbsp;In addition to enabling social logins and sharing, the Janrain iPhone SDK now allows mobile apps to:</p>  <ul> <li>Share content, activities, game scores or invitations via Email or SMS.</li> <li>Customize the login experience by displaying native and social login options on the same screen</li> <li>Track popularity and click through rates on various links included in the shared email message with automatic URL shortening for up to 5 URLs.</li> <li>Provide an additional level of security with forced re-authentication when users are about to make a purchase or conduct a sensitive transaction.</li>  <li>Configure and maintain separate lists of providers for mobile and web apps</li> <li>Match the look and feel of the iPhone app with customizable background colors, images, and navigation bar tints.</li> </ul> <p><img alt=%34%34 src=%34/sites/default/files/iphone-janrain-examples.jpg%34 style=%34width: 280px; height: 183px; %34 /></p>  <p>Our iPhone SDK is very easy to use, but don&rsquo;t just take our word for it. We&rsquo;ve been asking a few of our customers for their opinions:</p> <p><em>&ldquo;We chose Janrain Engage for ChatTime as we want our users to have a seamless sign-up process. We wanted to avoid presenting the user with&nbsp;unnecessary&nbsp;fields to complete, which on such a small screen can be very painful to complete and often result in uncompleted registrations.&nbsp;The Janrain libraries were flexible enough to allow our development team to manipulate code when necessary. The outcome is an integrated fully transparent sign-up process. We will soon implement Social Sharing, so our customers can share their ChatTime experience socially.&nbsp;&ldquo; </em></p>  <p><em>----- </em>Charles Tidswell, VP Marketing at SmartRoam, developers of <a href=&quot;http://chattimeapp.com/&quot; target=&quot;_blank&quot;>ChatTime</a>, an iPhone App for international calling.</p> <p><em>&quot;We&#39;ve dramatically increased our registered user base using the iPhone platform with Janrain&#39;s help. We use Janrain to collect email addresses and some demographic information, which is an important part of our business. We&#39;re definitely very pleased with how easy it is to sign in through the app and then leverage social sharing once a user uploads a look. This is all made really easy with Janrain.&quot; </em></p>  <p><em>-----</em>Simon Holroyd, CTO, <a href=&quot;http://www.gotryiton.com&quot; target=&quot;_blank&quot;>Go Try It On</a>, an innovative fashion community web site that lets users get and give opinions on looks.</p> <p>If you are not familiar with <a href=&quot;http://itunes.apple.com/app/id385527085&quot; target=&quot;_blank&quot;>ChatTime</a>&nbsp;or <a href=&quot;http://itunes.apple.com/us/app/go-try-it-on-get-fashion-style/id398392143?mt=8&quot; target=&quot;_blank&quot;>Go Try It On,</a>&nbsp;we encourage you to visit the iTunes store to check out their cool apps.</p>  <p>We would like to thank everyone who participated in the recent <a href=&quot;/blogs/calling-all-portland-iphone-developers-we-need-your-help&quot;>hackathon</a>&nbsp;held in our offices in Portland, and to the many beta testers and early adopters of the SDK.</p> <p>If you would like to use our SDK in your iPhone App, please set up a free <a href=&quot;/products/engage/get-janrain-engage&quot;>Janrain Engage Basic account</a>&nbsp;to try it out today. If you would like to learn more about our mobile offerings, please visit our <a href=&quot;/products/engage/mobile&quot;>Mobile products page</a>.</p>  <p>Current Janrain customers can get started by visiting the&nbsp;<a href=&quot;http://www.rpxnow.com/&quot;>Janrain Engage product dashboard</a>. You will be guided through the download and implementation process. While the SDK can be used within iPad and universal apps, we will soon be releasing a version that is optimized for the iPad.</p> <p>We hope you enjoy implementing <a href=&quot;/products/engage/get-janrain-engage&quot;>Janrain Engage in your iPhone Apps</a>!</p>  <p>&nbsp;</p> ",        "plainText" : "In October, as part of our ongoing feature enhancements to Janrain Engage for Mobile, we released the ability for iPhone Apps to enable sharing to social networks such as Facebook, Twitter, LinkedIn and others. Janrain's iPhone SDK was released as a beta to give our customers and the mobile community an opportunity to test drive and provide input in areas such as ease of implementation, comprehensiveness of feature set, and customizations offered. We are extremely happy with the amount and quality of feedback, and adoption of our iPhone SDK. Today we are announcing that Janrain Engage for iPhone is officially out of beta.  In addition to enabling social logins and sharing, the Janrain iPhone SDK now allows mobile apps to:   Share content, activities, game scores or invitations via Email or SMS. Customize the login experience by displaying native and social login options on the same screen Track popularity and click through rates on various links included in the shared email message with automatic URL shortening for up to 5 URLs. Provide an additional level of security with forced re-authentication when users are about to make a purchase or conduct a sensitive transaction.  Configure and maintain separate lists of providers for mobile and web apps Match the look and feel of the iPhone app with customizable background colors, images, and navigation bar tints.    Our iPhone SDK is very easy to use, but don't just take our word for it. We've been asking a few of our customers for their opinions: %34We chose Janrain Engage for ChatTime as we want our users to have a seamless sign-up process. We wanted to avoid presenting the user with unnecessary fields to complete, which on such a small screen can be very painful to complete and often result in uncompleted registrations. The Janrain libraries were flexible enough to allow our development team to manipulate code when necessary. The outcome is an integrated fully transparent sign-up process. We will soon implement Social Sharing, so our customers can share their ChatTime experience socially. %34   ----- Charles Tidswell, VP Marketing at SmartRoam, developers of ChatTime, an iPhone App for international calling. %34We've dramatically increased our registered user base using the iPhone platform with Janrain's help. We use Janrain to collect email addresses and some demographic information, which is an important part of our business. We're definitely very pleased with how easy it is to sign in through the app and then leverage social sharing once a user uploads a look. This is all made really easy with Janrain.%34   -----Simon Holroyd, CTO, Go Try It On, an innovative fashion community web site that lets users get and give opinions on looks. If you are not familiar with ChatTime or Go Try It On, we encourage you to visit the iTunes store to check out their cool apps.  We would like to thank everyone who participated in the recent hackathon held in our offices in Portland, and to the many beta testers and early adopters of the SDK. If you would like to use our SDK in your iPhone App, please set up a free Janrain Engage Basic account to try it out today. If you would like to learn more about our mobile offerings, please visit our Mobile products page.  Current Janrain customers can get started by visiting the Janrain Engage product dashboard. You will be guided through the download and implementation process. While the SDK can be used within iPad and universal apps, we will soon be releasing a version that is optimized for the iPad. We hope you enjoy implementing Janrain Engage in your iPhone Apps!    ",        "link" : "http://www.janrain.comblogs/janrain-engage-iphone-now-supports-sharing-email-and-sms",        "creator" : "Katie Keenan",        "date" : "Dec 9, 2010 1:57 PM",        "images" :        [          "/sites/default/files/iphone-janrain-examples.jpg"        ]      }    },    {      "story" :      {        "title" : "Janrain Engage for Drupal 7 now in Beta",        "description" : "<p><img alt=%34%34 src=%34/sites/default/files/drupal7-janrain.gif%34 style=%34padding-top: 0px; padding-right: 0px; padding-bottom: 20px; padding-left: 20px; float: right; width: 180px; height: 116px; %34 />If your website is powered by Drupal, you were probably excited when the much awaited Drupal 7&nbsp;<a href=&quot;http://en.wikipedia.org/wiki/Drupal#History&quot; style=&quot;color: rgb(0, 157, 220); text-decoration: none; &quot; target=&quot;_blank&quot;>Release Candidate 1</a>&nbsp;was posted on December 1, 2010. Following close on heels of the RC1 release, Janrain is equally excited to announce social login and social sharing support for the latest version of the web content management platform that powers an estimated 7.2 million websites including popular destinations such as&nbsp;<a href=&quot;http://www.economist.com/&quot; style=&quot;color: rgb(0, 157, 220); text-decoration: none; &quot;>The Economist</a>,&nbsp;<a href=&quot;http://www.whitehouse.gov/&quot; style=&quot;color: rgb(0, 157, 220); text-decoration: none; &quot; target=&quot;_blank&quot;>The White House</a>, and&nbsp;<a href=&quot;http://data.gov.uk/&quot; style=&quot;color: rgb(0, 157, 220); text-decoration: none; &quot; target=&quot;_blank&quot;>data.gov.uk</a>.</p>  <p>The <a href=&quot;http://drupal.org/project/rpx&quot; target=&quot;_blank&quot;>Janrain Engage Module</a> allows Drupal 7 based sites to offer quick <a href=&quot;/products/engage/social-login&quot;>sign ups and logins</a> for their users via their social network identities from Facebook, Twitter, Google, Yahoo!, LinkedIn and <a href=&quot;/solutions/supported-networks&quot;>others</a>. Engage also enables <a href=&quot;/products/engage/social-sharing&quot;>social sharing</a> of comments or other activities on the website with users&rsquo; friends on multiple social networks. Websites can import a user&rsquo;s profile picture from their social network for use as their Drupal profile picture.</p>  <p>Drupal 7 based websites have the flexibility of mapping user profiles to either Drupal&rsquo;s core profile fields or to the more extensible Profile 2 fields. Janrain Engage not only simplifies the process of pre-filling site registration forms with a users&rsquo; profile from social networks but also minimizes set up and implementation time associated with profile mapping. Since Engage normalizes all user profile data returned by social networks to the <a href=&quot;http://www.portablecontacts.net/&quot; target=&quot;_blank&quot;>portable contacts </a>format, websites only need to set up the mappings once via the Drupal 7 administrative interface. Website administrators, and more specifically online marketing managers, can easily modify the choice of social networks offered for the purposes of signing into the site without needing to reconfigure the mappings.</p> <p>Screen shot below shows the initial configuration of profile mappings via the Drupal administrative interface.</p>  <p><img alt=%34%34 src=%34/sites/default/files/drupal-profile-mapping.gif%34 style=%34width: 280px; height: 136px; %34 /></p> <p><meta content=&quot;text/html;charset=UTF-8&quot; http-equiv=&quot;Content-Type&quot; /></p>  <p>Configuration of social networks used for signing in shown below.</p> <p><img alt=%34%34 src=%34/sites/default/files/drupal-identity-providers.gif%34 style=%34width: 280px; height: 259px; %34 /></p> <p>To see this Engage for Drupal 7 in action and experience the sign-in and social sharing experience from the perspective of your website users, <a href=&quot;http://plugins.janrain.com/drupal7/&quot; target=&quot;_blank&quot;>click here</a>. Please let us know what you think.&nbsp;</p>",        "plainText" : "If your website is powered by Drupal, you were probably excited when the much awaited Drupal 7 Release Candidate 1 was posted on December 1, 2010. Following close on heels of the RC1 release, Janrain is equally excited to announce social login and social sharing support for the latest version of the web content management platform that powers an estimated 7.2 million websites including popular destinations such as The Economist, The White House, and data.gov.uk.  The Janrain Engage Module allows Drupal 7 based sites to offer quick sign ups and logins for their users via their social network identities from Facebook, Twitter, Google, Yahoo!, LinkedIn and others. Engage also enables social sharing of comments or other activities on the website with users' friends on multiple social networks. Websites can import a user's profile picture from their social network for use as their Drupal profile picture.  Drupal 7 based websites have the flexibility of mapping user profiles to either Drupal's core profile fields or to the more extensible Profile 2 fields. Janrain Engage not only simplifies the process of pre-filling site registration forms with a users' profile from social networks but also minimizes set up and implementation time associated with profile mapping. Since Engage normalizes all user profile data returned by social networks to the portable contacts format, websites only need to set up the mappings once via the Drupal 7 administrative interface. Website administrators, and more specifically online marketing managers, can easily modify the choice of social networks offered for the purposes of signing into the site without needing to reconfigure the mappings. Screen shot below shows the initial configuration of profile mappings via the Drupal administrative interface.     Configuration of social networks used for signing in shown below.  To see this Engage for Drupal 7 in action and experience the sign-in and social sharing experience from the perspective of your website users, click here. Please let us know what you think. ",        "link" : "http://www.janrain.comblogs/janrain-engage-drupal-7-now-beta",        "creator" : "Vidya Shivkumar",        "date" : "Dec 2, 2010 5:33 PM",        "images" :        [          "/sites/default/files/drupal7-janrain.gif",          "/sites/default/files/drupal-profile-mapping.gif",          "/sites/default/files/drupal-identity-providers.gif"        ]      }    },    {      "story" :      {        "title" : "Janrain's Key Takeaways from WOMMA Summit 2010",        "description" : "<p><img alt=%34%34 src=%34/sites/default/files/summitnext.jpg%34 style=%34padding-top: 0px; padding-right: 0px; padding-bottom: 20px; padding-left: 20px; float: right; width: 250px;%34 />Last week, several members of the <a href=&quot;http://www.janrain.com&quot;>Janrain</a> team travelled to Las Vegas for the <a href=&quot;http://womma.org/summit/&quot; target=&quot;_blank&quot;>WOMMA 2010 Summit</a>. An annual event for the <a href=&quot;http://womma.org/&quot; target=&quot;_blank&quot;>Word of Mouth Marketing Association</a>, the conference brought together 600 marketers to share best practices on creating talkable brands.</p>  <p>I&rsquo;d like to give a big shout out to <a href=&quot;http://twitter.com/leehammond&quot; target=&quot;_blank&quot;>Lee Hammond</a>, Director of New Media at <a href=&quot;http://www.interscope.com/&quot; target=&quot;_blank&quot;>Interscope Geffen A&amp;M Records</a>, and Janrain customer for presenting with us on the topic of &ldquo;<a href=&quot;http://www.slideshare.net/Janrain/acquiring-customersthroughsocialmediaigajanrainwomma&quot; target=&quot;_blank&quot;>Acquiring Customers and Increasing Engagement through Social Media</a>.&rdquo; After kicking off our presentation with the provocative tweet that circulated last year comparing social media to teen sex &quot;everyone wants to do it, but no one knows how,&quot; Lee shared specific examples of how he is leveraging <a href=&quot;/products/engage&quot;>social login tools from Janrain</a> to get fans engaged with their favorite artists. He ended with a live demo of a site that had launched just that week promoting a new single by <a href=&quot;http://www.drdre.com/kush/&quot; target=&quot;_blank&quot;>Dr. Dre</a>. Getting a sneak peak of the MP3 was only accessible after a user had logged in with their Facebook account.&nbsp;</p>  <div id=&quot;__ss_5865761&quot; style=&quot;width:425px&quot;> <object height=&quot;355&quot; id=&quot;__sse5865761&quot; width=&quot;425&quot;><param name=&quot;movie&quot; value=&quot;http://static.slidesharecdn.com/swf/ssplayer2.swf?doc=acquiring-customers-through-social-media-iga-janrain-womma-101122151432-phpapp01&amp;stripped_title=acquiring-customersthroughsocialmediaigajanrainwomma&amp;userName=Janrain&quot; /><param name=&quot;allowFullScreen&quot; value=&quot;true&quot; /><param name=&quot;allowScriptAccess&quot; value=&quot;always&quot; /><embed allowfullscreen=&quot;true&quot; allowscriptaccess=&quot;always&quot; height=&quot;355&quot; name=&quot;__sse5865761&quot; src=&quot;http://static.slidesharecdn.com/swf/ssplayer2.swf?doc=acquiring-customers-through-social-media-iga-janrain-womma-101122151432-phpapp01&amp;stripped_title=acquiring-customersthroughsocialmediaigajanrainwomma&amp;userName=Janrain&quot; type=&quot;application/x-shockwave-flash&quot; width=&quot;425&quot;></embed></object><div style=&quot;padding:5px 0 12px&quot;><em>View more <a href=&quot;http://www.slideshare.net/&quot;>presentations</a> from <a href=&quot;http://www.slideshare.net/Janrain&quot;>Janrain</a>.</em></div>  </div> <p>There were several other hot topics in other sessions such as tracking ROI on social media, key performance indicators, and leveraging social media for specific campaigns. Interesting keynotes from the analyst community, included <a href=&quot;http://twitter.com/jbernoff&quot; target=&quot;_blank&quot;>Josh Bernoff</a> from <a href=&quot;http://www.forrester.com/rb/research&quot; target=&quot;_blank&quot;>Forrester Research</a> and <a href=&quot;http://twitter.com/jowyang&quot; target=&quot;_blank&quot;>Jeremiah Owyang</a> from <a href=&quot;http://www.altimetergroup.com/&quot; target=&quot;_blank&quot;>Altimeter Group</a>. And <a href=&quot;http://www.npr.org/&quot;>NPR&rsquo;s</a> acclaimed <a href=&quot;http://www.kitchensisters.org/&quot; target=&quot;_blank&quot;>Kitchen Sisters</a> gave a fantastic presentation about the art of storytelling. If you aren&rsquo;t familiar with their program, <a href=&quot;http://www.kitchensisters.org/&quot; target=&quot;_blank&quot;>please check it out</a>.</p>  <p>A highlight was a panel of influential bloggers in the social media space sharing thoughts on future trends. One interesting question and a challenge that everyone faced was whether or not brands should focus their marketing attention on the social networks or on their corporate site. The panel was evenly split. It was a theme that emerged in a session the previous day when <a href=&quot;http://www.neimanmarcus.com/&quot; target=&quot;_blank&quot;>Neiman Marcus</a> and <a href=&quot;http://www.brickfish.com/&quot; target=&quot;_blank&quot;>Brickfish</a> presented a case study on their &ldquo;<a href=&quot;http://www.brickfish.com/fashion/NeimanMarcusProm&quot; target=&quot;_blank&quot;>Rock the Prom</a>&rdquo; promotion. If you&rsquo;ve spent years investing in your corporate site, does it really make sense to drive traffic away from it?</p>  <p>We met loads of smart, interesting people, and came away inspired. I always enjoy presentations by the North Carolina based <a href=&quot;http://www.brainsonfire.com/&quot; target=&quot;_blank&quot;>Brains on Fire</a> agency. Geno Church did a masterful job of showing the difference between a campaign and a movement. There were several brilliant insights in his presentation, but a few of my favorites were &ldquo;People are the Killer App&rdquo; and &ldquo;Buzz does not create evangelists; evangelists create Buzz.&rdquo;</p>  <p>In addition to full-day workshops, one evening was turned over to a &ldquo;<a href=&quot;http://www.toms.com/style-your-sole&quot; target=&quot;_blank&quot;>Style Your Sole Party</a>&rdquo; with <a href=&quot;http://www.toms.com/&quot; target=&quot;_blank&quot;>TOMS Shoes</a> sponsored by two Janrain partners &ndash; <a href=&quot;http://www.ning.com&quot; target=&quot;_blank&quot;>Ning</a> and <a href=&quot;http://www.viewpoints.com/&quot; target=&quot;_blank&quot;>Viewpoints</a>. It was great fun to watch the creative flow as everyone hunkered down with paints, appliqués and more to put a personal stamp on a pair of white canvas shoes. If you have an upcoming event, this may be the way to go.</p>  <p>Thank you to WOMMA for another great conference. As a marketer, I am energized by the possibilities with social, and as a member of the Janrain team, I&rsquo;m delighted to offer a solution that will help move the needle for many of my colleagues.</p>",        "plainText" : "Last week, several members of the Janrain team travelled to Las Vegas for the WOMMA 2010 Summit. An annual event for the Word of Mouth Marketing Association, the conference brought together 600 marketers to share best practices on creating talkable brands.  I'd like to give a big shout out to Lee Hammond, Director of New Media at Interscope Geffen A&amp;M Records, and Janrain customer for presenting with us on the topic of %34Acquiring Customers and Increasing Engagement through Social Media.%34 After kicking off our presentation with the provocative tweet that circulated last year comparing social media to teen sex %34everyone wants to do it, but no one knows how,%34 Lee shared specific examples of how he is leveraging social login tools from Janrain to get fans engaged with their favorite artists. He ended with a live demo of a site that had launched just that week promoting a new single by Dr. Dre. Getting a sneak peak of the MP3 was only accessible after a user had logged in with their Facebook account.    View more presentations from Janrain.   There were several other hot topics in other sessions such as tracking ROI on social media, key performance indicators, and leveraging social media for specific campaigns. Interesting keynotes from the analyst community, included Josh Bernoff from Forrester Research and Jeremiah Owyang from Altimeter Group. And NPR's acclaimed Kitchen Sisters gave a fantastic presentation about the art of storytelling. If you aren't familiar with their program, please check it out.  A highlight was a panel of influential bloggers in the social media space sharing thoughts on future trends. One interesting question and a challenge that everyone faced was whether or not brands should focus their marketing attention on the social networks or on their corporate site. The panel was evenly split. It was a theme that emerged in a session the previous day when Neiman Marcus and Brickfish presented a case study on their %34Rock the Prom%34 promotion. If you've spent years investing in your corporate site, does it really make sense to drive traffic away from it?  We met loads of smart, interesting people, and came away inspired. I always enjoy presentations by the North Carolina based Brains on Fire agency. Geno Church did a masterful job of showing the difference between a campaign and a movement. There were several brilliant insights in his presentation, but a few of my favorites were %34People are the Killer App%34 and %34Buzz does not create evangelists; evangelists create Buzz.%34  In addition to full-day workshops, one evening was turned over to a %34Style Your Sole Party%34 with TOMS Shoes sponsored by two Janrain partners - Ning and Viewpoints. It was great fun to watch the creative flow as everyone hunkered down with paints, appliqués and more to put a personal stamp on a pair of white canvas shoes. If you have an upcoming event, this may be the way to go.  Thank you to WOMMA for another great conference. As a marketer, I am energized by the possibilities with social, and as a member of the Janrain team, I'm delighted to offer a solution that will help move the needle for many of my colleagues.",        "link" : "http://www.janrain.comblogs/janrains-key-takeaways-womma-2010",        "creator" : "Lisa Hannah",        "date" : "Nov 22, 2010 9:29 AM",        "images" :        [          "/sites/default/files/summitnext.jpg"        ]      }    },    {      "story" :      {        "title" : "Social Login on the iPhone with Janrain Engage",        "description" : "<p><a href=&quot;http://www.gotryiton.com&quot; target=&quot;_blank&quot;><img alt=%34Go Try It On logo%34 src=%34/sites/default/files/gotryiton.gif%34 style=%34padding: 0pt 0pt 20px 20px; width: 150px; height: 55px; float: right;%34 />Go Try It On</a>, a great new fashion community site, is using <a href=&quot;/products/engage/mobile&quot;>Janrain Engage for iPhone</a> to enable mobile visitors to quickly register or login to its mobile app using their existing social identites. Check out the short video below to see how easy it is to sign-in to Go Try It On&#39;s mobile app from an iPhone, upload a photo of yourself and rate the photos of other members.</p>  <p><iframe frameborder=&quot;0&quot; height=&quot;250&quot; src=&quot;http://player.vimeo.com/video/17009295&quot; width=&quot;400&quot;></iframe></p> <p>See more <a href=&quot;http://vimeo.com/janrain&quot;>Janrain videos</a> on <a href=&quot;http://vimeo.com&quot; target=&quot;_blank&quot;>Vimeo</a>.</p>  <p>Janrain Engage for iPhone is quick and easy to implement, with support both for client-side and richer server-side integrations.</p>",        "plainText" : "Go Try It On, a great new fashion community site, is using Janrain Engage for iPhone to enable mobile visitors to quickly register or login to its mobile app using their existing social identites. Check out the short video below to see how easy it is to sign-in to Go Try It On's mobile app from an iPhone, upload a photo of yourself and rate the photos of other members.   See more Janrain videos on Vimeo.  Janrain Engage for iPhone is quick and easy to implement, with support both for client-side and richer server-side integrations.",        "link" : "http://www.janrain.comblogs/social-login-iphone-janrain-engage",        "creator" : "Michael Olson",        "date" : "Nov 19, 2010 11:36 AM",        "images" :        [          "/sites/default/files/gotryiton.gif"        ]      }    },    {      "story" :      {        "title" : "A Candid Conversation About Janrain Engage",        "description" : "<p>Here at Janrain, we recently discovered an awesome text-to-video tool called <a href=&quot;http://www.xtranormal.com&quot; target=&quot;_blank&quot;>Xtranormal</a>, which lets you create fun dialogue-driven videos in minutes. For those of you wanting to learn more about <a href=&quot;/products/engage&quot;>Janrain Engage</a>, we put together this short clip. We figure that our friends in the video can explain how social login with Janrain Engage works just as well as us.&nbsp; Check it out:</p>  <p><object height=&quot;390&quot; width=&quot;480&quot;><param name=&quot;movie&quot; value=&quot;http://www.xtranormal.com/site_media/players/jwplayer.swf&quot; /><param name=&quot;allowFullScreen&quot; value=&quot;true&quot; /><param name=&quot;allowscriptaccess&quot; value=&quot;always&quot; /><param name=&quot;flashvars&quot; value=&quot;height=390&amp;width=480&amp;file=http://newvideos.xtranormal.com/web_final_lo/b970086c-e63a-11df-a4ef-003048d6740d_21.mp4&amp;image=http://newvideos.xtranormal.com/web_final_lo/b970086c-e63a-11df-a4ef-003048d6740d_21.jpg&amp;link=http://www.xtranormal.com/watch/7536563&amp;searchbar=false&amp;autostart=false&quot; /><embed allowfullscreen=&quot;true&quot; allowscriptaccess=&quot;always&quot; flashvars=&quot;height=390&amp;width=480&amp;file=http://newvideos.xtranormal.com/web_final_lo/b970086c-e63a-11df-a4ef-003048d6740d_21.mp4&amp;image=http://newvideos.xtranormal.com/web_final_lo/b970086c-e63a-11df-a4ef-003048d6740d_21.jpg&amp;link=http://www.xtranormal.com/watch/7536563&amp;searchbar=false&amp;autostart=false&quot; height=&quot;390&quot; src=&quot;http://www.xtranormal.com/site_media/players/jwplayer.swf&quot; width=&quot;480&quot;></embed></object></p>",        "plainText" : "Here at Janrain, we recently discovered an awesome text-to-video tool called Xtranormal, which lets you create fun dialogue-driven videos in minutes. For those of you wanting to learn more about Janrain Engage, we put together this short clip. We figure that our friends in the video can explain how social login with Janrain Engage works just as well as us.  Check it out:  ",        "link" : "http://www.janrain.comblogs/candid-conversation-about-janrain-engage",        "creator" : "Michael Olson",        "date" : "Nov 12, 2010 12:31 AM"      }    },    {      "story" :      {        "title" : "Ning Integrates Janrain Engage for Social Login and Inviting Friends",        "description" : "<p><img alt=%34Ning logo%34 src=%34/sites/default/files/ning.JPG%34 style=%34padding: 0pt 0pt 20px 20px; width: 180px; height: 58px; float: right;%34 /></p>  <p>As reported today by <a href=&quot;http://techcrunch.com/2010/11/10/ning-partners-with-janrain-to-offer-social-sign-ins-to-users/&quot; target=&quot;_blank&quot;>TechCrunch</a> and on the <a href=&quot;http://blog.ning.com/2010/11/introducing-social-sign-in.html&quot; target=&quot;_blank&quot;>Ning blog</a>, we are happy to welcome on board <a href=&quot;http://www.ning.com&quot; target=&quot;_blank&quot;>Ning</a>, the world&rsquo;s largest platform for creating custom social websites. Ning has chosen to implement <a href=&quot;/products/engage&quot;>Janrain Engage</a> in direct response to feedback from their members to offer a more streamlined registration and login process. As they put it, &ldquo;who has the time to create and remember yet another username and password.&rdquo;</p>  <p> We are really excited to be spreading the magic of Janrain Engage across the thousands of Ning networks. Starting today, Ning Plus and Pro Network Creators will be able to offer <a href=&quot;/products/engage&quot;>social registration and login</a>&nbsp;through Facebook, Google or Yahoo, and enable users to <a href=&quot;/products/engage#invite-friends&quot;>invite their friends</a> on social networks to join a Ning site. Ning is looking at adding additional providers in the future.</p> <p> A sample of how Janrain Engage looks for social login on a Ning site:</p>  <p><img alt=%34Ning customer site using Janrain Engage for social sign-in%34 src=%34/sites/default/files/Ning-social-login-2_0.JPG%34 style=%34width: 280px; height: 122px;border:4px solid #eee;%34 /></p> <p>&nbsp;</p>  <p><img alt=%34Ning uses Janrain Engage for social login%34 src=%34/sites/default/files/Ning-social-login-1_0.JPG%34 style=%34width: 280px; height: 102px;border:4px solid #eee;%34 /></p> <p>Here is how Ning uses Janrain Engage to let users invite their friends and contacts:</p>  <p><img alt=%34Invite Friends on Ning with Janrain Engage%34 src=%34/sites/default/files/ning-invite-friends.jpg%34 style=%34width: 280px; height: 126px;border:4px solid #eee;%34 /></p> <p>&nbsp;</p>  <p>The integration of Janrain Engage into Ning&rsquo;s social website platform is another example of technology companies turning to Janrain to power their social login, social sharing and invite friends capabilities.&nbsp; Additional technology companies that have integrated Janrain into their social media platforms include <a href=&quot;http://www.kickapps.com&quot; target=&quot;_blank&quot;>KickApps</a>, <a href=&quot;http://www.wetpaint.com&quot; target=&quot;_blank&quot;>WetPaint</a>, <a href=&quot;http://www.tal.ki&quot; target=&quot;_blank&quot;>Tal.ki</a>, <a href=&quot;http://www.viewpoints.com&quot; target=&quot;_blank&quot;>Viewpoints</a>, <a href=&quot;http://aboutecho.com/&quot; target=&quot;_blank&quot;>Echo</a>, <a href=&quot;http://www.getsatisfaction.com&quot; target=&quot;_blank&quot;>Get Satisfaction</a>, <a href=&quot;http://www.uservoice.com&quot; target=&quot;_blank&quot;>UserVoice</a> and <a href=&quot;http://www.ideascale.com&quot; target=&quot;_blank&quot;>IdeaScale</a>.</p>",        "plainText" : "  As reported today by TechCrunch and on the Ning blog, we are happy to welcome on board Ning, the world's largest platform for creating custom social websites. Ning has chosen to implement Janrain Engage in direct response to feedback from their members to offer a more streamlined registration and login process. As they put it, %34who has the time to create and remember yet another username and password.%34   We are really excited to be spreading the magic of Janrain Engage across the thousands of Ning networks. Starting today, Ning Plus and Pro Network Creators will be able to offer social registration and login through Facebook, Google or Yahoo, and enable users to invite their friends on social networks to join a Ning site. Ning is looking at adding additional providers in the future.  A sample of how Janrain Engage looks for social login on a Ning site:       Here is how Ning uses Janrain Engage to let users invite their friends and contacts:      The integration of Janrain Engage into Ning's social website platform is another example of technology companies turning to Janrain to power their social login, social sharing and invite friends capabilities.  Additional technology companies that have integrated Janrain into their social media platforms include KickApps, WetPaint, Tal.ki, Viewpoints, Echo, Get Satisfaction, UserVoice and IdeaScale.",        "link" : "http://www.janrain.comblogs/ning-integrates-janrain-engage-social-login-and-inviting-friends",        "creator" : "Lisa Hannah",        "date" : "Nov 10, 2010 6:00 PM",        "images" :        [          "/sites/default/files/ning.JPG",          "/sites/default/files/Ning-social-login-2_0.JPG",          "/sites/default/files/Ning-social-login-1_0.JPG",          "/sites/default/files/ning-invite-friends.jpg"        ]      }    },    {      "story" :      {        "title" : "Internet Identity Workshop Wrap Up",        "description" : "<p><img alt=%34%34 src=%34/sites/default/files/identity-workshop.png%34 style=%34padding-top: 0px; padding-right: 0px; padding-bottom: 20px; padding-left: 20px; float: right; width: 180px; height: 99px; %34 />Janrain just wrapped up an exciting couple of days at <a href=&quot;http://www.internetidentityworkshop.com/iiwxi-11-in-mountain-view/&quot; target=&quot;_blank&quot;>Internet Identity Workshop 11</a> (IIW). Jason Cowley, one of Janrain&#39;s Software Engineers, jotted down a few highlights from the event.</p>  <p> This was my first visit to an IIW event, and my first experience with the <a href=&quot;http://en.wikipedia.org/wiki/Unconference&quot; target=&quot;_blank&quot;>Unconference format</a>. With this format, there is no pre-set agenda. Each morning, the attendees gathered together and set the agenda for the day. Anyone had the ability to create a working group by writing down a topic on a card and announcing it the group. We then stuck the cards to a wall in columns under various 1-hour time slots and assigned one of the many available meeting places to each card. Because of this format, the sessions were all focused on the most current topics that were relavent to the group.&nbsp;Attendees were encouraged to only attend meetings in which they would be actively engaged.</p> <p>The sessions for IIW 11 seemed to revolve around a few major themes:</p>  <ul> <li>Refinement and convergence of standards / protocols under development﻿﻿</li> <li>Personal Data Stores</li> <li>Activity Streams</li> <li>Vendor Relationship Management﻿</li>  <li>New paradigms for Authentication, Authorization, and Social Sharing</li> </ul> <p>There were more interesting sessions to attend than there were hours in the day. Here are the highlights from a few that were interesting to me:</p> <p> <strong>Relying Party (RP) Best Practices</strong><br />   Google presented the results of their research on <a href=&quot;https://sites.google.com/site/oauthgoog/UXFedLogin/loginlogic&quot; target=&quot;_blank&quot;>Relying Party Best Practices</a>. One of the common problems that RPs face is how to give users the flexibility to login through multiple identity providers (Google, Facebook, Twitter, etc.) while still mapping each user to a single account on their system. <a href=&quot;/products/engage&quot;>Janrain Engage</a> solves this problem for RPs by providing an <a href=&quot;https://rpxnow.com/docs#mappings&quot; target=&quot;_blank&quot;>account mapping API</a>. Beyond that, though, what are the best practices for guiding a user through the sign-up / sign-in flow to minimize confusion and maximize conversion rates? Some interesting UI paradigms and suggested best practices were presented.</p>  <p> <strong>Stanford University Project</strong><br />  Stanford professor <a href=&quot;http://suif.stanford.edu/~lam/&quot; target=&quot;_blank&quot;>Monica Lam</a> hosted a couple of sessions on a <a href=&quot;http://mobisocial.stanford.edu/index.php#mrprivacy&quot; target=&quot;_blank&quot;>social networking platform</a> under development at Stanford. The goal of the platform is to provide an open, decentralized environment that allows for a wide range of social networking applications to exchange data while still giving users complete control and ownership of their own data. The platform uses existing email protocols to transport JSON data between mobile, device, and desktop applications.</p>  <p> During the demo sessions at IIW, Stanford students demonstrated several applications built on the platform. One application used the very cool technique of connecting mobile devices together by having one device take a picture of a <a href=&quot;http://en.wikipedia.org/wiki/QR_Code&quot; target=&quot;_blank&quot;>QR Code</a> displayed by another mobile device. The QR code contains the information necessary for another device to connect to the user and download the application required to interact with that user. Regardless of whether the platform becomes the standard, the demo gave a really interesting glimpse into the future of social networking, where ad-hoc social networking will become the norm.</p> <p> <strong>Personal Data Stores</strong><br />   There were several sessions on Personal Data Stores (PDS), which are repositories that individuals control and use to share information about themselves, including addresses, medical records, credit cards, etc. Envision a day when you no longer have to type in your address and credit card when you buy something online, but instead provision temporary and controlled access to these resources with the click of a button. Much like Janrain Capture provides a secure, cloud-based repository for web sites to store data today, PDSs will provide this capability to individual users in the future.</p> <p><strong>OAuth 2.0 leeloo Library</strong><br />  The OAuth 2.0 specification is not yet finalized (currently in draft 10), but we already have an<br />  implementation of an OAuth 2.0 authorization server. <a href=&quot;http://bitbucket.org/smartproject/oauth-2.0/wiki/Home&quot; target=&quot;_blank&quot;>Leeloo</a> is an open source library written in Java that implements the current version of the specification. The authors, from NewCastle University, walked through the basic steps required to use the library to set up an OAuth 2.0 server.</p>  <p> Notes from the individual sessions at IIW 11 can be found <a href=&quot;http://iiw.idcommons.net/Notes_IIW11&quot; target=&quot;_blank&quot;>here</a>.</p>",        "plainText" : "Janrain just wrapped up an exciting couple of days at Internet Identity Workshop 11 (IIW). Jason Cowley, one of Janrain's Software Engineers, jotted down a few highlights from the event.   This was my first visit to an IIW event, and my first experience with the Unconference format. With this format, there is no pre-set agenda. Each morning, the attendees gathered together and set the agenda for the day. Anyone had the ability to create a working group by writing down a topic on a card and announcing it the group. We then stuck the cards to a wall in columns under various 1-hour time slots and assigned one of the many available meeting places to each card. Because of this format, the sessions were all focused on the most current topics that were relavent to the group. Attendees were encouraged to only attend meetings in which they would be actively engaged. The sessions for IIW 11 seemed to revolve around a few major themes:   Refinement and convergence of standards / protocols under development﻿﻿ Personal Data Stores Activity Streams Vendor Relationship Management﻿  New paradigms for Authentication, Authorization, and Social Sharing  There were more interesting sessions to attend than there were hours in the day. Here are the highlights from a few that were interesting to me:  Relying Party (RP) Best Practices   Google presented the results of their research on Relying Party Best Practices. One of the common problems that RPs face is how to give users the flexibility to login through multiple identity providers (Google, Facebook, Twitter, etc.) while still mapping each user to a single account on their system. Janrain Engage solves this problem for RPs by providing an account mapping API. Beyond that, though, what are the best practices for guiding a user through the sign-up / sign-in flow to minimize confusion and maximize conversion rates? Some interesting UI paradigms and suggested best practices were presented.   Stanford University Project  Stanford professor Monica Lam hosted a couple of sessions on a social networking platform under development at Stanford. The goal of the platform is to provide an open, decentralized environment that allows for a wide range of social networking applications to exchange data while still giving users complete control and ownership of their own data. The platform uses existing email protocols to transport JSON data between mobile, device, and desktop applications.   During the demo sessions at IIW, Stanford students demonstrated several applications built on the platform. One application used the very cool technique of connecting mobile devices together by having one device take a picture of a QR Code displayed by another mobile device. The QR code contains the information necessary for another device to connect to the user and download the application required to interact with that user. Regardless of whether the platform becomes the standard, the demo gave a really interesting glimpse into the future of social networking, where ad-hoc social networking will become the norm.  Personal Data Stores   There were several sessions on Personal Data Stores (PDS), which are repositories that individuals control and use to share information about themselves, including addresses, medical records, credit cards, etc. Envision a day when you no longer have to type in your address and credit card when you buy something online, but instead provision temporary and controlled access to these resources with the click of a button. Much like Janrain Capture provides a secure, cloud-based repository for web sites to store data today, PDSs will provide this capability to individual users in the future. OAuth 2.0 leeloo Library  The OAuth 2.0 specification is not yet finalized (currently in draft 10), but we already have an  implementation of an OAuth 2.0 authorization server. Leeloo is an open source library written in Java that implements the current version of the specification. The authors, from NewCastle University, walked through the basic steps required to use the library to set up an OAuth 2.0 server.   Notes from the individual sessions at IIW 11 can be found here.",        "link" : "http://www.janrain.comblogs/internet-identity-workshop-wrap",        "creator" : "Jason Cowley",        "date" : "Nov 5, 2010 11:52 AM",        "images" :        [          "/sites/default/files/identity-workshop.png"        ]      }    },    {      "story" :      {        "title" : "Janrain is Hiring!",        "description" : "<p><img alt=%34%34 src=%34/sites/default/files/janrain-logo.png%34 style=%34padding-top: 0px; padding-right: 0px; padding-bottom: 20px; padding-left: 20px; float: right; width: 180px; height: 53px; %34 />Are you looking to join a passionate team at a leading startup in Downtown Portland?&nbsp;Janrain, the leader in user management solutions for the social web, is currently seeking a handful of innovative minds to add further potential to our already accelerated growth. Janrain&#39;s mission is to reinvent how companies interact with their website visitors by improving their registration and login success rate and positively impacting their bottom line.</p>  <p><meta charset=&quot;utf-8&quot; /></p> <p>Here, we&#39;ve asked our managers to say a little bit about what they are looking for in each position.</p> <p><a href=&quot;/company/careers/janrain-partner-relationship-manager&quot;><strong>Partner Relationship Manager</strong></a><br />   Do you get excited by working with strategic partners to enhance the value of products, bring creative solutions to customers, and realize success through the marketing, sales and product innovation coming out of a well structured partnership? Do you have strong business acumen in the online advertising, social media, and Web 2.0 spaces? Are you ready to join one of the fastest growing software companies in Portland? If so then the Partner Relationship Manager role here at Janrain might be right for you.</p> <p><a href=&quot;/careers/technical-product-manager&quot;><strong>Technical Product Manager</strong></a><br />  Do you still enjoy coding on occasion but are passionate about social media, love interfacing with customers and partners and building and shipping features that solve market problems? If you appreciate that there is never a dull moment on the job, then, this might be right role and company for you.</p>  <p><strong><a href=&quot;/careers/ui-designer-developer&quot;>UI/UX Designer</a> and <a href=&quot;/company/careers/software-engineer&quot;>Software Engineer</a></strong><br />  If you are looking for a new challenge building applications on the forefront of technology in an exciting market, then this is the job for you. We develop software utilizing a multitude of tools including but not limited to Ruby on Rails, Haskell, Java, JavaScript, CSS2, Git, EC2, Postgresql, Engix, Memcache, Python, and even a spattering of erlang. So if you think you are up to the challenge give us a shout and drop off you resume at <a href=&quot;mailto:eng_jobs@janrain.com&quot;>eng_jobs@janrain.com</a>.</p>  <p><a href=&quot;/company/careers/account-executive&quot;><strong>Account Executives</strong></a><br />  Only the brave, the hearty, the Type &quot;A&quot; folks that are great communicators and consultants should apply. This is a fast-paced environment where a day feels like a week and there are more opportunities than there are hours in a day. Giants fans and New Yorkers are also welcome to apply.</p> <p><a href=&quot;/careers/janrain-account-manager&quot;><strong>Account Managers</strong></a><br />   If relationship building is your forte and you like to help customers get the most from their audiences, this could be the job for you. Our Account Managers become part of the operating staff at each of our customers and are the SME and overall social media gurus on their teams. Janrain Account Managers are the quarterbacks for our customers when it comes to optimizing and expanding the uses for Janrain products in their businesses.</p> <p><a href=&quot;/janrain-solutions-engineer&quot;><strong>Solutions Engineers</strong></a><br />  Likely the best job at Janrain, getting to work with prospects to find creative solutions to multiply user traffic and all forms of conversions - through assisting in our deployments, every customer is different, with unique needs and an overwhelming desire to know their audience, and this job holds the keys to this palace.</p>  <p>To apply, please follow the instructions under each job listing. If you don&#39;t see the job for you, but are eager to work for our growing company, <a href=&quot;/company/janrain-careers&quot;>check back often</a> as we plan to open new positions throughout the year.<br />  &nbsp;</p>",        "plainText" : "Are you looking to join a passionate team at a leading startup in Downtown Portland? Janrain, the leader in user management solutions for the social web, is currently seeking a handful of innovative minds to add further potential to our already accelerated growth. Janrain's mission is to reinvent how companies interact with their website visitors by improving their registration and login success rate and positively impacting their bottom line.   Here, we've asked our managers to say a little bit about what they are looking for in each position. Partner Relationship Manager   Do you get excited by working with strategic partners to enhance the value of products, bring creative solutions to customers, and realize success through the marketing, sales and product innovation coming out of a well structured partnership? Do you have strong business acumen in the online advertising, social media, and Web 2.0 spaces? Are you ready to join one of the fastest growing software companies in Portland? If so then the Partner Relationship Manager role here at Janrain might be right for you. Technical Product Manager  Do you still enjoy coding on occasion but are passionate about social media, love interfacing with customers and partners and building and shipping features that solve market problems? If you appreciate that there is never a dull moment on the job, then, this might be right role and company for you.  UI/UX Designer and Software Engineer  If you are looking for a new challenge building applications on the forefront of technology in an exciting market, then this is the job for you. We develop software utilizing a multitude of tools including but not limited to Ruby on Rails, Haskell, Java, JavaScript, CSS2, Git, EC2, Postgresql, Engix, Memcache, Python, and even a spattering of erlang. So if you think you are up to the challenge give us a shout and drop off you resume at eng_jobs@janrain.com.  Account Executives  Only the brave, the hearty, the Type %34A%34 folks that are great communicators and consultants should apply. This is a fast-paced environment where a day feels like a week and there are more opportunities than there are hours in a day. Giants fans and New Yorkers are also welcome to apply. Account Managers   If relationship building is your forte and you like to help customers get the most from their audiences, this could be the job for you. Our Account Managers become part of the operating staff at each of our customers and are the SME and overall social media gurus on their teams. Janrain Account Managers are the quarterbacks for our customers when it comes to optimizing and expanding the uses for Janrain products in their businesses. Solutions Engineers  Likely the best job at Janrain, getting to work with prospects to find creative solutions to multiply user traffic and all forms of conversions - through assisting in our deployments, every customer is different, with unique needs and an overwhelming desire to know their audience, and this job holds the keys to this palace.  To apply, please follow the instructions under each job listing. If you don't see the job for you, but are eager to work for our growing company, check back often as we plan to open new positions throughout the year.   ",        "link" : "http://www.janrain.comblogs/janrain-hiring",        "creator" : "Katie Keenan",        "date" : "Nov 4, 2010 11:17 AM",        "images" :        [          "/sites/default/files/janrain-logo.png"        ]      }    },    {      "story" :      {        "title" : "This Week in Identity",        "description" : "<p><img alt=%34%34 src=%34/sites/default/files/identity-workshop.png%34 style=%34padding-top: 0px; padding-right: 0px; padding-bottom: 20px; padding-left: 20px; float: right; width: 180px; height: 99px; %34 />This is an exciting week for the OpenID and OAuth communities. The OpenID summit, sponsored by the <a href=&quot;http://openid.net/foundation/&quot; target=&quot;_blank&quot;>OpenID Foundation</a> and kindly hosted by Facebook, kicked things off on Monday, and will be followed by 3 days at the <a href=&quot;http://www.internetidentityworkshop.com/&quot; target=&quot;_blank&quot;>Internet Identity Workshop</a> (IIW). The summit was a chance for many of the industry players to discuss openly the past, present, and future of authentication, discovery, security, user experience and profile data. Although, much discussion happens year round via mailing lists, it&#39;s always good to have face to face meetings to advance the conversation, especially for many of the contributors who are not based in the San Francisco Bay Area. While much of this conversation will continue at the IIW, the OpenID summit allowed for particular focus on consumer initiated authentication transactions, a particular sweet spot for <a href=&quot;http://www.janrain.com&quot;>Janrain</a>. There was strong representation from Microsoft, Yahoo, Google, Facebook, PayPal, Salesforce, and Mozilla.</p>  <p>It&#39;s hard to pinpoint many absolute conclusions, out of the six hours of discussion. However, as an observer and a participant in this community for many years, it&#39;s clear there are several changes underway in the next wave of buildout. Many of these ideas have been around for a while. While they are bold, some how the consensus is that they are less controversial now, than they were several years ago. Here&#39;s a quick list of where I think the protocols are going in the next year. Your mileage may vary.</p> <ul> <li><strong>A new generation of discovery.</strong> It will be simpler, less ambiguous, and more efficient than the current dance required in the current stack.</li>  <li><strong>Identifiers won&#39;t be URL&#39;s.</strong> One of the sacred light weight identity assumptions, was that the identifier is a URL. This is now fading into an idea that a tuple of domain and local-identifier constitues a global identifier.</li> <li><strong>The entire round trip will be over SSL (or TLS).</strong> This will move from a best practice, to a mandatory &quot;will-not-interop&quot; over non-ssl mindset.</li>  <li><strong>There will be two flavors of next generation OpenID.</strong> <ul> <li>     OpenID Connect based on OAuth2</li> <li>Artifact Binding for OpenID, preserving extensions and compatibility, while moving next generation payloads through all kinds of devices.</li>  </ul> </li> <li><strong>Portable contacts (PoCo) will be the profile container of choice for the web.</strong></li> <li><strong>Tokens will have structure.</strong> Token will move from their current opaqueness to more transparent JSON envelopes, with useful meta data.</li>  </ul> <p>Janrain wears many hats in community participation. It&#39;s important to help build out a healthy ecosystem, with high assurance of interoperability and alternative implementations. This requires working with identity providers, partners, competitors, and end-users. The largest hat we wear is that of a consumer advocate, to make sure their use cases are covered, their data is protected, and their deployment and user experience is smooth. To our customers, current and future, it&#39;s all good, we&#39;ve got you covered in the next wave of identity buildout.&nbsp;</p>",        "plainText" : "This is an exciting week for the OpenID and OAuth communities. The OpenID summit, sponsored by the OpenID Foundation and kindly hosted by Facebook, kicked things off on Monday, and will be followed by 3 days at the Internet Identity Workshop (IIW). The summit was a chance for many of the industry players to discuss openly the past, present, and future of authentication, discovery, security, user experience and profile data. Although, much discussion happens year round via mailing lists, it's always good to have face to face meetings to advance the conversation, especially for many of the contributors who are not based in the San Francisco Bay Area. While much of this conversation will continue at the IIW, the OpenID summit allowed for particular focus on consumer initiated authentication transactions, a particular sweet spot for Janrain. There was strong representation from Microsoft, Yahoo, Google, Facebook, PayPal, Salesforce, and Mozilla.  It's hard to pinpoint many absolute conclusions, out of the six hours of discussion. However, as an observer and a participant in this community for many years, it's clear there are several changes underway in the next wave of buildout. Many of these ideas have been around for a while. While they are bold, some how the consensus is that they are less controversial now, than they were several years ago. Here's a quick list of where I think the protocols are going in the next year. Your mileage may vary.  A new generation of discovery. It will be simpler, less ambiguous, and more efficient than the current dance required in the current stack.  Identifiers won't be URL's. One of the sacred light weight identity assumptions, was that the identifier is a URL. This is now fading into an idea that a tuple of domain and local-identifier constitues a global identifier. The entire round trip will be over SSL (or TLS). This will move from a best practice, to a mandatory %34will-not-interop%34 over non-ssl mindset.  There will be two flavors of next generation OpenID.       OpenID Connect based on OAuth2 Artifact Binding for OpenID, preserving extensions and compatibility, while moving next generation payloads through all kinds of devices.    Portable contacts (PoCo) will be the profile container of choice for the web. Tokens will have structure. Token will move from their current opaqueness to more transparent JSON envelopes, with useful meta data.   Janrain wears many hats in community participation. It's important to help build out a healthy ecosystem, with high assurance of interoperability and alternative implementations. This requires working with identity providers, partners, competitors, and end-users. The largest hat we wear is that of a consumer advocate, to make sure their use cases are covered, their data is protected, and their deployment and user experience is smooth. To our customers, current and future, it's all good, we've got you covered in the next wave of identity buildout. ",        "link" : "http://www.janrain.comblogs/week-identity",        "creator" : "Larry",        "date" : "Nov 3, 2010 4:51 PM",        "images" :        [          "/sites/default/files/identity-workshop.png"        ]      }    },    {      "story" :      {        "title" : "See Janrain Engage in Action!",        "description" : "<p>Ever wondered how companies such as <a href=&quot;http://exchange.kodak.com/&quot; target=&quot;_blank&quot;>Kodak</a>, <a href=&quot;http://www.citysearch.com/&quot; target=&quot;_blank&quot;>Citysearch</a>, <a href=&quot;http://www.latimes.com/&quot; target=&quot;_blank&quot;>The Los Angeles Times</a> and <a href=&quot;http://www.mahalo.com/&quot; target=&quot;_blank&quot;>Mahalo.com</a> are using <a href=&quot;/../../products/engage&quot;>Janrain Engage</a> to increase site registrations, generate referral traffic from the social networks, and invite friends?&nbsp; The best way to describe our solutions is to see it in action for yourself.</p>  <p>That&#39;s why we have put together a collection of short videos to walk you through some of the great features of Janrain Engage, including Social Registration and Login, Profile Pre-Population, Social Sharing and Invite your Friends.&nbsp;</p> <h3>  <strong>Inviting Friends and Leveraging Social Graphs - <a href=&quot;http://www.mahalo.com&quot; target=&quot;_blank&quot;>Mahalo.com</a>:</strong></h3>  <p>Mahalo.com connects new users with their friends on social networks that are already members, and lets users invite their contacts to join the site.</p> <p><iframe frameborder=&quot;0&quot; height=&quot;366&quot; src=&quot;http://player.vimeo.com/video/16325278?title=0&amp;byline=0&amp;portrait=0&quot; width=&quot;650&quot;></iframe></p>  <p> <span class=&quot;Apple-style-span&quot; style=&quot;color: rgb(7, 71, 100); line-height: 15px; font-size: 15px; &quot;><strong>Social Login - <a href=&quot;http://www.latimes.com&quot; target=&quot;_blank&quot;>The Los Angeles Times</a>:</strong></span></p>  <p>LA Times readers can login to the site and pre-populate their profile with information from their social network accounts.</p> <p><iframe frameborder=&quot;0&quot; height=&quot;406&quot; src=&quot;http://player.vimeo.com/video/15958589?title=0&amp;byline=0&amp;portrait=0&quot; width=&quot;650&quot;></iframe></p>  <p>  <span class=&quot;Apple-style-span&quot; style=&quot;color: rgb(7, 71, 100); line-height: 15px; font-size: 15px; &quot;><strong>Social Sharing - <a href=&quot;http://www.citysearch.com&quot; target=&quot;_blank&quot;>Citysearch</a>:</strong></span></p>  <p>Citysearch lets users share their ratings and reviews of local businesses to their friends via the Facebook news feed.</p> <p><iframe frameborder=&quot;0&quot; height=&quot;406&quot; src=&quot;http://player.vimeo.com/video/15791082?title=0&amp;byline=0&amp;portrait=0&quot; width=&quot;650&quot;></iframe></p>  <p>You can check out screencasts featuring additional Janrain customers such as&nbsp;<a href=&quot;http://www.interscope.com&quot; target=&quot;_blank&quot;>Interscope Geffen A&amp;M Records</a>, <a href=&quot;http://www.dallasnews.com&quot; target=&quot;_blank&quot;>Dallas News</a> and <a href=&quot;http://www.qype.com&quot; target=&quot;_blank&quot;>Qype</a> on our <a href=&quot;http://www.youtube.com/user/JanrainVideos&quot; target=&quot;_blank&quot;>videos page</a> and <a href=&quot;http://www.youtube.com/janrainvideos&quot; target=&quot;_blank&quot;>YouTube channel</a>.</p>",        "plainText" : "Ever wondered how companies such as Kodak, Citysearch, The Los Angeles Times and Mahalo.com are using Janrain Engage to increase site registrations, generate referral traffic from the social networks, and invite friends?  The best way to describe our solutions is to see it in action for yourself.  That's why we have put together a collection of short videos to walk you through some of the great features of Janrain Engage, including Social Registration and Login, Profile Pre-Population, Social Sharing and Invite your Friends.    Inviting Friends and Leveraging Social Graphs - Mahalo.com:  Mahalo.com connects new users with their friends on social networks that are already members, and lets users invite their contacts to join the site.    Social Login - The Los Angeles Times:  LA Times readers can login to the site and pre-populate their profile with information from their social network accounts.     Social Sharing - Citysearch:  Citysearch lets users share their ratings and reviews of local businesses to their friends via the Facebook news feed.   You can check out screencasts featuring additional Janrain customers such as Interscope Geffen A&amp;M Records, Dallas News and Qype on our videos page and YouTube channel.",        "link" : "http://www.janrain.comblogs/see-janrain-engage-action",        "creator" : "Michael Olson",        "date" : "Oct 29, 2010 10:00 AM"      }    },    {      "story" :      {        "title" : "Janrain Engage Now Supports PayPal for Social Login",        "description" : "<p>Live from the podium at the PayPal X Developer Conference, <a href=&quot;http://www.paypal-xinnovate.com/&quot; target=&quot;_blank&quot;>Innovate 2010</a>, we just announced the addition of <a href=&quot;http://www.paypal.com&quot; target=&quot;_blank&quot;>PayPal</a> as a supported provider for social login through Janrain Engage. Organizations using <a href=&quot;/products/engage&quot;>Janrain Engage</a> for social login now will be able to offer users the option to login to websites or native mobile applications with their existing PayPal credentials.&nbsp; There are over 80 million active PayPal users.</p>  <p>The <a href=&quot;/products/engage/mobile&quot;>Janrain Engage native iPhone SDK</a> and web-based widget are both configured to support social login with PayPal.</p> <p><img alt=%34PayPal social login with Janrain Engage for iPhone apps%34 src=%34/sites/default/files/iPhone%20UI%20PayPal.JPG%34 style=%34width: 173px; height: 320px; float: left;%34 /></p>  <p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;</p> <p>&nbsp;</p>  <p><img alt=%34PayPal social login with Janrain Engage%34 src=%34/sites/default/files/PayPal%20sign-in%20widget.JPG%34 style=%34width: 280px; height: 209px; float: left;%34 /></p> <p>&nbsp;</p>  <p>&nbsp;</p> <p>&nbsp;</p> <p>&nbsp;</p> <p>&nbsp;</p> <p>&nbsp;</p>  <p>&nbsp;</p> <p>&nbsp;</p> <p>  Adding PayPal to the web-based Janrain Engage widget or native iPhone SDK takes just a few minutes using the standard Janrain configuration tool to drag and drop the PayPal login button.&nbsp; Instructions provided on the pop-up window provide guidance on completing the setup process.&nbsp; Below is a screenshot of the Janrain Engage configuration tool with its easy drag and drop interface to configure providers.</p> <p><img alt=%34Configuring PayPal for social login with Janrain Engage%34 src=%34/sites/default/files/PayPal%20Widget%20Configuration.JPG%34 style=%34width: 280px; height: 223px;%34 /><br />   &nbsp;<br />  &quot;Adding the ability to login with PayPal credentials to the Janrain Engage interface will provide a huge benefit to the millions of PayPal users, and commerce sites who use PayPal for transactions,&quot; said Ashish Jain, Product Manager, PayPal. &quot;Configuring PayPal for login is a simple process with Janrain Engage, and we expect this will help businesses expand their online user engagement.&quot;</p> <p> Several <a href=&quot;http://www.janrain.com&quot;>Janrain</a> customers, including <a href=&quot;http://www.interscope.com&quot; target=&quot;_blank&quot;>Interscope Records</a> (a division of <a href=&quot;http://www.universalmusic.com&quot; target=&quot;_blank&quot;>Universal Music Group</a>), <a href=&quot;http://www.mahalo.com&quot; target=&quot;_blank&quot;>Mahalo</a> and <a href=&quot;http://tal.ki&quot; target=&quot;_blank&quot;>Tal.ki</a>, have already configured their Janrain Engage sign in screens to include PayPal.</p>  <p><img alt=%34PayPal on Interscope Records with Janrain Engage%34 src=%34/sites/default/files/Interscope%20PayPal.JPG%34 style=%34width: 280px; height: 237px;%34 /><br />  &nbsp;</p>  <p><a href=&quot;http://www.interscope.com&quot; target=&quot;_blank&quot;>Interscope Records</a> has added PayPal as a login provider across 125 artist websites.</p> <p><img alt=%34Mahalo.com accepts PayPal logins with Janrain Engage%34 src=%34/sites/default/files/Mahalo%20PayPal.JPG%34 style=%34width: 280px; height: 318px;%34 /></p>  <p><img alt=%34PayPal login with Janrain Engage%34 src=%34/sites/default/files/paypal-login.JPG%34 style=%34width: 280px; height: 150px;%34 /></p> <p> Popular website <a href=&quot;http://www.mahalo.com&quot; target=&quot;_blank&quot;>Mahalo</a>, a human powered search engine, is accepting PayPal logins through Janrain Engage.</p>  <p><img alt=%34Tal.ki accepts PayPal logins with Janrain Engage%34 src=%34/sites/default/files/talki%20paypal.JPG%34 style=%34width: 280px; height: 146px;%34 /></p> <p>  &nbsp;<br />   <a href=&quot;http://tal.ki&quot; target=&quot;_blank&quot;>Tal.ki</a>, a service for easily embedding forums into a website, is accepting PayPal logins through Janrain Engage.</p> <p>You can read more about the <a href=&quot;http://www.readwriteweb.com/archives/you_can_now_use_your_paypal_id_for_social_logins.php&quot; target=&quot;_blank&quot;>availability of PayPal for social login with Janrain Engage on ReadWriteWeb</a>.</p>  <p>To add PayPal to your Janrain Engage application, visit your dashboard. If you want to get started with Janrain Engage, <a href=&quot;/products/engage/get-janrain-engage&quot;>pick the plan that is right for you here</a>.</p>",        "plainText" : "Live from the podium at the PayPal X Developer Conference, Innovate 2010, we just announced the addition of PayPal as a supported provider for social login through Janrain Engage. Organizations using Janrain Engage for social login now will be able to offer users the option to login to websites or native mobile applications with their existing PayPal credentials.  There are over 80 million active PayPal users.  The Janrain Engage native iPhone SDK and web-based widget are both configured to support social login with PayPal.                                                 Adding PayPal to the web-based Janrain Engage widget or native iPhone SDK takes just a few minutes using the standard Janrain configuration tool to drag and drop the PayPal login button.  Instructions provided on the pop-up window provide guidance on completing the setup process.  Below is a screenshot of the Janrain Engage configuration tool with its easy drag and drop interface to configure providers.       %34Adding the ability to login with PayPal credentials to the Janrain Engage interface will provide a huge benefit to the millions of PayPal users, and commerce sites who use PayPal for transactions,%34 said Ashish Jain, Product Manager, PayPal. %34Configuring PayPal for login is a simple process with Janrain Engage, and we expect this will help businesses expand their online user engagement.%34  Several Janrain customers, including Interscope Records (a division of Universal Music Group), Mahalo and Tal.ki, have already configured their Janrain Engage sign in screens to include PayPal.       Interscope Records has added PayPal as a login provider across 125 artist websites.     Popular website Mahalo, a human powered search engine, is accepting PayPal logins through Janrain Engage.         Tal.ki, a service for easily embedding forums into a website, is accepting PayPal logins through Janrain Engage. You can read more about the availability of PayPal for social login with Janrain Engage on ReadWriteWeb.  To add PayPal to your Janrain Engage application, visit your dashboard. If you want to get started with Janrain Engage, pick the plan that is right for you here.",        "link" : "http://www.janrain.comblogs/janrain-engage-now-supports-paypal-social-login",        "creator" : "Vidya Shivkumar",        "date" : "Oct 27, 2010 10:00 AM",        "images" :        [          "/sites/default/files/iPhone%20UI%20PayPal.JPG",          "/sites/default/files/PayPal%20sign-in%20widget.JPG",          "/sites/default/files/PayPal%20Widget%20Configuration.JPG",          "/sites/default/files/Interscope%20PayPal.JPG",          "/sites/default/files/Mahalo%20PayPal.JPG",          "/sites/default/files/paypal-login.JPG",          "/sites/default/files/talki%20paypal.JPG"        ]      }    },    {      "story" :      {        "title" : "Calling all Portland iPhone Developers, We Need Your Help",        "description" : "<p><img alt=%34%34 src=%34/sites/default/files/iphone-hackfest.png%34 style=%34padding-top: 0px; padding-right: 0px; padding-bottom: 20px; padding-left: 20px; float: right; width: 280px;%34 />Janrain has recently released the second version (beta) of our iPhone library, <a href=&quot;/products/engage/mobile&quot;>Janrain Engage for iPhone</a>, which includes a greatly simplified user authentication component, as well as an extremely simple social sharing interface.</p>  <p>To better test our library, we are hosting a Hackfest at our downtown office on <strong>Wednesday, October 27th from 6-9 PM</strong>. If you are interested in adding our library to your iPhone application, please come, and please bring your laptop. We will walk you through configuring your application with <a href=&quot;/products/engage&quot;>Janrain Engage</a> and our <a href=&quot;/solutions/supported-networks&quot;>17+ providers</a> (Facebook, Twitter, etc.), adding the library to your application, and the simple API calls. We will also provide pizza and beer, and we hope that you can provide meaningful feedback.</p>  <p>In this version, we have streamlined authentication and added very easy-to-use social sharing. By using this library in your iPhone application, you can quickly authenticate your users on a number of existing providers (such as Google, Facebook, Yahoo!, etc.) and allow them to post status updates on Facebook, Twitter, MySpace, LinkedIn, and Yahoo! all through one screen, by configuring only one API call. This can be done in as little as two lines of code!</p> <p>Again, we are really interested in getting your feedback, and we hope that you can come. If you are interested in attending, please RSVP to <a href=&quot;mailto:iphone-dev@janrain.com&quot;>iphone-dev@janrain.com</a> no later than Monday, October 25th. We will be limiting the number of space to about 20 developers.&nbsp;</p>",        "plainText" : "Janrain has recently released the second version (beta) of our iPhone library, Janrain Engage for iPhone, which includes a greatly simplified user authentication component, as well as an extremely simple social sharing interface.  To better test our library, we are hosting a Hackfest at our downtown office on Wednesday, October 27th from 6-9 PM. If you are interested in adding our library to your iPhone application, please come, and please bring your laptop. We will walk you through configuring your application with Janrain Engage and our 17+ providers (Facebook, Twitter, etc.), adding the library to your application, and the simple API calls. We will also provide pizza and beer, and we hope that you can provide meaningful feedback.  In this version, we have streamlined authentication and added very easy-to-use social sharing. By using this library in your iPhone application, you can quickly authenticate your users on a number of existing providers (such as Google, Facebook, Yahoo!, etc.) and allow them to post status updates on Facebook, Twitter, MySpace, LinkedIn, and Yahoo! all through one screen, by configuring only one API call. This can be done in as little as two lines of code! Again, we are really interested in getting your feedback, and we hope that you can come. If you are interested in attending, please RSVP to iphone-dev@janrain.com no later than Monday, October 25th. We will be limiting the number of space to about 20 developers. ",        "link" : "http://www.janrain.comblogs/calling-all-portland-iphone-developers-we-need-your-help",        "creator" : "Katie Keenan",        "date" : "Oct 25, 2010 10:10 AM",        "images" :        [          "/sites/default/files/iphone-hackfest.png"        ]      }    },    {      "story" :      {        "title" : "Still not sure how Janrain can help? Check out our new Resources Section",        "description" : "<p><img alt=%34Janrain Resources%34 src=%34/sites/default/files/resources.png%34 style=%34padding-top: 0px; padding-right: 0px; padding-bottom: 20px; padding-left: 20px; float: right; width: 256px; %34 />Need more proof that social login and sharing works? At Janrain, it&#39;s our mission to help you increase registration rates, create more personalized and profitable relationships with your users, and as a result, improve the ROI of your online properties. To help you better understand the value our solutions can add to your company, we&#39;ve created a&nbsp;<a href=&quot;/resources&quot; style=&quot;color: rgb(0, 157, 220); text-decoration: none; &quot;>library of free resources</a> for both <a href=&quot;/resources/for-marketers&quot; style=&quot;color: rgb(0, 157, 220); text-decoration: none; &quot;>marketers</a>&nbsp;and&nbsp;<a href=&quot;/resources/for-developers&quot; style=&quot;color: rgb(0, 157, 220); text-decoration: none; &quot;>developers</a>&nbsp;alike ranging from whitepapers to webinars to API documentation and more.</p>  <p>We will continually be adding new information to this site, so please check back often. If you don&#39;t find what you are looking for, we encourage you to <a href=&quot;/learn-more&quot;>contact us</a>. Our team is always excited to dive in to learn more about your business and suggest ways that we can socialize your site and help take your organization to the next level.</p> <p>Here is a list of what you will find in our <a href=&quot;/resources&quot;>Resources Section</a>:</p>  <p><strong>For Marketers</strong></p> <ul> <li><a href=&quot;/resources/for-marketers/videos-podcasts&quot;>Videos &amp; Podcasts</a>: Find product demos, example screencasts and interviews.</li>  <li><a href=&quot;/resources/for-marketers/success-stories&quot;>Success Stories</a>: Read about how organizations have benefited from Janrain&#39;s solutions.</li> <li><a href=&quot;/resources/for-marketers/marketing-briefs&quot;>Marketing Briefs</a>: Best practices and recommended strategies for your site.</li>  <li><a href=&quot;/resources/for-marketers/datasheets&quot;>Datasheets</a>: Full list of benefits and product specs for each Janrain product.</li> <li><a href=&quot;/resources/for-marketers/events-webinars&quot;>Events &amp; Webinars</a>: Register for upcoming webinars and view a list of events.</li>  <li><a href=&quot;/resources/for-marketers/newsletter&quot;>Newsletter</a>: Sign up to receive regular news on product updates and Janrain happenings.</li> </ul> <p><strong>For Developers</strong></p> <ul>  <li><a href=&quot;/resources/for-developers/technical-videos&quot;>Technical Videos</a>: Learn more about the flow and technical details of our products.</li> <li><a href=&quot;http://groups.google.com/group/rpx-developers?pli=1&quot; target=&quot;_blank&quot;>Developers Forum</a>: A forum for product announcements and support from the community.</li>  <li><a href=&quot;https://rpxnow.com/docs&quot; target=&quot;_blank&quot;>Janrain Engage Documentation</a>: Integration and API information.</li> <li><a href=&quot;/resources/for-developers/plugins-connectors&quot;>Plugins &amp; Connectors</a>: Complete list of supported plugins.</li>  <li><a href=&quot;http://feedback.janrain.com/forums/62331-janrain-engage-formerly-rpx-&quot;>Product Feedback &amp; Feature Requests</a>: Let us know what you&#39;d like us to work on.</li> <li><a href=&quot;https://rpxnow.com/docs/providers&quot; target=&quot;_blank&quot;>Profile Data By Social Network</a>: Complete list of profile data that Janrain is able to collect.</li>  <li><a href=&quot;https://support.janrain.com/home&quot; target=&quot;_blank&quot;>Technical Support</a>: Have a specific question? Ask our community board or submit a ticket (Pro/Plus accounts only).</li> </ul>",        "plainText" : "Need more proof that social login and sharing works? At Janrain, it's our mission to help you increase registration rates, create more personalized and profitable relationships with your users, and as a result, improve the ROI of your online properties. To help you better understand the value our solutions can add to your company, we've created a library of free resources for both marketers and developers alike ranging from whitepapers to webinars to API documentation and more.  We will continually be adding new information to this site, so please check back often. If you don't find what you are looking for, we encourage you to contact us. Our team is always excited to dive in to learn more about your business and suggest ways that we can socialize your site and help take your organization to the next level. Here is a list of what you will find in our Resources Section:  For Marketers  Videos &amp; Podcasts: Find product demos, example screencasts and interviews.  Success Stories: Read about how organizations have benefited from Janrain's solutions. Marketing Briefs: Best practices and recommended strategies for your site.  Datasheets: Full list of benefits and product specs for each Janrain product. Events &amp; Webinars: Register for upcoming webinars and view a list of events.  Newsletter: Sign up to receive regular news on product updates and Janrain happenings.  For Developers   Technical Videos: Learn more about the flow and technical details of our products. Developers Forum: A forum for product announcements and support from the community.  Janrain Engage Documentation: Integration and API information. Plugins &amp; Connectors: Complete list of supported plugins.  Product Feedback &amp; Feature Requests: Let us know what you'd like us to work on. Profile Data By Social Network: Complete list of profile data that Janrain is able to collect.  Technical Support: Have a specific question? Ask our community board or submit a ticket (Pro/Plus accounts only). ",        "link" : "http://www.janrain.comblogs/still-not-sure-how-janrain-can-help-take-glance-our-new-resources-section",        "creator" : "Katie Keenan",        "date" : "Oct 21, 2010 6:15 PM",        "images" :        [          "/sites/default/files/resources.png"        ]      }    },    {      "story" :      {        "title" : "UK Government Entity Increases Registrations and Engagement with Janrain Engage",        "description" : "<p>The public sector is an emerging market for social login, with <a href=&quot;/blogs/us-federal-government-adopting-openid&quot;>Government agencies recognizing</a> that improved transparency and increased citizen engagement can be accomplished by allowing online users to login to their websites with an existing social identity. &nbsp;</p> <p><a href=&quot;http://www.fylde.gov.uk/&quot; target=&quot;_blank&quot;>Fylde Borough Council</a> is a Government district in the United Kingdom that provides a range of services for its citizens, including housing, parks, leisure, city beautification and environmental health.&nbsp; Fylde&rsquo;s website provides information on local services and a community to stimulate engagement with local residents.</p>  <p><strong>The Challenge</strong></p> <p>Fylde&rsquo;s key online objective was to increase engagement with community members and facilitate greater participation.&nbsp; Fylde conducted several focus groups that revealed how users behaved on its site, and it became clear to the Council that requiring users to create a site-specific username and password posed a challenge to growing membership and providing a personalized user experience.&nbsp; &ldquo;One of the things that always comes up is that people are sick of creating more user IDs for different websites,&rdquo; said Andrew Cain, Fylde Borough Council&rsquo;s Transformational Services Manager.&nbsp; &ldquo;That led us to seek a more open login process and find ways to encourage more people to login.&rdquo; &nbsp;</p>  <p>Fylde recognized that its online customer service tool (<a href=&quot;http://www.getsatisfaction.com&quot; target=&quot;_blank&quot;>Get Satisfaction</a>, a <a href=&quot;/partners/technology-partners&quot;>Janrain partner</a>) made it easy for visitors to sign-in and share feedback with an existing account from Facebook, Google or Twitter, and determined that it could accomplish its online goals by extending such functionality to its own website.</p>  <p><strong>The Results</strong></p> <p>Fylde launched Janrain Engage in mid-September and has experienced a <strong>100% increase in registration rates</strong> compared to when only offering a legacy username/password system.&nbsp; Fylde serves personalized content to registered users based on their location.&nbsp; This has helped <strong>return visits and logins increase from 1.6 logins per user to 3.3 logins/user since implementing Janrain Engage</strong>, resulting in improved long-term engagement with Fylde residents.</p>  <p><img alt=%34Fylde Borough Council increases registration rates 100% with Janrain Engage%34 src=%34/sites/default/files/fylde-borough-council-login.JPG%34 style=%34width: 280px; height: 147px;%34 /></p> <p>  Signups for email newsletters and alerts have increased substantially, helping Fylde keep users informed of local news and more effectively solicit feedback on Council policies.&nbsp; <strong>Previously, only 24% of users chose to sign up for email alerts, but that percentage has increased to 87%</strong> since launching Janrain Engage.&nbsp; Andrew Cain attributed this to the fact that users can easily share their email address from Google, Yahoo!, Facebook or other social networks when registering with the site, reducing the hassle associated with newsletter sign-ups.</p>  <p>Forgotten password inquiries have also decreased dramatically by eliminating the need for users to create or maintain a Fylde password to access the site.</p> <p>Speed of deployment was a key factor in Fylde&rsquo;s decision to use Janrain Engage.&nbsp; &ldquo;From a development point of view, it&rsquo;s been incredibly easy to setup,&rdquo; Andrew Cain said.&nbsp; &ldquo;The documentation was perfect and the setup was pain free.&nbsp; We were able to set up a test deployment in about a day.&rdquo;</p>  <p>Longer term, Fylde plans to evaluate launching social sharing features, which would enable members to share local events with their friends on the social networks, driving increased traffic back to the Fylde website.<br />  &nbsp;</p>",        "plainText" : "The public sector is an emerging market for social login, with Government agencies recognizing that improved transparency and increased citizen engagement can be accomplished by allowing online users to login to their websites with an existing social identity.   Fylde Borough Council is a Government district in the United Kingdom that provides a range of services for its citizens, including housing, parks, leisure, city beautification and environmental health.  Fylde's website provides information on local services and a community to stimulate engagement with local residents.  The Challenge Fylde's key online objective was to increase engagement with community members and facilitate greater participation.  Fylde conducted several focus groups that revealed how users behaved on its site, and it became clear to the Council that requiring users to create a site-specific username and password posed a challenge to growing membership and providing a personalized user experience.  %34One of the things that always comes up is that people are sick of creating more user IDs for different websites,%34 said Andrew Cain, Fylde Borough Council's Transformational Services Manager.  %34That led us to seek a more open login process and find ways to encourage more people to login.%34    Fylde recognized that its online customer service tool (Get Satisfaction, a Janrain partner) made it easy for visitors to sign-in and share feedback with an existing account from Facebook, Google or Twitter, and determined that it could accomplish its online goals by extending such functionality to its own website.  The Results Fylde launched Janrain Engage in mid-September and has experienced a 100% increase in registration rates compared to when only offering a legacy username/password system.  Fylde serves personalized content to registered users based on their location.  This has helped return visits and logins increase from 1.6 logins per user to 3.3 logins/user since implementing Janrain Engage, resulting in improved long-term engagement with Fylde residents.     Signups for email newsletters and alerts have increased substantially, helping Fylde keep users informed of local news and more effectively solicit feedback on Council policies.  Previously, only 24% of users chose to sign up for email alerts, but that percentage has increased to 87% since launching Janrain Engage.  Andrew Cain attributed this to the fact that users can easily share their email address from Google, Yahoo!, Facebook or other social networks when registering with the site, reducing the hassle associated with newsletter sign-ups.  Forgotten password inquiries have also decreased dramatically by eliminating the need for users to create or maintain a Fylde password to access the site. Speed of deployment was a key factor in Fylde's decision to use Janrain Engage.  %34From a development point of view, it's been incredibly easy to setup,%34 Andrew Cain said.  %34The documentation was perfect and the setup was pain free.  We were able to set up a test deployment in about a day.%34  Longer term, Fylde plans to evaluate launching social sharing features, which would enable members to share local events with their friends on the social networks, driving increased traffic back to the Fylde website.   ",        "link" : "http://www.janrain.comblogs/uk-government-entity-increases-registrations-and-engagement-janrain-engage",        "creator" : "Michael Olson",        "date" : "Oct 18, 2010 6:28 PM",        "images" :        [          "/sites/default/files/fylde-borough-council-login.JPG"        ]      }    },    {      "story" :      {        "title" : "Janrain at DEMOgala 2010 - Technologies to Increase Customer Engagement",        "description" : "<p><img alt=%34Janrain presented at DEMOgala 2010%34 src=%34/sites/default/files/demogala-logo_0.jpg%34 style=%34padding: 0pt 0pt 20px 20px; width: 180px; height: 54px; float: right;%34 /></p>  <p>Last week, Janrain spoke at <a href=&quot;http://www.demogala.com/&quot; target=&quot;_blank&quot;>DEMOgala 2010</a>, a conference in Denver, Colorado that featured discussions about mobile applications, software development, web commerce, social media and other technology trends.</p> <p>We presented about social technologies that increase customer engagement and help online businesses build more profitable relationships with their users, and thought we&#39;d share the slides from our presentation:</p>  <div style=&quot;width:425px&quot; id=&quot;__ss_5508577&quot;><strong style=&quot;display:block;margin:12px 0 4px&quot;><a href=&quot;http://www.slideshare.net/Janrain/technologies-to-increase-online-engagement&quot; title=&quot;Technologies to Increase Online Engagement&quot;>Technologies to Increase Online Engagement</a></strong> <object id=&quot;__sse5508577&quot; width=&quot;425&quot; height=&quot;355&quot;><param name=&quot;movie&quot; value=&quot;http://static.slidesharecdn.com/swf/ssplayer2.swf?doc=demogala2010janrainpresentation-101011162429-phpapp02-101020174651-phpapp01&stripped_title=technologies-to-increase-online-engagement&userName=Janrain&quot; /><param name=&quot;allowFullScreen&quot; value=&quot;true&quot; /><param name=&quot;allowScriptAccess&quot; value=&quot;always&quot; /><embed name=&quot;__sse5508577&quot; src=&quot;http://static.slidesharecdn.com/swf/ssplayer2.swf?doc=demogala2010janrainpresentation-101011162429-phpapp02-101020174651-phpapp01&stripped_title=technologies-to-increase-online-engagement&userName=Janrain&quot; type=&quot;application/x-shockwave-flash&quot; allowscriptaccess=&quot;always&quot; allowfullscreen=&quot;true&quot; width=&quot;425&quot; height=&quot;355&quot;></embed></object><div style=&quot;padding:5px 0 12px&quot;>View more <a href=&quot;http://www.slideshare.net/&quot;>presentations</a> from <a href=&quot;http://www.slideshare.net/Janrain&quot;>Janrain</a>.</div>  </div> <p>In today&#39;s online ecosystem, there is a growing expectation for websites to have a social component and enable features like content or activity sharing and inviting friends.&nbsp; But registration can be an engagement barrier for many online users who are tired of maintaining separate usernames and passwords at each website they visit.</p> <p>Social login and sharing technology, through tools such as <a href=&quot;/products/engage&quot;>Janrain Engage</a>, solves this challenge by making it easy for site visitors to quickly register or login with an existing social network account and share their activities (such as comments, purchases or reviews) from a site with friends on multiple social networks.</p>  <p>We enjoyed the discussions about these and other technology trends at DEMOgala.</p>",        "plainText" : "  Last week, Janrain spoke at DEMOgala 2010, a conference in Denver, Colorado that featured discussions about mobile applications, software development, web commerce, social media and other technology trends. We presented about social technologies that increase customer engagement and help online businesses build more profitable relationships with their users, and thought we'd share the slides from our presentation:  Technologies to Increase Online Engagement View more presentations from Janrain.   In today's online ecosystem, there is a growing expectation for websites to have a social component and enable features like content or activity sharing and inviting friends.  But registration can be an engagement barrier for many online users who are tired of maintaining separate usernames and passwords at each website they visit. Social login and sharing technology, through tools such as Janrain Engage, solves this challenge by making it easy for site visitors to quickly register or login with an existing social network account and share their activities (such as comments, purchases or reviews) from a site with friends on multiple social networks.  We enjoyed the discussions about these and other technology trends at DEMOgala.",        "link" : "http://www.janrain.comblogs/janrain-demogala-2010-technologies-increase-customer-engagement",        "creator" : "Michael Olson",        "date" : "Oct 14, 2010 11:42 AM",        "images" :        [          "/sites/default/files/demogala-logo_0.jpg"        ]      }    },    {      "story" :      {        "title" : "Majority of Consumers Research Products Online Before Purchase",        "description" : "<p>According to a recent <a href=&quot;http://pewinternet.org/Reports/2010/Online-Product-Research.aspx&quot; target=&quot;_blank&quot;>study conducted by Pew Research Center</a>, 58% of all American adults now perform online research on the products and services they consider purchasing, representing an increase from 49% in 2004.&nbsp; Nearly half of those adults (and 24% of all Americans) have posted comments or reviews online about the products they buy.</p> <p>Just among internet users, 78% of Americans conduct product research online before purchasing, and 32% post product reviews or comments online about their purchases.</p>  <p>This coincides with the rise in popularity of social networks &ndash; nearly half (46%) of all Americans now use social networks, up from 5% in 2005. &nbsp;</p> <p>We all know that consumers rely on peer opinions to help drive purchase decisions &ndash; this is not a new phenomenon.&nbsp; However, with half of all Americans using social networks to share information with friends and colleagues, retailers have struggled to find a way to kindle brand conversations among consumers across these new media.</p> <p>The fusion of trends highlighted in the Pew study reinforces the mandate for retailers to make interactivity and sharing of product information and reviews as simple as possible.&nbsp; For example, retailers using <a href=&quot;/products/engage&quot;>Janrain Engage</a> can enable consumers to easily share product reviews with friends on social networks such as Facebook and Twitter.</p>  <p><img alt=%34Janrain Engage Social Sharing Retail Website%34 src=%34/sites/default/files/social-sharing-review-retail.JPG%34 style=%34width: 280px; height: 278px;%34 /><br />  &nbsp;</p>  <p>By leveraging <a href=&quot;/products/engage&quot;>Janrain Engage</a> for social sharing, retailers can translate user-generated product reviews from their corporate website into peer-to-peer interactions on social network feeds.&nbsp; This improves brand awareness, drives qualified referral traffic back to the corporate site, and informs future purchase decisions.</p> <p>Another interesting tidbit:&nbsp; The Pew study found no significant differences among age groups in the likelihood of posting online product reviews.&nbsp; This is further evidence that, no matter the age demographics of your company&rsquo;s target market, there is value in adding community features and enabling user-generated content through product reviews, ratings or comments.</p>",        "plainText" : "According to a recent study conducted by Pew Research Center, 58% of all American adults now perform online research on the products and services they consider purchasing, representing an increase from 49% in 2004.  Nearly half of those adults (and 24% of all Americans) have posted comments or reviews online about the products they buy. Just among internet users, 78% of Americans conduct product research online before purchasing, and 32% post product reviews or comments online about their purchases.  This coincides with the rise in popularity of social networks - nearly half (46%) of all Americans now use social networks, up from 5% in 2005.   We all know that consumers rely on peer opinions to help drive purchase decisions - this is not a new phenomenon.  However, with half of all Americans using social networks to share information with friends and colleagues, retailers have struggled to find a way to kindle brand conversations among consumers across these new media. The fusion of trends highlighted in the Pew study reinforces the mandate for retailers to make interactivity and sharing of product information and reviews as simple as possible.  For example, retailers using Janrain Engage can enable consumers to easily share product reviews with friends on social networks such as Facebook and Twitter.       By leveraging Janrain Engage for social sharing, retailers can translate user-generated product reviews from their corporate website into peer-to-peer interactions on social network feeds.  This improves brand awareness, drives qualified referral traffic back to the corporate site, and informs future purchase decisions. Another interesting tidbit:  The Pew study found no significant differences among age groups in the likelihood of posting online product reviews.  This is further evidence that, no matter the age demographics of your company's target market, there is value in adding community features and enabling user-generated content through product reviews, ratings or comments.",        "link" : "http://www.janrain.comblogs/majority-consumers-research-products-online-purchase",        "creator" : "Michael Olson",        "date" : "Oct 11, 2010 6:41 PM",        "images" :        [          "/sites/default/files/social-sharing-review-retail.JPG"        ]      }    },    {      "story" :      {        "title" : "Janrain Engage Makes it Easy for iPhone Users to Share to Social Networks",        "description" : "<p>In a recent <a href=&quot;http://www.appcelerator.com/mobile-developer-report-September-2010/&quot; target=&quot;_blank&quot;>survey</a> of over 1900 smart phone developers published by <a href=&quot;http://www.appcelerator.com/&quot; target=&quot;_blank&quot;>Appcelerator</a> and <a href=&quot;http://www.idc.com/&quot; target=&quot;_blank&quot;>IDC</a>, 65% of those surveyed cited the need for social networking APIs on mobile platforms. <a href=&quot;http://www.janrain.com&quot;>Janrain</a>, the user management platform for the social web, is happy to extend its support for the iPhone platform to meet this need and offer a native iPhone SDK for sharing content and activity on your apps to Facebook, Twitter, LinkedIn, Yahoo!, MySpace and other social networks.</p>  <p> In April, we launched <a href=&quot;/blogs/janrain-rpx-iphone&quot;>native iPhone support for social login</a> and today, we have extended <a href=&quot;/products/engage/mobile&quot;>Janrain Engage for iPhone</a> to enable a user to share directly from an iPhone app to multiple social networks simultaneously. Imagine you&rsquo;ve just hit your highest score on your favorite iPhone game. Now with an easy click you can share your good news with friends on Facebook, Twitter, and other online communities.</p>  <p> To see how an application can take advantage of the SDK, download our demo app, <a href=&quot;http://itunes.apple.com/us/app/quick-publish/id389229631?mt=8&quot;>Janrain Quick Publish</a>, from Apple&rsquo;s App Store.</p> <p> With this release, Janrain extends all capabilities available in the web-based version of <a href=&quot;/products/engage&quot;>Janrain Engage</a> to the iPhone platform. Core benefits of Janrain Engage for iPhone include:</p>  <ul> <li><strong>Simplicity</strong>: The iPhone SDK comes with a pre-built native UI kit that developers can customize via the Janrain Engage Application dashboard. A quick start guide walks developers through the process of implementing the library.</li> <li><strong>Security</strong>: Janrain&#39;s native SDK for mobile utilizes robust and secure APIs that are simple, effective and remove the need to create complicated security systems to mask API keys on mobile devices.</li>  <li><strong>Elegance</strong>: iPhone app users enjoy a native iPhone experience when signing-up or sharing with their social networks. Similar to the web-based version, the mobile version remembers the user&#39;s preferred provider on return visits, to help ensure a positive and intuitive return user experience.</li> </ul> <p><a href=&quot;/products/engage/mobile&quot;>Janrain Engage for iPhone</a> offers solutions for both pure-play iPhone app developers and websites with a mobile app presence. Developers can choose between a lightweight client-side implementation or a server-side integration that enables additional features such as access to a user&rsquo;s friends and contacts, and mapping of multiple social network identities to a single user. Other standard features of Janrain Engage such as URL shortening, analytics and tracking of referral clicks are also available to iPhone Apps. &nbsp;</p>  <p> Screenshots below show the end user experience optimized for the iPhone screen:</p> <p><img alt=%34social sharing with Janrain Engage for iPhone%34 src=%34/sites/default/files/iphone-social-share.JPG%34 style=%34width: 280px; height: 185px;%34 /><br />   The same Appcelerator and IDC survey noted that 4 out of 5 app developers preferred mobile apps over the mobile web, despite coming from a web development background. It is no surprise that the preference reflects the market need. Smartphone consumers prefer a native mobile experience as evidenced by <a href=&quot;http://www.apple.com/pr/library/2010/01/05appstore.html&quot;>over 3 billion app downloads</a> from the App Store by iPhone&reg; alone. Janrain has lowered the barrier to implementing social logins and sharing for your iPhone Apps.</p> <p> To download and use the SDK in your iPhone App, please visit your <a href=&quot;http://www.rpxnow.com&quot;>Janrain Engage product dashboard</a> and click &ldquo;Sign up now&quot; next to the iPhone badge. You will be guided through the download and implementation process. We hope you will enjoy implementing our SDK and welcome all feedback.</p>",        "plainText" : "In a recent survey of over 1900 smart phone developers published by Appcelerator and IDC, 65% of those surveyed cited the need for social networking APIs on mobile platforms. Janrain, the user management platform for the social web, is happy to extend its support for the iPhone platform to meet this need and offer a native iPhone SDK for sharing content and activity on your apps to Facebook, Twitter, LinkedIn, Yahoo!, MySpace and other social networks.   In April, we launched native iPhone support for social login and today, we have extended Janrain Engage for iPhone to enable a user to share directly from an iPhone app to multiple social networks simultaneously. Imagine you've just hit your highest score on your favorite iPhone game. Now with an easy click you can share your good news with friends on Facebook, Twitter, and other online communities.   To see how an application can take advantage of the SDK, download our demo app, Janrain Quick Publish, from Apple's App Store.  With this release, Janrain extends all capabilities available in the web-based version of Janrain Engage to the iPhone platform. Core benefits of Janrain Engage for iPhone include:   Simplicity: The iPhone SDK comes with a pre-built native UI kit that developers can customize via the Janrain Engage Application dashboard. A quick start guide walks developers through the process of implementing the library. Security: Janrain's native SDK for mobile utilizes robust and secure APIs that are simple, effective and remove the need to create complicated security systems to mask API keys on mobile devices.  Elegance: iPhone app users enjoy a native iPhone experience when signing-up or sharing with their social networks. Similar to the web-based version, the mobile version remembers the user's preferred provider on return visits, to help ensure a positive and intuitive return user experience.  Janrain Engage for iPhone offers solutions for both pure-play iPhone app developers and websites with a mobile app presence. Developers can choose between a lightweight client-side implementation or a server-side integration that enables additional features such as access to a user's friends and contacts, and mapping of multiple social network identities to a single user. Other standard features of Janrain Engage such as URL shortening, analytics and tracking of referral clicks are also available to iPhone Apps.     Screenshots below show the end user experience optimized for the iPhone screen:    The same Appcelerator and IDC survey noted that 4 out of 5 app developers preferred mobile apps over the mobile web, despite coming from a web development background. It is no surprise that the preference reflects the market need. Smartphone consumers prefer a native mobile experience as evidenced by over 3 billion app downloads from the App Store by iPhone&reg; alone. Janrain has lowered the barrier to implementing social logins and sharing for your iPhone Apps.  To download and use the SDK in your iPhone App, please visit your Janrain Engage product dashboard and click %34Sign up now%34 next to the iPhone badge. You will be guided through the download and implementation process. We hope you will enjoy implementing our SDK and welcome all feedback.",        "link" : "http://www.janrain.comblogs/janrain-engage-makes-it-easy-iphone-users-share-social-networks",        "creator" : "Vidya Shivkumar",        "date" : "Oct 7, 2010 4:30 PM",        "images" :        [          "/sites/default/files/iphone-social-share.JPG"        ]      }    },    {      "story" :      {        "title" : "Janrain Integrates with Leading Commenting Platforms: Disqus, Echo and Pluck",        "description" : "<p><img alt=%34comment bubble%34 src=%34/../../sites/default/files/demikl_d_rounded_speech_bubble_clip_art_31739.jpg%34 style=%34padding: 0pt 0pt 20px 20px; width: 180px; height: 187px; float: right;%34 />Many of us recall the famous New Yorker cartoon from the 1990s that read &ldquo;<a href=&quot;http://en.wikipedia.org/wiki/On_the_Internet,_nobody_knows_you&#39;re_a_dog&quot; target=&quot;_blank&quot;>On the Internet, Nobody Knows You&#39;re a Dog</a>.&rdquo; Fast-forward a decade and a half. Social media has given rise to new and different <a href=&quot;http://www.briansolis.com/2010/03/behaviorgraphics-humanize-the-social-web/&quot; target=&quot;_blank&quot;>online behaviors</a>. More consumers are creating, curating and critiquing online content than ever before, and now, penning their comments under a real identity.</p>  <p> Eager to take advantage of this behavior and the <a href=&quot;/blogs/news-sites-moving-away-anonymous-online-comments&quot;>diminishing need for online anonymity</a>, websites ranging from online guides to news media and entertainment sites to retail websites are enabling their readers to build social communities around content and discussions.</p> <p> Today, Janrain is happy to announce deep technical integrations with the three leading commenting platforms: <a href=&quot;http://www.disqus.com&quot; target=&quot;_blank&quot;>Disqus</a>, <a href=&quot;http://www.aboutecho.com&quot; target=&quot;_blank&quot;>Echo</a> and <a href=&quot;http://www.pluck.com&quot; target=&quot;_blank&quot;>Pluck</a>, to make it easy to link a user&rsquo;s existing online identity on your website with his or her commenting persona.</p>  <ul> <li><strong>DISQUS </strong>builds and connects communities via a large and rapidly growing network that spans over 200 million users each month, and provides publishers with advanced commenter interface and moderation tools. <p>  <em>&ldquo;DISQUS is proud to work with another industry leader, Janrain, in making social connectivity a more comprehensive and integrated experience for publishers everywhere&rdquo; stated Ro Gupta, vice president of business development for DISQUS.</em></p></li> </ul>  <ul> <li><strong>Echo </strong>allows publishers to turn their static sites into real-time news platforms with Real-time Comments, Real-time Recent Comments and Real-time News Rivers. <p>  <em>&quot;At Echo, our focus is partnering with the leading web properties in the world to bring state of the art real-time social features to their audience. Our goal is to be an invisible toolset that empowers publishers to innovate by integrating seamlessly with their identity and registration systems. Our partnership with Janrain is just another way we ensure that Echo is supportive of our publisher&#39;s business goals and existing technologies&rdquo; stated Chris Saad, vice president of product strategy &amp; community for Echo.</em></p></li>  </ul> <ul> <li><strong>Pluck Comments </strong>is an element of the larger Pluck Social Application Server, a platform that drives community for publishers like USA Today and brands like the NFL. Pluck Comments is designed for sites that generate very large volumes of comments, at very high transaction rates, and is supported by versatile discovery features. <p>  <em>&ldquo;We are happy to partner with Janrain to provide our customers with a more complete solution for bridging their own online communities with popular destinations like Facebook and Twitter,&rdquo; said Jason Jaynes, vice president of products and marketing for Demand Media. &ldquo;Janrain Engage simplifies the process by which visitors register for community membership, by making it easy for them to use their Facebook credentials or some other non-anonymous identity. Our customers benefit from the social bridging that Janrain facilitates with more site traffic, greater visitor engagement, and higher value conversations on their sites.&rdquo;</em></p></li>  </ul> <p>Janrain&rsquo;s integration enables a website to easily register users with their identities on social networks such as Facebook, Twitter, or Google, then use this identity in online conversations, including automatically sharing their comments with their social networks.</p> <p> The benefits to websites of implementing commenting platforms and integrating online identities to commenting systems are simple and obvious:</p> <ul> <li>Quick and easy registration for users</li>  <li>Crowdsourcing of content</li> <li>Building a thriving community around subject matter experts</li> <li>Identifying and rewarding active contributors</li> <li>Popularizing content beyond the confines of your website</li> </ul>  <p>As Social Media guru, <a href=&quot;http://www.briansolis.com/&quot; target=&quot;_blank&quot;>Brian Solis</a>, points out in his book <a href=&quot;http://www.briansolis.com/2010/01/engage/&quot; target=&quot;_blank&quot;>Engage</a>, &ldquo;Social networks and platforms have expanded the roles of customers and peers from consumer to authorities, ambassadors and critics.&rdquo;&nbsp; Janrain Engage enables websites to turn your casual visitors into brand ambassadors by making it easy to build integrated and cohesive online experiences with leading commenting platforms.</p>  <p> If you are already using or considering using one of the above commenting platforms and would like to learn more about integrating a user&rsquo;s identity on social networks with your website, please <a href=&quot;/learn-more?product=Engage%20Pro&quot;>contact us</a>. Packaged integrations with each of the commenting solutions are available at the Janrain Engage Pro subscription level.</p>",        "plainText" : "Many of us recall the famous New Yorker cartoon from the 1990s that read %34On the Internet, Nobody Knows You're a Dog.%34 Fast-forward a decade and a half. Social media has given rise to new and different online behaviors. More consumers are creating, curating and critiquing online content than ever before, and now, penning their comments under a real identity.   Eager to take advantage of this behavior and the diminishing need for online anonymity, websites ranging from online guides to news media and entertainment sites to retail websites are enabling their readers to build social communities around content and discussions.  Today, Janrain is happy to announce deep technical integrations with the three leading commenting platforms: Disqus, Echo and Pluck, to make it easy to link a user's existing online identity on your website with his or her commenting persona.   DISQUS builds and connects communities via a large and rapidly growing network that spans over 200 million users each month, and provides publishers with advanced commenter interface and moderation tools.   %34DISQUS is proud to work with another industry leader, Janrain, in making social connectivity a more comprehensive and integrated experience for publishers everywhere%34 stated Ro Gupta, vice president of business development for DISQUS.    Echo allows publishers to turn their static sites into real-time news platforms with Real-time Comments, Real-time Recent Comments and Real-time News Rivers.   %34At Echo, our focus is partnering with the leading web properties in the world to bring state of the art real-time social features to their audience. Our goal is to be an invisible toolset that empowers publishers to innovate by integrating seamlessly with their identity and registration systems. Our partnership with Janrain is just another way we ensure that Echo is supportive of our publisher's business goals and existing technologies%34 stated Chris Saad, vice president of product strategy &amp; community for Echo.    Pluck Comments is an element of the larger Pluck Social Application Server, a platform that drives community for publishers like USA Today and brands like the NFL. Pluck Comments is designed for sites that generate very large volumes of comments, at very high transaction rates, and is supported by versatile discovery features.   %34We are happy to partner with Janrain to provide our customers with a more complete solution for bridging their own online communities with popular destinations like Facebook and Twitter,%34 said Jason Jaynes, vice president of products and marketing for Demand Media. %34Janrain Engage simplifies the process by which visitors register for community membership, by making it easy for them to use their Facebook credentials or some other non-anonymous identity. Our customers benefit from the social bridging that Janrain facilitates with more site traffic, greater visitor engagement, and higher value conversations on their sites.%34   Janrain's integration enables a website to easily register users with their identities on social networks such as Facebook, Twitter, or Google, then use this identity in online conversations, including automatically sharing their comments with their social networks.  The benefits to websites of implementing commenting platforms and integrating online identities to commenting systems are simple and obvious:  Quick and easy registration for users  Crowdsourcing of content Building a thriving community around subject matter experts Identifying and rewarding active contributors Popularizing content beyond the confines of your website   As Social Media guru, Brian Solis, points out in his book Engage, %34Social networks and platforms have expanded the roles of customers and peers from consumer to authorities, ambassadors and critics.%34  Janrain Engage enables websites to turn your casual visitors into brand ambassadors by making it easy to build integrated and cohesive online experiences with leading commenting platforms.   If you are already using or considering using one of the above commenting platforms and would like to learn more about integrating a user's identity on social networks with your website, please contact us. Packaged integrations with each of the commenting solutions are available at the Janrain Engage Pro subscription level.",        "link" : "http://www.janrain.comblogs/janrain-integrates-leading-commenting-platforms-disqus-echo-and-pluck",        "creator" : "Vidya Shivkumar",        "date" : "Oct 5, 2010 3:00 PM",        "images" :        [          "/../../sites/default/files/demikl_d_rounded_speech_bubble_clip_art_31739.jpg"        ]      }    },    {      "story" :      {        "title" : "Enabling Janrain Engage in Rails with Devise - Video",        "description" : "<p><a href=&quot;http://railscasts.com/&quot; target=&quot;_blank&quot;>Railscasts</a> recently posted a <a href=&quot;http://railscasts.com/episodes/233-engage-with-devise&quot; target=&quot;_blank&quot;>video tutorial demonstrating how to configure Janrain Engage in Rails with Devise</a>.&nbsp; The video provides step-by-step instructions to get up and running with Janrain Engage for social login on a Rails application in minutes.&nbsp; Take a look at the video and feel free to share your thoughts in the comments section below.</p>  <p><object height=&quot;385&quot; width=&quot;480&quot;><param name=&quot;movie&quot; value=&quot;http://www.youtube.com/v/ejsH707S7aM?fs=1&amp;hl=en_US&quot; /><param name=&quot;allowFullScreen&quot; value=&quot;true&quot; /><param name=&quot;allowscriptaccess&quot; value=&quot;always&quot; /><embed allowfullscreen=&quot;true&quot; allowscriptaccess=&quot;always&quot; height=&quot;385&quot; src=&quot;http://www.youtube.com/v/ejsH707S7aM?fs=1&amp;hl=en_US&quot; type=&quot;application/x-shockwave-flash&quot; width=&quot;480&quot;></embed></object></p><p>   Railscasts produces weekly video episodes featuring tips and tricks for developers working with Ruby on Rails.&nbsp; Special thanks to Ryan Bates at Railscasts for creating the demonstration.</p>",        "plainText" : "Railscasts recently posted a video tutorial demonstrating how to configure Janrain Engage in Rails with Devise.  The video provides step-by-step instructions to get up and running with Janrain Engage for social login on a Rails application in minutes.  Take a look at the video and feel free to share your thoughts in the comments section below.     Railscasts produces weekly video episodes featuring tips and tricks for developers working with Ruby on Rails.  Special thanks to Ryan Bates at Railscasts for creating the demonstration.",        "link" : "http://www.janrain.comblogs/enabling-janrain-engage-rails-devise-video",        "creator" : "Michael Olson",        "date" : "Sep 30, 2010 8:16 AM"      }    },    {      "story" :      {        "title" : "Social Commerce and the PayPal Innovate 2010 Conference",        "description" : "<p>Janrain will be participating in the upcoming <a href=&quot;https://www.paypal-xinnovate.com/&quot; target=&quot;_blank&quot;>PayPal X Developer Conference</a> on October 26-27 in Moscone Center, San Francisco. It looks like an action packed couple of days with a great line-up of speakers, including Tim O&#39;Reilly (CEO, <a href=&quot;http://www.oreilly.com&quot; target=&quot;_blank&quot;>O&#39;Reilly Media</a>), Marc Andreessen (co-founder, <a href=&quot;http://www.ning.com&quot; target=&quot;_blank&quot;>Ning</a>), Kara Swisher (Executive Editor, <a href=&quot;http://www.wsj.com&quot; target=&quot;_blank&quot;>Wall Street Journal</a>), John Donahoe (CEO, <a href=&quot;http://www.ebay.com&quot; target=&quot;_blank&quot;>eBay</a>), and Scott Thompson (President, <a href=&quot;http://www.paypal.com&quot; target=&quot;_blank&quot;>PayPal</a>).&nbsp; Key topics being discussed include Web Checkout; Financial Institutions and Business Payments; Mobile, Television, and Device Payments; Innovations in Payments and Beyond. &nbsp;</p>  <p> In 2010 we&#39;ve seen increasing adoption of <a href=&quot;/products/engage&quot;>social registration and login</a>, or what Jeremiah Owyang of Altimeter Group calls &quot;<a href=&quot;http://www.web-strategist.com/blog/2010/09/27/research-note-integrating-social-networks-with-your-corporate-website-with-social-sign-on/&quot; target=&quot;_blank&quot;>Social Sign On</a>,&quot; in the retail sector.&nbsp; Companies including <a href=&quot;http://www.sears.com&quot; target=&quot;_blank&quot;>Sears</a>, <a href=&quot;http://www.kmart.com&quot; target=&quot;_blank&quot;>Kmart</a>, <a href=&quot;http://www.kodak.com&quot; target=&quot;_blank&quot;>Kodak</a>, <a href=&quot;http://www.diesel.com&quot; target=&quot;_blank&quot;>Diesel</a>, <a href=&quot;http://www.levis.com&quot; target=&quot;_blank&quot;>Levis</a>, <a href=&quot;http://www.savings.com&quot; target=&quot;_blank&quot;>Savings.com</a>, <a href=&quot;http://www.redplum.com&quot; target=&quot;_blank&quot;>Red Plum</a>, <a href=&quot;http://www.hp.com&quot; target=&quot;_blank&quot;>HP</a>, <a href=&quot;http://www.fandango.com&quot; target=&quot;_blank&quot;>Fandango</a> and others are allowing customers to register with existing accounts at Google, Yahoo, AOL, Facebook, Twitter, LinkedIn, Microsoft, MySpace, and others to facilitate login, build richer customer profiles, and encourage customer social publishing to drive referral traffic to their websites. &nbsp;</p>  <p> To help move the market forward, the <a href=&quot;http://www.openid.net&quot;>OpenID Foundation</a> and <a href=&quot;http://openidentityexchange.org/&quot; target=&quot;_blank&quot;>Open Identity Exchange</a>, two non-profit governance organizations, are working to promote open standard technologies to improve consumer online experiences across the web. Both of these organizations are supported by PayPal and its eCommerce Developer Community.</p>  <p> At Innovate 2010 service providers, foundation members, and retailers will have an opportunity to discuss identity, payments, and social networking trends in online retail applications.&nbsp; Representatives from Janrain and PayPal will be available to discuss the newly formed OpenID Foundation Retail Advisory Committee (RAC).&nbsp; Learn more about the <a href=&quot;http://www.slideshare.net/bkkissel/openid-foundation-retail-advisory-committee-overview-5193852&quot; target=&quot;_blank&quot;>Retail Advisory Committee</a> in the SlideShare presentation below and the <a href=&quot;http://wiki.openid.net/OpenID-Retail-Advisory-Committee&quot; target=&quot;_blank&quot;>OpenID Foundation Wiki</a>.</p>  <div id=&quot;__ss_5193852&quot; style=&quot;width: 425px;&quot;><strong style=&quot;margin: 12px 0pt 4px; display: block;&quot;><a href=&quot;http://www.slideshare.net/bkkissel/openid-foundation-retail-advisory-committee-overview-5193852&quot; title=&quot;OpenID Foundation Retail Advisory Committee Overview&quot;>OpenID Foundation Retail Advisory Committee Overview</a></strong> <object height=&quot;355&quot; id=&quot;__sse5193852&quot; width=&quot;425&quot;><param name=&quot;movie&quot; value=&quot;http://static.slidesharecdn.com/swf/ssplayer2.swf?doc=openidfoundationretailadvisorycommitteeoverview-100913174702-phpapp02&amp;stripped_title=openid-foundation-retail-advisory-committee-overview-5193852&amp;userName=bkkissel&quot; /><param name=&quot;allowFullScreen&quot; value=&quot;true&quot; /><param name=&quot;allowScriptAccess&quot; value=&quot;always&quot; /><embed allowfullscreen=&quot;true&quot; allowscriptaccess=&quot;always&quot; height=&quot;355&quot; name=&quot;__sse5193852&quot; src=&quot;http://static.slidesharecdn.com/swf/ssplayer2.swf?doc=openidfoundationretailadvisorycommitteeoverview-100913174702-phpapp02&amp;stripped_title=openid-foundation-retail-advisory-committee-overview-5193852&amp;userName=bkkissel&quot; type=&quot;application/x-shockwave-flash&quot; width=&quot;425&quot;></embed></object></div>  <p>  Innovate 2010 is a great opportunity discuss how the Identity and Payments developer ecosystems can define the next generation Identity Trust framework to power commerce platforms. We hope you&#39;ll plan on attending this event and sharing your thoughts. &nbsp;</p> <p> As a special promotion for friends of Janrain, PayPal is offering a $100 discount to attend Innovate 2010.&nbsp; Just enter the promotion code &quot;<strong>LETSINNOVATE</strong>&rdquo; when you register. &nbsp;<br />   Additionally, Janrain, PayPal and members of the OpenID Foundation are planning a Retail Advisory Summit to be held in Silicon Valley in Q1 2011. We&rsquo;ll be planning this event during the <a href=&quot;http://www.internetidentityworkshop.com/iiwxi-11-in-mountain-view/&quot; target=&quot;_blank&quot;>Internet Identity Workshop XI</a> from November 2-4 in Mountain View, California. Drop us a line if you would like to participate or we can connect at one of these upcoming conferences.</p>",        "plainText" : "Janrain will be participating in the upcoming PayPal X Developer Conference on October 26-27 in Moscone Center, San Francisco. It looks like an action packed couple of days with a great line-up of speakers, including Tim O'Reilly (CEO, O'Reilly Media), Marc Andreessen (co-founder, Ning), Kara Swisher (Executive Editor, Wall Street Journal), John Donahoe (CEO, eBay), and Scott Thompson (President, PayPal).  Key topics being discussed include Web Checkout; Financial Institutions and Business Payments; Mobile, Television, and Device Payments; Innovations in Payments and Beyond.     In 2010 we've seen increasing adoption of social registration and login, or what Jeremiah Owyang of Altimeter Group calls %34Social Sign On,%34 in the retail sector.  Companies including Sears, Kmart, Kodak, Diesel, Levis, Savings.com, Red Plum, HP, Fandango and others are allowing customers to register with existing accounts at Google, Yahoo, AOL, Facebook, Twitter, LinkedIn, Microsoft, MySpace, and others to facilitate login, build richer customer profiles, and encourage customer social publishing to drive referral traffic to their websites.     To help move the market forward, the OpenID Foundation and Open Identity Exchange, two non-profit governance organizations, are working to promote open standard technologies to improve consumer online experiences across the web. Both of these organizations are supported by PayPal and its eCommerce Developer Community.   At Innovate 2010 service providers, foundation members, and retailers will have an opportunity to discuss identity, payments, and social networking trends in online retail applications.  Representatives from Janrain and PayPal will be available to discuss the newly formed OpenID Foundation Retail Advisory Committee (RAC).  Learn more about the Retail Advisory Committee in the SlideShare presentation below and the OpenID Foundation Wiki.  OpenID Foundation Retail Advisory Committee Overview     Innovate 2010 is a great opportunity discuss how the Identity and Payments developer ecosystems can define the next generation Identity Trust framework to power commerce platforms. We hope you'll plan on attending this event and sharing your thoughts.    As a special promotion for friends of Janrain, PayPal is offering a $100 discount to attend Innovate 2010.  Just enter the promotion code %34LETSINNOVATE%34 when you register.     Additionally, Janrain, PayPal and members of the OpenID Foundation are planning a Retail Advisory Summit to be held in Silicon Valley in Q1 2011. We'll be planning this event during the Internet Identity Workshop XI from November 2-4 in Mountain View, California. Drop us a line if you would like to participate or we can connect at one of these upcoming conferences.",        "link" : "http://www.janrain.comblogs/social-commerce-and-paypal-innovate-2010-conference",        "creator" : "Brian Kissel",        "date" : "Sep 29, 2010 9:26 AM"      }    },    {      "story" :      {        "title" : "Janrain's Upcoming Fall Event Schedule",        "description" : "<p><img alt=%34Janrain Upcoming Event Calendar%34 src=%34/sites/default/files/calendar_icon.gif%34 style=%34padding-top: 0px; padding-right: 0px; padding-bottom: 20px; padding-left: 20px; float: right; width: 200px; height: 188px; %34 />Over the last year, Janrain has attended <a href=&quot;http://www.facebook.com/pages/Janrain/135174526496719?v=app_2344061033&amp;vm=all&quot; target=&quot;_blank&quot;>a number of great conferences</a> and have met some very knowledgable folks. We&#39;re exicited to continue along the event curcuit this fall. Here are several events that we will be attending and/or presenting at. Drop us a line if you will be at one of these events, we&#39;d love to talk!</p>  <ul> <li><a href=&quot;http://www.riseofsocialcommerce.com/&quot; target=&quot;_blank&quot;><strong>Altimeter&#39;s Rise of Social Commerce</strong></a>&nbsp;<br />   October 6-7, 2010, <em>Palo Alto, CA</em><br />    Hashtag: <a href=&quot;http://twitter.com/#search?q=%23RSC10&quot; target=&quot;_blank&quot;>#RSC10</a><br />   &nbsp;</li> <li><a href=&quot;http://www.demogala.com/&quot;><strong>DEMOgala Technology Conference</strong></a><br />    October 7, 2010,<em> Denver, CO</em><br />   &quot;Technologies to Increase Online Engagement&quot; presented by Brian Kissel, Janrain CEO<br />   Hashtag: <a href=&quot;http://twitter.com/#!/search/%23DEMOgala%20&quot; target=&quot;_blank&quot;>#DEMOgala </a><br />    &nbsp;</li> <li><a href=&quot;http://www.internetidentityworkshop.com/iiwxi-11-in-mountain-view/&quot; target=&quot;_blank&quot;><strong>Internet Identity Workshop</strong></a><br />   November, 2-4, 2010,&nbsp;<em>Mountain View, CA</em><br />    Hashtag: <a href=&quot;http://twitter.com/#search/%23iiw&quot; target=&quot;_blank&quot;>#IIW</a><br />   &nbsp;</li> <li><strong>Stanford Alumni Event</strong><br />    November, 2-4, 2010, <em>Portland, OR</em><br />   &quot;Online Privacy Panel,&quot; Brian Kissel, Janrain CEO will be participating in this panel<br />   &nbsp;</li> <li><strong><a href=&quot;http://womma.org/summit/&quot; target=&quot;_blank&quot;>WOMMA Summit</a></strong><br />    November 17-19, 2010, <em>Las Vegas, NL</em><br />   &quot;Acquiring Customers and Increasing Engagement through Social Media,&quot; Tore Steen, Janrain VP, Marketing and Business Development will be presenting with our long time customer Lee Hammond, Director of New Media at <a href=&quot;http://www.interscope.com/&quot; target=&quot;_blank&quot;>Interscope Geffen A&amp;M Records (IGA)</a><br />    Hashtag:<a href=&quot;http://twitter.com/#search/%23WOMMA&quot; target=&quot;_blank&quot;> #WOMMA</a></li> </ul>",        "plainText" : "Over the last year, Janrain has attended a number of great conferences and have met some very knowledgable folks. We're exicited to continue along the event curcuit this fall. Here are several events that we will be attending and/or presenting at. Drop us a line if you will be at one of these events, we'd love to talk!   Altimeter's Rise of Social Commerce    October 6-7, 2010, Palo Alto, CA    Hashtag: #RSC10     DEMOgala Technology Conference    October 7, 2010, Denver, CO   %34Technologies to Increase Online Engagement%34 presented by Brian Kissel, Janrain CEO   Hashtag: #DEMOgala       Internet Identity Workshop   November, 2-4, 2010, Mountain View, CA    Hashtag: #IIW     Stanford Alumni Event    November, 2-4, 2010, Portland, OR   %34Online Privacy Panel,%34 Brian Kissel, Janrain CEO will be participating in this panel     WOMMA Summit    November 17-19, 2010, Las Vegas, NL   %34Acquiring Customers and Increasing Engagement through Social Media,%34 Tore Steen, Janrain VP, Marketing and Business Development will be presenting with our long time customer Lee Hammond, Director of New Media at Interscope Geffen A&amp;M Records (IGA)    Hashtag: #WOMMA ",        "link" : "http://www.janrain.comblogs/janrains-upcoming-fall-event-schedule",        "creator" : "Katie Keenan",        "date" : "Sep 24, 2010 4:40 PM",        "images" :        [          "/sites/default/files/calendar_icon.gif"        ]      }    },    {      "story" :      {        "title" : "Citysearch Increases Referral Traffic from Facebook with Janrain Engage",        "description" : "<p><a href=&quot;http://www.citysearch.com&quot; target=&quot;_blank&quot;>Citysearch</a> was an early adopter of Facebook Connect in late 2008. Recognizing that its members actively contributed ratings and reviews on the site, Citysearch sought to facilitate word-of-mouth marketing and promote sharing of user-generated content on Facebook.</p>  <p>We just published a <a href=&quot;/sites/default/files/Success-Story_CitySearch.pdf&quot; onclick=&quot;gaTrack(this, &#39;/downloads/Success-Story_CitySearch&#39;);&quot;>success story highlighting the benefits Citysearch has experienced since choosing Janrain Engage</a> to manage its social connection to Facebook.&nbsp; These include:</p> <ul>  <li><strong>12% of user-generated content</strong> from Citysearch is shared with friends on Facebook</li> <li>Content shared to Facebook is viewed by an <strong>average of 40 people and generates 28 clicks back to Citysearch.</strong></li> </ul>  <p>Here is a short video that demonstrates how Citysearch is using Janrain Engage:</p> <p><object height=&quot;385&quot; width=&quot;640&quot;><param name=&quot;movie&quot; value=&quot;http://www.youtube.com/v/VBbmR_mBDsQ?fs=1&amp;hl=en_US&quot; /><param name=&quot;allowFullScreen&quot; value=&quot;true&quot; /><param name=&quot;allowscriptaccess&quot; value=&quot;always&quot; /><embed allowfullscreen=&quot;true&quot; allowscriptaccess=&quot;always&quot; height=&quot;385&quot; src=&quot;http://www.youtube.com/v/VBbmR_mBDsQ?fs=1&amp;hl=en_US&quot; type=&quot;application/x-shockwave-flash&quot; width=&quot;640&quot;></embed></object></p>  <p>Citysearch is similar to a number of additional Janrain customers that initially integrated directly with Facebook to increase online registration rates and drive qualified referral traffic to their site.&nbsp; After recognizing the challenge of allocating internal resources to maintain the Facebook implementation and the <a href=&quot;/blogs/measuring-popularity-social-media-platforms-across-web&quot;>benefits to supporting multiple social networks and identity providers</a>, these organizations migrated to <a href=&quot;/products/engage&quot;>Janrain Engage</a>.&nbsp; As a hosted solution, <a href=&quot;/products/engage&quot;>Janrain Engage</a> handles all of the &ldquo;plumbing&rdquo; changes from Facebook and other identity providers on behalf of customers like Citysearch, enabling them to focus on their core competency.</p>  <p>By leveraging <a href=&quot;/products/engage&quot;>Janrain Engage</a> to connect its site to a social network like Facebook, Citysearch has exposed its content to a new audience and increased site membership.</p>",        "plainText" : "Citysearch was an early adopter of Facebook Connect in late 2008. Recognizing that its members actively contributed ratings and reviews on the site, Citysearch sought to facilitate word-of-mouth marketing and promote sharing of user-generated content on Facebook.  We just published a success story highlighting the benefits Citysearch has experienced since choosing Janrain Engage to manage its social connection to Facebook.  These include:   12% of user-generated content from Citysearch is shared with friends on Facebook Content shared to Facebook is viewed by an average of 40 people and generates 28 clicks back to Citysearch.   Here is a short video that demonstrates how Citysearch is using Janrain Engage:   Citysearch is similar to a number of additional Janrain customers that initially integrated directly with Facebook to increase online registration rates and drive qualified referral traffic to their site.  After recognizing the challenge of allocating internal resources to maintain the Facebook implementation and the benefits to supporting multiple social networks and identity providers, these organizations migrated to Janrain Engage.  As a hosted solution, Janrain Engage handles all of the %34plumbing%34 changes from Facebook and other identity providers on behalf of customers like Citysearch, enabling them to focus on their core competency.  By leveraging Janrain Engage to connect its site to a social network like Facebook, Citysearch has exposed its content to a new audience and increased site membership.",        "link" : "http://www.janrain.comblogs/citysearch-increases-referral-traffic-facebook-janrain-engage",        "creator" : "Michael Olson",        "date" : "Sep 23, 2010 11:27 AM"      }    },    {      "story" :      {        "title" : "Janrain Webinar Follow-up - Revenue is the Key Driver Behind Offering Registration",        "description" : "<p>Last Thursday during Janrain&rsquo;s&nbsp; webinar, &ldquo;<a href=&quot;/blogs/janrain-best-practices-webinar-improving-online-registration-drive-revenue&quot;>Improving Online Registration to Drive Revenue</a>,&rdquo; we shared several key best practices with organizations seeking to optimize their online registration process and provide compelling incentives to facilitate member acquisition.&nbsp; Questions were posed to the audience of nearly 100 attendees throughout the session, and we would like to share the results.</p>  <p>85% of attendees polled currently have a user registration process in place today.&nbsp; With the advent of the social web, most marketers recognize the value in knowing more about their online audience and understand that this is often the first step to success online.</p> <p><img alt=%34Does your website have a user registration process%34 src=%34/sites/default/files/does-your-website-have-a-user-registration-process-in-place.JPG%34 style=%34width: 280px; height: 160px;%34 /></p>  <p> 38% of those polled currently offer registration and login through Facebook, Twitter, Google, or other networks, compared to 62% that require users to create a site-specific username and password.</p> <p><img alt=%34Do you offer login through Facebook, Twitter, Google or other social networks%34 src=%34/sites/default/files/do-you-offer-login-through-social-networks.JPG%34 style=%34width: 280px; height: 156px;%34 /></p>  <p> Sites that do not enable users to login with their existing social network or email accounts miss an opportunity to grow their audience, and many <a href=&quot;/customers&quot;>Janrain customers</a> experience a <a href=&quot;/customers/success-stories&quot;>10-50% increase in registrations</a> after enabling users to login with an existing social network account via <a href=&quot;/products/engage&quot;>Janrain Engage</a>.</p>  <p>We also asked attendees to cite the most compelling reasons for users to register on their site.&nbsp; Not surprisingly, increased revenue is the key driver behind offering registration &ndash; 76% of those polled tie online revenue to registered users.&nbsp; Depending on the type of site, revenue opportunities could involve targeted advertisements to users based on their demographic information or product recommendations based on past purchasing behavior.</p> <p><img alt=%34most important reasons for users to register%34 src=%34/sites/default/files/most-important-reasons-for-users-to-register.JPG%34 style=%34width: 280px; height: 163px;%34 /></p>  <p> 68% of respondents also value community building as a key driver behind offering user registration.&nbsp; The most successful communities on the web thrive due to user-generated content, and whether your site offers discussion forums, reviews or knowledge exchange, membership is the catalyst behind community development.</p> <p>Fostering engagement is an overarching goal for most online businesses and influences other metrics such as revenue and community building.&nbsp; That said, 53% of those polled highlighted the opportunity to better engage with members as a key incentive for offering membership.</p> <p>All in all, having a streamlined online registration process can provide enormous value to your website. Once you know more about your users, you can offer them a more engaging experience and in turn increase loyalty, brand awareness and most importantly, your online ROI. If you did not have a chance to attend our webinar, stay tuned as we plan to offer more webinars in the future.</p>",        "plainText" : "Last Thursday during Janrain's  webinar, %34Improving Online Registration to Drive Revenue,%34 we shared several key best practices with organizations seeking to optimize their online registration process and provide compelling incentives to facilitate member acquisition.  Questions were posed to the audience of nearly 100 attendees throughout the session, and we would like to share the results.  85% of attendees polled currently have a user registration process in place today.  With the advent of the social web, most marketers recognize the value in knowing more about their online audience and understand that this is often the first step to success online.    38% of those polled currently offer registration and login through Facebook, Twitter, Google, or other networks, compared to 62% that require users to create a site-specific username and password.    Sites that do not enable users to login with their existing social network or email accounts miss an opportunity to grow their audience, and many Janrain customers experience a 10-50% increase in registrations after enabling users to login with an existing social network account via Janrain Engage.  We also asked attendees to cite the most compelling reasons for users to register on their site.  Not surprisingly, increased revenue is the key driver behind offering registration - 76% of those polled tie online revenue to registered users.  Depending on the type of site, revenue opportunities could involve targeted advertisements to users based on their demographic information or product recommendations based on past purchasing behavior.    68% of respondents also value community building as a key driver behind offering user registration.  The most successful communities on the web thrive due to user-generated content, and whether your site offers discussion forums, reviews or knowledge exchange, membership is the catalyst behind community development. Fostering engagement is an overarching goal for most online businesses and influences other metrics such as revenue and community building.  That said, 53% of those polled highlighted the opportunity to better engage with members as a key incentive for offering membership. All in all, having a streamlined online registration process can provide enormous value to your website. Once you know more about your users, you can offer them a more engaging experience and in turn increase loyalty, brand awareness and most importantly, your online ROI. If you did not have a chance to attend our webinar, stay tuned as we plan to offer more webinars in the future.",        "link" : "http://www.janrain.comblogs/janrain-webinar-follow-revenue-key-driver-behind-offering-registration",        "creator" : "Michael Olson",        "date" : "Sep 20, 2010 7:51 AM",        "images" :        [          "/sites/default/files/does-your-website-have-a-user-registration-process-in-place.JPG",          "/sites/default/files/do-you-offer-login-through-social-networks.JPG",          "/sites/default/files/most-important-reasons-for-users-to-register.JPG"        ]      }    },    {      "story" :      {        "title" : "Do You Have a Member Acquisition Strategy For Your Website?",        "description" : "<p><a href=&quot;/creating-effective-online-member-acquisition-strategy&quot;><img alt=%34Janrain Marketing Brief Creating an Effective Online Member Acquisition Strategy%34 src=%34/sites/default/files/Member-Acquisition-Strategy-thumbnail.JPG%34 style=%34padding: 0pt 0pt 20px 20px; width: 140px; height: 181px; float: right;border:0;%34 /></a>We just published the third in our series of Janrain Marketing Briefs on the topic of <a href=&quot;/creating-effective-online-member-acquisition-strategy&quot;>creating an effective online member acquisition strategy</a>. Key metrics for marketers have shifted with the emergence of the social web. Quality of site traffic now takes precedence over quantity, interactions on your site are far more important than just time on site, and actively sharing content from your site leads to more effective word of mouth marketing than passive page views.</p>  <p>The critical foundation underlying these new success metrics is knowledge of your users. This marketing brief outlines some easy steps you can take to accelerate both the registration process for your site and effective ways to encourage visitors to become engaged members on your site. Topics discussed include:</p> <ul> <li>The &ldquo;give to get&rdquo; paradigm of providing incentives for visitors to register</li> <li>Member acquisition strategies &ndash; benefits to offer your members</li>  <li>Expanding your membership through word-of-mouth marketing</li> <li>Optimizing the registration process</li> <li>Offering registration with an existing social network or email identity</li> </ul> <p>We invite you to download <a href=&quot;/creating-effective-online-member-acquisition-strategy&quot;>Creating an Effective Online Member Acquisition Strategy</a>, the new Janrain Marketing Brief, and share your feedback.</p>",        "plainText" : "We just published the third in our series of Janrain Marketing Briefs on the topic of creating an effective online member acquisition strategy. Key metrics for marketers have shifted with the emergence of the social web. Quality of site traffic now takes precedence over quantity, interactions on your site are far more important than just time on site, and actively sharing content from your site leads to more effective word of mouth marketing than passive page views.  The critical foundation underlying these new success metrics is knowledge of your users. This marketing brief outlines some easy steps you can take to accelerate both the registration process for your site and effective ways to encourage visitors to become engaged members on your site. Topics discussed include:  The %34give to get%34 paradigm of providing incentives for visitors to register Member acquisition strategies - benefits to offer your members  Expanding your membership through word-of-mouth marketing Optimizing the registration process Offering registration with an existing social network or email identity  We invite you to download Creating an Effective Online Member Acquisition Strategy, the new Janrain Marketing Brief, and share your feedback.",        "link" : "http://www.janrain.comblogs/do-you-have-member-acquisition-strategy-your-website",        "creator" : "Michael Olson",        "date" : "Sep 16, 2010 10:28 AM",        "images" :        [          "/sites/default/files/Member-Acquisition-Strategy-thumbnail.JPG"        ]      }    },    {      "story" :      {        "title" : "New Janrain Engage WordPress Plugin for WordPress 3.0 or Higher",        "description" : "<p><a href=&quot;http://wordpress.org/extend/plugins/rpx/&quot; target=&quot;_blank&quot;><img alt=%34Janrain Engage WordPress Plugin%34 src=%34http://www.janrain.com/sites/default/files/wp-lg.gif%34 style=%34border:0; padding-top: 0px; padding-right: 0px; padding-bottom: 20px; padding-left: 20px; float: right; width: 230px; %34 /></a>For those of you using <a href=&quot;http://wordpress.org/&quot; target=&quot;_blank&quot;>WordPress</a>,&nbsp;a popular content management system for websites, you&rsquo;ll be happy to hear that we&rsquo;ve released a new version of the&nbsp;<a href=&quot;http://wordpress.org/extend/plugins/rpx/&quot; target=&quot;_blank&quot;>Janrain Engage Wordpress Plugin</a>. We built this plugin from the ground up with the user experience in mind. Features included in this plugin:</p>  <h3><strong>Registration &amp; Login via a Preferred Social Network or Email Provider</strong></h3> <p>Give your visitors the option to sign-in to your site with their existing credentials from a social network or email provider such as Facebook, Google, Twitter, Yahoo!, LinkedIn, Windows Live, MySpace, AOL and others (<a href=&quot;http://www.janrain.com/solutions/supported-networks&quot;>16 Supported Networks</a>).</p> <h3><strong>Optional Displays</strong></h3>  <ul> <li>Janrain Engage block on the standard WordPress registration and login screen</li> <li>Janrain Engage block next to login prompt for comments</li> <li>Janrain Engage block&nbsp;displayed anywhere within your specified widget area</li> </ul>  <h3><strong>Collects Email Addresses</strong></h3> <p>Prompts users to enter an email address if the provider used for login does not pass a verified email address (WordPress Requirement).</p> <h3><strong>Legacy Account Mapping</strong></h3> <p>If your user has an existing account with your site, Janrain Engage will map profile data received at login with the existing account (via verified email only).</p>  <h3><strong>Social Sharing</strong></h3> <p>A customizable widget to share articles to multiple social networks simultaneously. Users can select up to four social communities such as Facebook, Twitter, LinkedIn and Yahoo for publishing. On average, each postis will generate nine referral clicks back to your site for each post.</p> <p><strong>To see this plugin in action, <a href=&quot;http://plugins.janrain.com/wordpress/&quot; target=&quot;_blank&quot;>click here</a>.</strong></p>  <p>We are very excited to announce this new <a href=&quot;http://wordpress.org/extend/plugins/rpx/&quot; target=&quot;_blank&quot;>Janrain Engage Wordpress Plugin</a> and will continue to rollout new features and functionality in the coming months. We&rsquo;d love to hear your feedback so we can continue to improve upon our product.</p>",        "plainText" : "For those of you using WordPress, a popular content management system for websites, you'll be happy to hear that we've released a new version of the Janrain Engage Wordpress Plugin. We built this plugin from the ground up with the user experience in mind. Features included in this plugin:  Registration &amp; Login via a Preferred Social Network or Email Provider Give your visitors the option to sign-in to your site with their existing credentials from a social network or email provider such as Facebook, Google, Twitter, Yahoo!, LinkedIn, Windows Live, MySpace, AOL and others (16 Supported Networks). Optional Displays   Janrain Engage block on the standard WordPress registration and login screen Janrain Engage block next to login prompt for comments Janrain Engage block displayed anywhere within your specified widget area   Collects Email Addresses Prompts users to enter an email address if the provider used for login does not pass a verified email address (WordPress Requirement). Legacy Account Mapping If your user has an existing account with your site, Janrain Engage will map profile data received at login with the existing account (via verified email only).  Social Sharing A customizable widget to share articles to multiple social networks simultaneously. Users can select up to four social communities such as Facebook, Twitter, LinkedIn and Yahoo for publishing. On average, each postis will generate nine referral clicks back to your site for each post. To see this plugin in action, click here.  We are very excited to announce this new Janrain Engage Wordpress Plugin and will continue to rollout new features and functionality in the coming months. We'd love to hear your feedback so we can continue to improve upon our product.",        "link" : "http://www.janrain.comblogs/new-janrain-engage-wordpress-plugin-wordpress-30-or-higher",        "creator" : "Katie Keenan",        "date" : "Sep 14, 2010 9:47 AM",        "images" :        [          "http://www.janrain.com/sites/default/files/wp-lg.gif"        ]      }    }      ]}